<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Contenido por secci&#243;n</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="1056466"></a><h3 class="newpage"> Contenido por secci&#243;n</h3>
<p><a name="1056467"></a>A continuaci&#243;n se presenta una breve descripci&#243;n de cada secci&#243;n de la ayuda en l&#237;nea.</p><a name="1056471"></a><h5><a href="01_welcome.html#1055361">Bienvenidos a Seagate Crystal Reports</a></h5><p><a name="1056472"></a>Esta secci&#243;n ofrece una introducci&#243;n general sobre la ayuda en l&#237;nea y del manual del usuario. Tambi&#233;n contiene una lista de convenciones de teclas, comandos y botones usados en el manual del usuario.</p><a name="1056476"></a><h5><a href="02_whtnw.html#51365">Novedades</a></h5><p><a name="1056480"></a>Seagate Crystal Reports incluye un conjunto de funciones nuevas para hacer que los informes sean a&#250;n m&#225;s flexibles y tambi&#233;n incorpora muchas mejoras sugeridas por los usuarios. Esta secci&#243;n identifica y describe las nuevas funciones y mejoras hechas a la presente versi&#243;n de Seagate Crystal Reports.</p><a name="1056492"></a><h5><a href="04_quick.html#65368">Inicio r&#225;pido</a></h5><p><a name="1056495"></a>Esta secci&#243;n comienza con una introducci&#243;n general sobre los informes de muestra y datos usados com&#250;nmente con Seagate Crystal Reports. A continuaci&#243;n, muestra una introducci&#243;n general sobre los asistentes de informes, tanto los usuarios nuevos como los avanzados se pueden beneficiar al consultar el Asistente de informes est&#225;ndar ya que tiene muchos pasos comunes a los dem&#225;s asistentes de informes. Finalmente, la secci&#243;n ofrece dos tutoriales: uno para nuevos usuarios y otro para usuarios m&#225;s avanzados.</p><a name="1056500"></a><h5><a href="05_concept_rpt.html#186939">Conceptos de dise&#241;o de informes</a></h5><p><a name="1056501"></a>Esta secci&#243;n describe los conceptos b&#225;sicos del dise&#241;o de informes y le ayuda a decidir qu&#233; informaci&#243;n desea incluir en su informe.</p><a name="1056505"></a><h5><a href="06_create_rpt.html#220498">Introducci&#243;n a la Elaboraci&#243;n de Informes</a></h5><p><a name="1056509"></a>Esta secci&#243;n le muestra los aspectos b&#225;sicos de la creaci&#243;n de informes en Seagate Crystal Reports. Primero aprender&#225; acerca del entorno de dise&#241;o de informes, luego c&#243;mo seleccionar tablas de bases de datos, colocar objetos en un informe y ordenar, agrupar y sacar totales de los datos de sus informes.</p><a name="1056513"></a><h5><a href="07_recordgroupsel.html#53140">Selecci&#243;n de registros</a></h5><p><a name="1056514"></a>Esta secci&#243;n muestra c&#243;mo filtrar los registros que desea incluir en un informe. Utilice las herramientas de selecci&#243;n de registros para visualizar los registros de un grupo de clientes determinado, n&#250;meros de cuenta espec&#237;ficos o un rango de fecha en particular.</p><a name="1056518"></a><h5><a href="08_sortgrouptotal.html#246744">Ordenamiento, Agrupamiento y Totalizaci&#243;n</a></h5><p><a name="1056519"></a>Ordenar, agrupar y sacar totales son pasos necesarios que convierten datos desorganizados en informaci&#243;n &#250;til. Esta secci&#243;n describe los tipos de ordenamiento, agrupamiento y c&#225;lculo de totales que se pueden efectuar en un informe.</p><a name="1056523"></a><h5><a href="09_runtotal.html#35981">Totales Acumulados</a></h5><p><a name="1056524"></a>Los totales acumulados son una forma flexible y poderosa de crear res&#250;menes especializados y de incrementar continuamente los totales. Esta secci&#243;n muestra c&#243;mo agregar un total acumulado b&#225;sico y el total acumulado de un grupo al informe. Tambi&#233;n aprender&#225; a crear totales acumulados condicionales y totales acumulados mediante f&#243;rmulas.</p><a name="1056528"></a><h5><a href="10_multsec_rep.html#617382">Informes de Secci&#243;n M&#250;ltiple</a></h5><p><a name="1056529"></a>Esta secci&#243;n<EM> </EM>muestra los diversos tipos de informes sofisticados que puede crear usando las capacidades de elaboraci&#243;n de informes de varias secciones en Seagate Crystal Reports. Estas capacidades le permiten crear informes que consideren los valores de manera diferente, seg&#250;n los criterios establecidos. Estos conceptos se aplican despu&#233;s en la creaci&#243;n de cartas modelo.</p><a name="1056536"></a><h5><a href="11_format.html#94868">Formato</a></h5><p><a name="1056537"></a>Los cambios de formato son las modificaciones en la presentaci&#243;n y dise&#241;o de un informe, as&#237; como la apariencia del texto, objetos o secciones completas. Esta secci&#243;n detalla los m&#233;todos que puede usar para resaltar los datos, cambiar la presentaci&#243;n de fechas, n&#250;meros y otros valores, ocultar secciones no deseadas y efectuar una variedad de tareas de formato para dar una apariencia profesional al informe.</p><a name="1056541"></a><h5><a href="12_chart.html#43833">Elaboraci&#243;n de Gr&#225;ficos</a></h5><p><a name="1056542"></a>Seagate Crystal Reports le permite resumir datos en gr&#225;ficos y tablas de colores y f&#225;ciles de leer. Esta secci&#243;n muestra c&#243;mo crear gr&#225;ficos y c&#243;mo usarlos en informes para que los datos tengan m&#225;s significado y sean m&#225;s f&#225;ciles de entender. Puede elegir entre varios tipos y presentaciones de gr&#225;ficos, as&#237; como profundizar para ver los detalles tras los res&#250;menes gr&#225;ficos y dar formato a objetos del gr&#225;fico.</p><a name="1056546"></a><h5><a href="13_map.html#495988">Elaboraci&#243;n de Mapas</a></h5><p><a name="1056547"></a>Seagate Crystal Reports le permite incluir mapas geogr&#225;ficos profesionales en cada informe. Esta secci&#243;n explica c&#243;mo usar los informes para hacer que los datos tengan mayor significado y sean m&#225;s f&#225;ciles de interpretar. Puede personalizar y reorganizar la apariencia de un mapa y activar el modo de profundizaci&#243;n para ver los detalles tras los res&#250;menes gr&#225;ficos.</p><a name="1056551"></a><h5><a href="14_ole.html#29938">OLE</a></h5><p><a name="1056552"></a>Esta secci&#243;n explica c&#243;mo se puede usar la vinculaci&#243;n e incrustaci&#243;n de objetos (OLE) para editar gr&#225;ficos y otros objetos en sus informes en vez de abrir una aplicaci&#243;n adicional.</p><a name="1056556"></a><h5><a href="15_CrossTabs.html#53234">Objetos de Tablas Cruzadas</a></h5><p><a name="1056557"></a>Un objeto de tabla cruzada es una cuadr&#237;cula que muestra valores que se agrupan y resumen en dos direcciones. Esta secci&#243;n ofrece informaci&#243;n acerca de c&#243;mo usar objetos de tablas cruzadas en su informe.</p><a name="1056561"></a><h5><a href="16_olap.html#53160">Creaci&#243;n y actualizaci&#243;n de informes OLAP</a></h5><p><a name="1056562"></a>Esta secci&#243;n describe c&#243;mo crear informes OLAP con varias fuentes de datos multidimensionales y de OLAP, y c&#243;mo actualizarlos cuando cambie la ubicaci&#243;n de sus datos.</p><a name="1056566"></a><h5><a href="17_printvex.html#131379">Impresi&#243;n, Vista y Exportaci&#243;n</a></h5><p><a name="1056567"></a>Esta secci&#243;n proporciona informaci&#243;n necesaria para distribuir informes terminados usando diversos m&#233;todos (como impresi&#243;n,env&#237;o por fax o exportaci&#243;n). Adem&#225;s incluye instrucciones para ver sus informes usando un explorador de web y visualizadores de informes.</p><a name="1056571"></a><h5><a href="18_addins.html#82528">Creaci&#243;n de informes desde Excel y Access</a></h5><p><a name="1056572"></a>Esta secci&#243;n describe los complementos de Microsoft Excel y Microsoft Access. Explica c&#243;mo instalar el asistente de Seagate Crystal Report y c&#243;mo crear informes desde una tabla o consulta de Access y desde una hoja Excel.</p><a name="1056579"></a><h5><a href="19_introformulas.html#172160">Uso de las f&#243;rmulas</a></h5><p><a name="1056580"></a>Esta secci&#243;n explica los aspectos fundamentales de las f&#243;rmulas y le presenta el Editor de f&#243;rmulas para que pueda comenzar a crear f&#243;rmulas. </p><a name="1056584"></a><h5><a href="20_basicsyntax.html#125216">Creaci&#243;n de f&#243;rmulas con sintaxis Basic</a></h5><p><a name="1056585"></a>Esta secci&#243;n presenta una introducci&#243;n general sobre las diversas partes de una f&#243;rmula. Aprender&#225; acerca de la sintaxis Basic y las t&#233;cnicas que puede usar al crear una f&#243;rmula.</p><a name="1056589"></a><h5><a href="21_crystalsyntax.html#166574">Creaci&#243;n de f&#243;rmulas con sintaxis Crystal</a></h5><p><a name="1056590"></a>Esta secci&#243;n presenta una informaci&#243;n general sobre las diversas partes de una f&#243;rmula. Aprender&#225; acerca de Sintaxis Crystal y las t&#233;cnicas que puede usar al crear una f&#243;rmula.</p><a name="1056594"></a><h5><a href="22_param.html#47204">Campos de Par&#225;metro</a></h5><p><a name="1056595"></a>Esta secci&#243;n explica qu&#233; son campos de par&#225;metros y c&#243;mo se pueden aplicar para crear un informe que se pueda usar para acceder a diferentes tipos de datos dependiendo de las necesidades del usuario.</p><a name="1056599"></a><h5><a href="23_subreports.html#54945">Subinformes</a></h5><p><a name="1056600"></a>Un subinforme es un informe dentro de otro informe. Con los subinformes puede combinar informes no relacionados, coordinar datos que de lo contrario no se pueden vincular y presentar diferentes vistas de los mismos datos en un solo informe. Esta secci&#243;n explica c&#243;mo crear y usar subinformes.</p><a name="1056604"></a><h5><a href="24_under_databases.html#319821">Manipulaci&#243;n de bases de datos</a></h5><p><a name="1056605"></a>Esta secci&#243;n describe los aspectos esenciales que necesita saber para entender el patr&#243;n y uso de las bases de datos. Tras describir las bases de datos relacionales (incluidas las de fuentes de datos ODBC), indexado y vinculaci&#243;n de tablas, la secci&#243;n  presenta los conceptos de procesamiento del lado del servidor (llevando el procesamiento de informes a nivel de servidor) y asignaci&#243;n de campos (restableciendo asignaciones de campos de bases de datos e informes despu&#233;s que cambia una base de datos). Finalmente, la secci&#243;n  se concentra en las tareas comunes relacionadas con las bases de datos, como cambio de un controlador de base de datos y creaci&#243;n de una fuente de datos ODBC.</p><a name="1056609"></a><h5><a href="25_access_sources.html#246299">Acceso a las fuentes de datos</a></h5><p><a name="1056613"></a>Seagate Crystal Reports trabaja con todo tipo de datos, desde archivos de texto simple hasta bases de datos SQL cliente<nobr>-s</nobr>ervidor avanzadas. Esta secci&#243;n muestra c&#243;mo el programa se conecta con diferentes fuentes de datos y cu&#225;les archivos deben existir para poder hacer la conexi&#243;n. &Eacute;sta es una secci&#243;n m&#225;s detallada para usuarios avanzados que necesitan saber c&#243;mo funciona Seagate Crystal Reports bajo la superficie.</p><a name="1056620"></a><h5><a href="26_sql.html#59071">Crystal SQL Designer</a></h5><p><a name="1056621"></a>Esta secci&#243;n muestra c&#243;mo dise&#241;ar consultas que se pueden usar para an&#225;lisis ad hoc o conjuntos de resultados para la creaci&#243;n de informes. El Crystal SQL Designer se puede usar para crear, modificar y optimizar consultas SQL complejas.</p><a name="1056625"></a><h5><a href="27_dictionary.html#143975">Diccionarios</a></h5><p><a name="1056626"></a>Los diccionarios son vistas de datos estructuradas y simplificadas que se pueden crear para algunos o todos los usuarios de una organizaci&#243;n. Al trabajar con los diccionarios, los usuarios solamente ven la informaci&#243;n que necesitan y que usted desea que vean. Esta secci&#243;n muestra c&#243;mo configurar y usar los diccionarios para mejorar la seguridad y eficiencia organizacional.</p><a name="1056630"></a><h5><a href="a_rptpm.html#20542">Ap&#233;ndice A: Modelo de procesamiento de informes</a></h5><p><a name="1056634"></a>Seagate Crystal Reports usa un avanzado modelo de informaci&#243;n de paso m&#250;ltiple para el procesamiento de informes. Comprender este modelo le ayuda a dise&#241;ar informes eficientes y solucionar problemas en la elaboraci&#243;n.</p><a name="1056638"></a><h5><a href="b_suprt.html#27002">Ap&#233;ndice B: Soporte del producto</a></h5><p><a name="1056639"></a>Este ap&#233;ndice enumera diversos contactos para obtener soporte para el producto.</p><a name="1056648"></a><h5><a href="glossary.html#114761">Glosario</a></h5><p><a name="1056649"></a>La ayuda en l&#237;nea cuenta con un amplio glosario que explica los conceptos b&#225;sicos de elaboraci&#243;n de informes y de bases de datos, as&#237; como tambi&#233;n t&#233;rminos espec&#237;ficos del programa. </p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "01_welcome3.html";
var next = "01_welcome5.html";

function setTopicID() { 
      var number = "1056466"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


