<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Bienvenidos</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="1020449"></a><h2 class="newpage">Bienvenidos</h2><p><a name="1033973"></a>Seagate Crystal Reports est&#225; dise&#241;ado para trabajar con su base de datos para ayudarlo a analizar e interpretar informaci&#243;n importante. Seagate Crystal Reports facilita la creaci&#243;n de informes simples y dispone tambi&#233;n de herramientas poderosas necesarias para generar informes complejos o especializados.</p><a name="1034472"></a><h5>Cree cualquier informe que se pueda imaginar</h5><p><a name="1034719"></a>Seagate Crystal Reports est&#225; dise&#241;ado para generar el informe que desea desde pr&#225;cticamente cualquier fuente de datos. Los asistentes incorporados lo gu&#237;an paso a paso a trav&#233;s de la creaci&#243;n de informes y la complexi&#243;n de tareas comunes. Las f&#243;rmulas, tablas cruzadas, subinformes y formatos condicionales ayudan a entender mejor los datos y descubrir relaciones importantes que, de lo contrario, podr&#237;an estar ocultas. Los gr&#225;ficos y mapas geogr&#225;ficos proporcionan informaci&#243;n en forma visual cuando las palabras y n&#250;meros no son suficiente.</p><a name="1034481"></a><h5>Extienda la elaboraci&#243;n de informes al web</h5><p><a name="1034728"></a>La flexibilidad de Seagate Crystal Reports no termina con la creaci&#243;n de informes, ya que &#233;stos se pueden publicar en una variedad de formatos que incluyen Microsoft&#174; Word y Excel, correo electr&#243;nico e incluso en el Internet. La elaboraci&#243;n avanzada de informes en el Internet permite a otros miembros de su grupo de trabajo ver y actualizar informes compartidos en sus exploradores de web.</p><a name="1034710"></a><h5>Incorpore informes en las aplicaciones</h5><p><a name="1034790"></a>Los desarrolladores de aplicaciones y de web pueden ahorrar tiempo y satisfacer las necesidades de sus usuarios al integrar el poder de procesamiento de informes de Seagate Crystal Reports en sus aplicaciones de bases de datos. El soporte de los lenguajes de desarrollo m&#225;s usados facilita la adici&#243;n de informes a cualquier aplicaci&#243;n.</p><p><a name="1034711"></a> </p>
<p><a name="1034712"></a>Ya sea el encargado de servicios web en IT, el gerente de promoci&#243;n en marketing, el administrador de base de datos en finanzas o el presidente general, Seagate Crystal Reports es una herramienta poderosa dise&#241;ada para ayudar a cualquier usuario a analizar e interpretar la informaci&#243;n que verdaderamente es importante.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "01_welcome.html";
var next = "01_welcome3.html";

function setTopicID() { 
      var number = "1020449"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


