<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Elaboraci&#243;n de informes en el web</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="58896"></a><h2 class="newpage">Elaboraci&#243;n de informes en el web</h2><p><a name="65591"></a>Disponible en Seagate Crystal Reports Developer Edition y Seagate Crystal Reports Professional.</p><a name="61955"></a><h3>Escalable para satisfacer mayores demandas de los usuarios</h3>
<p><a name="61959"></a>El Web Component Server (servidor de componente web) se ha vuelto a dise&#241;ar para un mejor manejo de las necesidades de un entorno "thin<nobr>-w</nobr>ire", de modo que los informes se crean para satisfacer las exigencias del web.</p><p><a name="65757"></a>El acceso a p&#225;ginas espec&#237;ficas del informe permite a los usuarios descargar s&#243;lo aquellas p&#225;ginas que necesitan ver, lo que minimiza el tiempo de respuesta y el tr&#225;fico en el web.</p><p><a name="65800"></a>El servidor de componente web es compatible con la mayor&#237;a de los servidores web Microsoft&#174;, Netscape&#174; y basados en CGI para elaborar informes escalables de alto rendimiento.</p><a name="61923"></a><h3>Visualice informes en tiempo real y de forma inmediata</h3>
<p><a name="66016"></a>Disfrute de la visualizaci&#243;n en vivo de cualquier informe de Seagate Crystal en el web. Visualice informes con calidad de presentaci&#243;n completa usando visores para los exploradores Netscape y Microsoft. Los visores para ActiveX tambi&#233;n son compatibles con las opciones de copiar y pegar texto del buscador a otras aplicaciones.</p><a name="66156"></a><h3>Mejoras en el visor</h3>
<p><a name="70778"></a>La arquitectura de Seagate Crystal Reports 8 se ha mejorado para el web. Visualice la mayor&#237;a de los informes con mayor rapidez con toda la informaci&#243;n que est&#233; disponible mientras contin&#250;a el procesamiento en segundo plano. No tiene que esperar el conteo total de p&#225;ginas o que el procesamiento termine, ya que ver&#225; un informe con todos los datos, pero que contiene barras de progreso para objetos que consumen mucho tiempo, como gr&#225;ficos o subinformes.</p><p><a name="70782"></a>Seagate Crystal Reports finaliza el procesamiento en segundo plano, la informaci&#243;n que falta se agrega autom&#225;ticamente a la p&#225;gina web. Al final, ya est&#233; actualizando para obtener los resultados m&#225;s recientes en tiempo real o cargando informes con datos guardados, ver&#225; las p&#225;ginas con mayor rapidez.</p><p><a name="66159"></a>Un nuevo complemento de Netscape le permite usar el Visor de informes para ActiveX en Netscape Navigator. Esto le da a los usuarios de Netscape toda la funcionalidad del visor de informes ActiveX, incluida la capacidad de imprimir informes cercanos a la calidad WYSIWYG.</p><p><a name="72161"></a>La vista de informes para Java es compatible con Java 2 Runtime Environment v.1.2.2 de Sun, y es compatible tanto con los navegadores de Microsoft como de Netscape.</p><a name="66018"></a><h3>Mejoras para los formatos de informes en el web</h3>
<p><a name="70822"></a>Puede exportar informes a un formato HTML mejorado. Estos tipos de exportaci&#243;n retienen el formato para garantizar que su informe sea de f&#225;cil lectura.</p><a name="63998"></a><h3>Use carpetas web para guardar los informes</h3>
<p><a name="55106"></a>Si ejecuta Microsoft Windows 9x, Windows NT con Microsoft Office 2000 o Windows 2000, puede almacenar, actualizar y guardar informes directamente en una carpeta web de un servidor web. Ya no necesita descargar informes, editarlos localmente ni cargarlos al servidor web.</p><a name="54859"></a><h3>Agregue hiperv&#237;nculos a los informes</h3>
<p><a name="55365"></a>Puede crear informes para usuarios finales que sean documentos activos, como cualquier p&#225;gina web, con v&#237;nculos a otros documentos, incluidos archivos, sitios web u otros informes. Los hiperv&#237;nculos se pueden asociar con la mayor&#237;a de los objetos de informes, incluyendo texto, im&#225;genes y objetos din&#225;micos, como bases de datos y campos de f&#243;rmulas. Los hiperv&#237;nculos se ejecutan al hacer clic en un objeto vinculado en la ventana Vista Previa o en el visor del web. Se proporciona compatibilidad total URL para hiperv&#237;nculos de hipertexto, archivos, correo y noticias.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "02_whtnw.html";
var next = "02_whtnw3.html";

function setTopicID() { 
      var number = "58896"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


