<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Facilidad de uso</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="68489"></a><h2 class="newpage">Facilidad de uso</h2><p><a name="68864"></a>Estas mejoras est&#225;n disponibles en todas las ediciones de Seagate Crystal Reports.</p><a name="68490"></a><h3>Creaci&#243;n de informes</h3>
<a name="68492"></a><h4>Mejoras en Report Designer</h4><p><a name="68493"></a>La interfaz de dise&#241;o de informes ofrece un mayor control del posicionamiento de objetos de informe con la capacidad de mover, alinear, ajustar de tama&#241;o, copiar y pegar m&#250;ltiples objetos y nuevas opciones de alineaci&#243;n y regla. Esto es especialmente &#250;til para dise&#241;ar informes usados con formularios impresos.</p><a name="68495"></a><h4>Tenga r&#225;pido acceso a sus datos con el Explorador de datos</h4><p><a name="68496"></a>La conexi&#243;n con los datos es m&#225;s r&#225;pida y m&#225;s intuitiva para los usuarios finales con la conocida interfaz tipo Explorer del Explorador de datos para seleccionar las fuentes de datos. Elija entre los controladores disponibles, ordenados por tipos de conexi&#243;n o tenga acceso a la carpeta Favoritos, donde encontrar&#225; una lista de v&#237;nculos a las ubicaciones de fuentes de datos m&#225;s usadas. Tambi&#233;n puede crear nuevas conexiones v&#237;a ODBC o OLE<nobr>-D</nobr>B. Visualice los archivos m&#225;s recientes a los que ha accedido a trav&#233;s de la carpeta Historial.</p><a name="68498"></a><h4>Visualice y modifique todos los campos con el Explorador de campos</h4><p><a name="68499"></a>Ahora puede insertar, editar o eliminar campos en las fichas Dise&#241;o y Vista Previa. El Explorador de campos proporciona una lista de bases de datos, f&#243;rmulas, par&#225;metros, nombres de grupos, totales acumulados y campos especiales que puede agregar a su informe.</p><a name="68501"></a><h4>Informes guardados autom&#225;ticamente</h4><p><a name="68502"></a>La funci&#243;n de guardado autom&#225;tico ya es compatible. Los informes se pueden guardar con una "imagen" de vista previa de la primera p&#225;gina.</p><a name="68504"></a><h4>Use la funci&#243;n de b&#250;squeda para ubicar texto r&#225;pidamente dentro de los informes</h4><p><a name="68505"></a>En la ficha Vista Previa, busque cadenas en objetos de texto, objetos de campo, subinformes, tablas cruzadas y cuadr&#237;culas OLAP.</p><a name="68507"></a><h4>Dise&#241;e informes con mayor rapidez con los nuevos Asistentes de Tablas cruzadas y de OLAP</h4><p><a name="68508"></a>Se ha mejorado el Asistente de Tablas cruzadas y de OLAP para proporcionar 18 estilos predefinidos de cuadr&#237;cula y m&#225;s control sobre el dise&#241;o, formato, asignaci&#243;n y diagramaci&#243;n de cuadr&#237;culas. Ahora puede dar formato condicionalmente a filas y columnas por separado. Tambi&#233;n se han mejorado la filtraci&#243;n, agrupamiento y orden de dimensiones OLAP del asistente para que sea m&#225;s f&#225;cil de usar y m&#225;s flexible.</p><a name="68513"></a><h4>Almacenamiento de archivos</h4><p><a name="68514"></a>Se ha mejorado el formato de archivo .rpt para crear archivos m&#225;s peque&#241;os con mayor rapidez de compresi&#243;n y un almacenamiento m&#225;s eficiente de informes complejos que contengan datos guardados. Los usuarios de la versi&#243;n 7 tambi&#233;n pueden abrir archivos de informes creados en Seagate Crystal Reports 8, pero quiz&#225; algunas funciones no sean compatibles.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "02_whtnw6.html";
var next = "02_whtnw8.html";

function setTopicID() { 
      var number = "68489"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


