<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Combinaci&#243;n de campos en un objeto de texto</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="69667"></a><h4 class="newpage"> Combinaci&#243;n de campos en un objeto de texto</h4><p><a name="69668"></a>En lugar de agregar los campos Nombre del Contacto y Apellido del Contacto como objetos separados, usted puede insertar ambos campos en un objeto de texto. Esto le permite controlar el formato de ambos haciendo cambios s&#243;lo a uno de ellos. Los campos que son insertados en un objeto de texto, son acortados autom&#225;ticamente (no tienen espacios en blanco al principio, ni al final). Esto es importante ya que un campo tiene tama&#241;o fijo, mientras que los datos en los campos pueden variar en tama&#241;o, dejando espacio en blanco innecesario.</p><a name="67555"></a><h6>Para combinar campos en un objeto de texto</h6><ol>
<a name="84728"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_intxt.gif">


Haga clic en el bot&#243;n <strong>Insertar objeto de texto</strong> de la barra de herramientas est&#225;ndar. Aparecer&#225; un marco de objeto junto al cursor de flecha a medida que mueve el cursor sobre su informe.
<a name="69679"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">Inserte el campo a la derecha de los campos en la secci&#243;n <strong>Detalles</strong>. 
<p class="indent"><a name="69680"></a>La ficha Dise&#241;o autom&#225;ticamente se desplaza a la derecha, si es necesario, a medida que arrastra el campo. Cuando hace clic para ubicar el objeto, aparece un objeto de texto y la regla horizontal de la ficha Dise&#241;o se transforma en una regla con tabulador que se usa para editar el objeto de texto. Cuando hace clic en un &#225;rea vac&#237;a del informe o de un objeto de campo, aparece la regla est&#225;ndar de la ficha Dise&#241;o.</p><a name="69681"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic una vez en la orilla del objeto de texto para seleccionarlo para ajuste de tama&#241;o. Aparecer&#225;n controladores en los cuatro lados del objeto.
<a name="69682"></a><li value="4&nbsp;&nbsp;&nbsp;&nbsp;">Mueva el cursor sobre el controlador de la derecha del objeto de texto y aumente el ancho aproximadamente una pulgada. Es posible que necesite desplazarse a la derecha y continuar ajustando el ancho del objeto.
<a name="69683"></a><li value="5&nbsp;&nbsp;&nbsp;&nbsp;">Haga doble clic en el objeto de texto para seleccionarlo para edici&#243;n. F&#237;jese que ahora el punto de inserci&#243;n dentro del objeto de texto est&#225; intermitente.
<a name="85286"></a><li value="6&nbsp;&nbsp;&nbsp;&nbsp;">Resalte el campo <strong>Apellido del Contacto</strong> en el cuadro de di&#225;logo Explorador de Campos. Recuerde que puede mover el cuadro de di&#225;logo Explorador de Campos tom&#225;ndolo por la barra de t&#237;tulo, arrastr&#225;ndolo y ubic&#225;ndolo donde quiera.
<a name="90033"></a><li value="7&nbsp;&nbsp;&nbsp;&nbsp;">Arrastre el campo hasta el objeto de texto.
<a name="90034"></a><li value="8&nbsp;&nbsp;&nbsp;&nbsp;">Mueva el cursor sobre el objeto de texto hasta que se convierta en un cursor para arrastrar y soltar.
<a name="90035"></a><li value="9&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic para ubicar el campo en el objeto de texto. El cursor aparecer&#225; despu&#233;s del campo <strong>Apellido del contacto</strong>, dentro del objeto de texto.
<a name="90036"></a><li value="10&nbsp;&nbsp;&nbsp;&nbsp;">Escriba una coma y un espacio en blanco despu&#233;s del Apellido del contacto.
<a name="69693"></a><li value="11&nbsp;&nbsp;&nbsp;&nbsp;">Arrastre el campo hasta el objeto de texto.
<a name="84638"></a><li value="12&nbsp;&nbsp;&nbsp;&nbsp;">Mueva el cursor sobre el objeto de texto hasta que se convierta en cursor de arrastrar y ubicar. Mueva el cursor hacia la derecha de la coma y el espacio que acaba de escribir y haga clic una vez. El campo ser&#225; insertado a la derecha de la coma y el espacio.
<a name="84639"></a><li value="13&nbsp;&nbsp;&nbsp;&nbsp;">La operaci&#243;n de insertar campos ha sido completada. Ahora, haga clic en el bot&#243;n <strong>Cerrar</strong> en el cuadro de di&#225;logo Explorador de Campos.
<a name="69696"></a><li value="14&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en la ficha <strong>Vista previa</strong> para ver los campos que acaba de ubicar.
</ol>
<p><a name="69700"></a>Su informe debe ser similar a la siguiente ilustraci&#243;n.</p><p><a name="88648"></a> <img src="images/pw_tutr2.gif">


</p>

<hr><br>

<script  language="JavaScript"><!--

var prev = "04_quick23.html";
var next = "04_quick25.html";

function setTopicID() { 
      var number = "69667"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


