<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Inicio r&#225;pido para usuarios avanzados</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="68269"></a><h2 class="newpage">Inicio r&#225;pido para usuarios avanzados</h2><p><a name="69990"></a>Si usted es un usuario de Windows con experiencia y quiere ir directamente al programa, siga los siguientes pasos para preparar un informe por primera vez.</p><p><a name="69993"></a> Si no tiene experiencia usando Windows, por favor refi&#233;rase a <kbd><a href="04_quick14.html#67019">Inicio r&#225;pido para usuarios inexpertos</a></kbd>.</p><a name="66030"></a><h6>Para elegir un tipo de informe y una fuente de datos </h6><ol>
<a name="66034"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">En Windows, haga clic en <kbd>Inicio</kbd>, apunte a <kbd>Programas</kbd>, luego seleccione <kbd>Crystal Report Designer</kbd>.
<a name="66035"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic <kbd>Como informe en blanco</kbd> y haga clic en <kbd>Aceptar</kbd> para abrir el cuadro de di&#225;logo Explorador de datos.
<p class="indent"><a name="66036"></a>Como una alternativa para crear un informe en blanco, puede elegir uno de los ocho asistentes de informes. Vea las muestras de estilo de cada uno seleccionando de la lista de asistentes.</p><p class="indent"><a name="66037"></a>Despu&#233;s de elegir un asistente, aparece el Asistente de informe. Usted puede crear su informe en una base de datos, una consulta o un diccionario.</p><p class="indent"><a name="66038"></a>Al elegir Consulta o Diccionario le permite buscar el archivo apropiado. Al elegir Base de datos se abre el cuadro de di&#225;logo Explorador de datos.</p></ol>
<ol>
<a name="66040"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">Examine el contenido del Explorador de datos para buscar las tablas de bases de datos que desea usar en su informe.
<a name="66041"></a><li value="4&nbsp;&nbsp;&nbsp;&nbsp;">Seleccione una tabla que desee usar en su informe y haga clic en <kbd>Agregar</kbd>.
<a name="66042"></a><li value="5&nbsp;&nbsp;&nbsp;&nbsp;">Despu&#233;s de agregar todas las tablas con las que desea trabajar, haga clic en <kbd>Cerrar</kbd> en el Explorador de datos.
<p class="indent"><a name="68296"></a>Aparece la ficha Dise&#241;o con las &#225;reas de Encabezado de informe, Encabezado de p&#225;gina, Detalles, Pie de p&#225;gina y Pie de informe. Un informe se crea al insertar y dar formato a los &#237;temes en cada una de estas &#225;reas.</p></ol>
<p><a name="68297"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font><img src="images/04_quick51.gif">


Si quiere usar en su informe tablas adicionales de la base de datos y quiere que coincidan registro a registro, haga clic en el bot&#243;n <strong>Asistente de v&#237;nculos</strong> de la barra de herramientas suplementaria, luego seleccione la(s) tabla(s) y establezca los v&#237;nculos cuando aparezca el Asistente de V&#237;nculo Visual.</p>
<a name="68315"></a><h6>Para trabajar con elementos de informe en la ficha Dise&#241;o</h6><ol>
<a name="68320"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_secex.gif">


Cada una de las &#225;reas predeterminadas del informe contiene solo una secci&#243;n. Si quiere agregar secciones adicionales, haga clic en el bot&#243;n <strong>Asistente de secciones</strong> de la barra de herramientas est&#225;ndar y agregue las secciones que quiera usando el Asistente de Secciones.
<p class="indent"><a name="68321"></a>Una vez que ha agregado secciones a un &#225;rea, puede combinarlas, moverlas o eliminarlas en el Asistente de Secciones. Vea <a href="11_format12.html#83854">Uso de l&#237;neas gu&#237;a</a>.</p><a name="68325"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">Si quiere activar (o desactivar) la cuadr&#237;cula alternativamente, elija el comando <strong>Opciones</strong> en el men&#250; <strong>Archivo</strong> y haga sus cambios en el cuadro de di&#225;logo Opciones cuando &#233;ste aparezca. Vea <a href="11_format10.html#87563">Utilizacion de la Cuadr&#237;cula</a>.
<a name="68329"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">Si est&#225; trabajando con la cuadr&#237;cula desactivada y quiere usar ajuste a l&#237;neas gu&#237;a para ubicar objetos, haga clic en la regla superior o izquierda a la altura de donde quiere que aparezca la l&#237;nea gu&#237;a.
<ul type="disc"><ul type="disc"><a name="68330"></a><li>Arrastre un campo hacia la l&#237;nea gu&#237;a hasta que &#233;sta se ajuste a la l&#237;nea en cuesti&#243;n.<a name="68331"></a><li>Arrastre la flecha (de la l&#237;nea gu&#237;a) para mover la correspondiente l&#237;nea gu&#237;a (y cualquier objeto que est&#233; ajustado a ella).<a name="68334"></a><li>Arrastre la flecha (de la l&#237;nea gu&#237;a) m&#225;s all&#225; de la regla para quitar la l&#237;nea gu&#237;a. Vea <a href="11_format12.html#83854">Uso de l&#237;neas gu&#237;a</a>.</ul></ul><a name="68343"></a><li value="4&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_indat.gif">


Si el cuadro de di&#225;logo Explorador de Campos no est&#225; visible, haga clic en el bot&#243;n<strong> Insertar campos</strong> de la barra de herramientas est&#225;ndar.
<p class="indent"><a name="68344"></a> El cuadro de di&#225;logo Explorador de Campos aparecer&#225; con la ficha Base de datos activada. Este cuadro de di&#225;logo muestra una lista de todos los campos en la(s) tabla(s) de la base de datos activa. Para agilizar la entrada m&#250;ltiple de datos, el cuadro permanece en la pantalla hasta que usted haga clic en el bot&#243;n <kbd>Cerrar</kbd>. Puede mover el cuadro de di&#225;logo hacia una nueva posici&#243;n o reajustarlo a su antojo. Vea <kbd><a href="06_create_rpt19.html#211808">Colocaci&#243;n de datos en su informe</a></kbd>.</p><a name="68348"></a><li value="5&nbsp;&nbsp;&nbsp;&nbsp;">Seleccione el (los) campo(s) que quiere que aparezcan en el informe.
<p class="indent"><a name="68349"></a> Puede seleccionarlos y ponerlos uno a la vez, o puede usar la combinaci&#243;n Mayus<nobr>-c</nobr>lic para seleccionar varios campos contiguos, o tambi&#233;n, la combinaci&#243;n Ctrl<nobr>-c</nobr>lic para seleccionar campos de la lista en forma aleatoria. Ya que las funciones para arrastrar y colocar est&#225;n activas, puede poner los campos en la secci&#243;n Detalles, exactamente donde quiere que aparezcan.</p><p class="indent"><a name="68350"></a>Si pone varios campos, &#233;stos aparecer&#225;n uno al lado del otro en el cuadro de di&#225;logo Explorador de Campos. El programa marca la posici&#243;n de cada campo con un marco rectangular. Los caracteres en el marco indican si el campo es textual (xxx...), num&#233;rico (555...), moneda ($555...), fecha (31/12/99), hora (00:00:00), fecha y hora (31/12/99 00:00:00), o booleano (T/F).</p><p class="indent"><a name="68351"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font></p>
<ul type="disc"><ul type="disc"><a name="66082"></a><li>Los nombres y tipos de campo se pueden ver al seleccionar la casilla de verificaci&#243;n Mostrar nombres de campo en el cuadro de di&#225;logo Opciones (ficha Presentaci&#243;n).<a name="66083"></a><li>El programa coloca autom&#225;ticamente todos los t&#237;tulos de campo en la secci&#243;n Encabezado de p&#225;gina a menos que no se seleccione la casilla de verificaci&#243;n Insertar detalle de t&#237;tulos de campo en el cuadro de di&#225;logo Opciones (ficha Presentaci&#243;n).<a name="70077"></a><li>Si se agregan secciones de Detalles adicionales al informe, s&#243;lo se colocar&#225;n t&#237;tulos de campo en la secci&#243;n Encabezado de p&#225;gina de los campos en la secci&#243;n Detalles A (el original) de su informe.</ul></ul><a name="68531"></a><li value="6&nbsp;&nbsp;&nbsp;&nbsp;">Despu&#233;s que haya ubicado objetos en su informe, podr&#237;a surgir la necesidad de ajustar las secciones del informe de alguna manera. Puede hacerlo usando el men&#250; contextual que aparece cuando hace clic con el bot&#243;n derecho del mouse en el &#225;rea sombreada a la izquierda de la secci&#243;n de la regla.
<ul type="disc"><ul type="disc"><a name="68532"></a><li>Si quiere expandir la secci&#243;n para acomodar una l&#237;nea adicional, use el comando Insertar l&#237;nea.<a name="68533"></a><li>Si quiere que el programa alinee los objetos en la secci&#243;n autom&#225;tica y horizontalmente, elija el comando Arreglar l&#237;neas.<a name="68534"></a><li>Si quiere reducir el tama&#241;o de la secci&#243;n para eliminar espacios en blanco innecesarios encima y debajo de los objetos, elija el comando Ajustar secci&#243;n. Vea <a href="11_format39.html#85600">Uso del espacio en blanco entre filas</a>.</ul></ul><a name="70105"></a><li value="7&nbsp;&nbsp;&nbsp;&nbsp;">Para crear un t&#237;tulo de informe, debe primero proporcionar el t&#237;tulo en el cuadro de d&#237;alogo Propiedades del documento. Elija el comando <strong>Resumen de informaci&#243;n</strong>, del men&#250; <strong>Archivo</strong>. Proporcione el t&#237;tulo en el cuadro de texto <strong>T&#237;tulo</strong> del cuadro de di&#225;logo Propiedades del Documento. Haga clic en <strong>Aceptar</strong>.
<a name="68539"></a><li value="8&nbsp;&nbsp;&nbsp;&nbsp;">Seleccione <strong>T&#237;tulo del informe</strong> de la lista Campos especiales del Explorador de campos. Cuando mueva el cursor sobre el informe, aparecer&#225; un marco rectangular de ubicaci&#243;n. Haga clic una vez en la secci&#243;n Encabezado del informe (EI) para ubicar el t&#237;tulo del informe en esa secci&#243;n. El campo del t&#237;tulo contendr&#225; el texto usted que escribi&#243; en el cuadro de texto <strong>T&#237;tulo</strong> del cuadro de di&#225;logo Propiedades del Documento. Vea <a href="06_create_rpt32.html#212970">Agregar una p&#225;gina de t&#237;tulo a su informe</a>.
<a name="68547"></a><li value="9&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_prevw.gif">


Para ver c&#243;mo se ver&#225; su trabajo cuando se imprima, haga clic en el bot&#243;n <strong>Vista previa</strong> de la barra de herramientas est&#225;ndar.
<p class="indent"><a name="68548"></a>Para acelerar el tiempo de procesamiento al momento de componer su informe, puede ver una vista previa usando solamente una peque&#241;a parte de los datos disponibles. Para hacer esto, elija el comando Vista previa de muestra del men&#250; Archivo | Imprimir. Vea <a href="06_create_rpt13.html#222791">Ficha Vista previa</a>.</p><p class="indent"><a name="68552"></a>En cualquier caso, el programa muestra la ficha Vista previa. Si quiere, puede afinar su informe en la ficha Vista previa y, al mismo tiempo, ver los resultados como aparecer&#237;an actualizados en el informe. Tambi&#233;n puede cerrar la ficha Vista previa y continuar trabajando en su informe en la ficha Dise&#241;o.</p></ol>

<hr><br>

<script  language="JavaScript"><!--

var prev = "04_quick35.html";
var next = "04_quick37.html";

function setTopicID() { 
      var number = "68269"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


