<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Inserci&#243;n de un campo</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="69548"></a><h4 class="newpage"> Inserci&#243;n de un campo</h4><p><a name="69549"></a>El cuadro de di&#225;logo Explorador de Campos aparecer&#225; con la opci&#243;n Campos de base de datos seleccionada ya que es aconsejable insertar campos de base de datos al crear un informe nuevo.</p><p><a name="69553"></a> <img src="images/db_infd1.gif">


</p>
<p><a name="69554"></a>Este cuadro de di&#225;logo est&#225; dise&#241;ado para permanecer en la pantalla hasta que usted haga clic en el bot&#243;n <kbd>Cerrar</kbd>. Todas las tablas disponibles para usar en su informe est&#225;n puestas en lista en este cuadro.</p><p><a name="69555"></a>Puede mover el cuadro de di&#225;logo hacia otra parte de la pantalla, haciendo clic en la barra peque&#241;a y arrastr&#225;ndolo a su nueva posici&#243;n. Tambi&#233;n puede ajustar el cuadro de di&#225;logo arrastrando una de sus orillas con el cursor de ajuste.</p><p><a name="69556"></a>De ahora en adelante, comenzar&#225; a poner objetos en su informe insertando el campo Nombre del Cliente.</p><a name="67277"></a><h6>Para insertar un campo</h6><ol>
<a name="69561"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">Resalte el nombre de un campo en el cuadro de di&#225;logo haciendo clic en el nombre una vez. Cuando resalta el nombre del campo, puede revisar los valores de ese campo, as&#237; como tambi&#233;n el tipo y tama&#241;o haciendo clic con el bot&#243;n derecho del mouse y seleccionando Examinar datos en el men&#250; contextual. El cuadro de di&#225;logo Examinar aparecer&#225; con una lista del nombre, tipo y longitud del campo, as&#237; como un subconjunto de valores de campo.
<p><a name="69565"></a> <img src="images/db_brwse.gif">


</p>
</ol>
<p><a name="67283"></a>Cuando termine de revisar los datos, haga clic en el bot&#243;n Terminado para regresar al cuadro de di&#225;logo Explorador de Campos.</p><ol>
<a name="69570"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">Resalte el campo <strong>Nombre del Cliente</strong> y arr&#225;strelo hacia adentro de la secci&#243;n <strong>Detalles</strong> de su informe.
<p class="indent"><a name="69571"></a>A medida que arrastra el campo en su informe, aparece un marco de objeto con el cursor de flecha.</p><p><a name="69575"></a> <img src="images/plc_tutr.gif">


</p>
<ul type="disc"><ul type="disc"><a name="69576"></a><li>El marco de objeto representa el objeto que ha seleccionado para ubicarlo.<a name="69577"></a><li>El tama&#241;o del marco de objeto es aproximadamente el mismo que el tama&#241;o del dato en el campo seleccionado.</ul></ul><a name="69578"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">Mueva el marco de objeto lo m&#225;s que pueda hacia la izquierda de la secci&#243;n Detalles. Si mueve el campo demasiado a la izquierda, el cursor de flecha se transformar&#225; en cursor de parar, indicando que no puede arrastrar el campo sobre esa parte de la pantalla. Recuerde que no puede poner ning&#250;n objeto fuera del margen de la p&#225;gina.
<p class="indent"><a name="69579"></a>La ficha Dise&#241;o debe lucir similar a la siguiente ilustraci&#243;n:</p><p><a name="69583"></a> <img src="images/Dw_tutr2.gif">


</p>
</ol>

<hr><br>

<script  language="JavaScript"><!--

var prev = "04_quick18.html";
var next = "04_quick20.html";

function setTopicID() { 
      var number = "69548"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


