<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>

<title>Usar otras funciones de informes</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="89581"></a><h3 class="newpage"> Usar otras funciones de informes</h3>
<a name="68554"></a><h6>Para usar otras funciones de informes</h6><ol>
<a name="68555"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">Si usted quiere editar un campo, cambiar la ubicaci&#243;n o el ancho de un campo, o insertar un subtotal o total general,haga clic en el campo para seleccionarlo. Aparecer&#225;n controladores arriba, abajo y a los lados de cada campo seleccionado.
<ul type="disc"><ul type="disc"><a name="68556"></a><li>Para cambiar la ubicaci&#243;n del campo (o los campos), arrastre el marco de ubicaci&#243;n del campo a su nueva posici&#243;n usando su mouse.<a name="68557"></a><li>Para cambiar el ancho de un campo, arrastre el controlador de la derecha o de la izquierda usando su mouse.<a name="68558"></a><li>Para editar la fuente, el alineamiento dentro del campo, n&#250;mero, moneda, fecha, borde, color, sangr&#237;a, o para resumir el campo, haga clic en el campo con el bot&#243;n derecho del mouse. Aparecer&#225; un men&#250; contextual con una lista de comandos para formatear y resumir el campo.<p class="indent"><a name="70172"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font><img src="images/Bt_cdfml.gif">


Si quiere aplicar el formato s&#243;lo bajo ciertas condiciones, haga clic en el bot&#243;n F&#243;rmula Condicional en el Editor de Formato y haga una f&#243;rmula que defina esas condiciones. Vea <a href="11_format43.html#89319">Trabajo con Formato condicional</a>.</p>
</ul></ul><a name="68571"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_indat.gif">


Si quiere crear una f&#243;rmula para hacer c&#225;lculos o comparaci&#243;n de datos, haga clic en el bot&#243;n <strong>Insertar campos </strong>de la barra de herramientas est&#225;ndar. Cuando aparezca el cuadro de di&#225;logo Explorador de Campos, selecciona<strong> Campos de f&#243;rmula</strong>.
<a name="68572"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en el bot&#243;n <strong>Nuevo</strong>. El cuadro de di&#225;logo Nombre de la F&#243;rmula aparecer&#225; en su pantalla. Proporcione el nombre de la f&#243;rmula y haga clic en <strong>Aceptar</strong>. El Editor de F&#243;rmulas aparecer&#225; en su pantalla.
<a name="68573"></a><li value="4&nbsp;&nbsp;&nbsp;&nbsp;">Escriba la f&#243;rmula en el Editor de F&#243;rmulas. Haga entrada de campos, operadores y funciones seleccion&#225;ndolos de sus respectivas listas de desplazamiento o simplemente escr&#237;balas. Puede verificar la sintaxis de sus f&#243;rmulas haciendo clic en el bot&#243;n <strong>Verificar</strong>. 
<a name="68574"></a><li value="5&nbsp;&nbsp;&nbsp;&nbsp;">Cuando termine la edici&#243;n haga clic en el bot&#243;n <strong>Aceptar</strong> para regresar al cuadro de di&#225;logo Explorador de Campos. Haga clic en el bot&#243;n <strong>Insertar</strong> para ubicar la f&#243;rmula tal como lo har&#237;a con un campo de una base de datos. Vea <a href="19_introformulas.html#172160">Uso de las f&#243;rmulas</a> o busque en Funciones y Operadores y Variables en la Ayuda en l&#237;nea de Seagate Crystal Reports.
<a name="68586"></a><li value="6&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/04_quick39.gif">


Para insertar un subinforme (un informe dentro de otro informe), haga clic en el bot&#243;n <strong>Insertar subinforme</strong> de la barra de herramientas suplementaria y elija un informe existente para importarlo como subinforme o use el Asistente de creaci&#243;n de informes para crear un nuevo subinforme. Vea <a href="23_subreports6.html#43958">C&#243;mo insertar un subinforme</a>.
<p class="indent"><a name="68591"></a>Si quiere que los registros de su subinforme coincidan con los registros de su informe principal, haga clic en la etiqueta Vincular del cuadro de di&#225;logo Insertar Subinforme y especifique el v&#237;nculo en el cuadro de di&#225;logo V&#237;nculos de Subinforme cuando &#233;ste aparezca. Vea <a href="23_subreports10.html#44569">C&#243;mo vincular un subinforme a los datos del informe principal</a>.</p><a name="68600"></a><li value="7&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/04_quick40.gif">


Para insertar tablas cruzadas en su informe, haga clic en el bot&#243;n <strong>Insertar tablas cruzadas </strong>de la barra de herramientas suplementaria y cuando aparezca el cuadro de di&#225;logo de Tablas Cruzadas, establezca el tipo de relaciones cruzadas necesarias para construir su informe de tablas cruzadas. Vea <kbd><a href="15_CrossTabs.html#53234">Objetos de Tablas Cruzadas</a>.</kbd>
<a name="68609"></a><li value="8&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_indat.gif">


Para crear un campo de par&#225;metro (un campo al cual usted debe proporcionar un valor cada vez que recupera datos del informe), haga clic en el bot&#243;n Insertar campos de la barra de herramientas est&#225;ndar, luego seleccione Campos de par&#225;metros en el Explorador de campos cuando &#233;ste aparezca. Haga clic en el bot&#243;n <strong>Nuevo</strong> para configurar un campo de par&#225;metros. Una vez creado, puede insertar el campo de par&#225;metro en su informe tal como lo har&#237;a con un campo de una base de datos o selecci&#243;nelo de la lista <strong>Campos</strong> en el Editor de F&#243;rmulas.
<p class="indent"><a name="68610"></a>Puede usar campos de par&#225;metro en su informe (como t&#237;tulos o etiquetas), en f&#243;rmulas de selecci&#243;n (como criterio de selecci&#243;n), y en f&#243;rmulas (para distintos prop&#243;sitos, incluso, especificar el ordenamiento de los campos). Vea <a href="22_param.html#47204">Campos de Par&#225;metro</a>.</p><a name="70325"></a><li value="9&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/bt_insertchart.gif">


Para agregar un gr&#225;fico, haga clic en el bot&#243;n <strong>Insertar gr&#225;fico </strong>de la barra de herramientas est&#225;ndar. Vea <a href="12_chart.html#43833">Elaboraci&#243;n de Gr&#225;ficos</a>.
<a name="69118"></a><li value="10&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/bt_insertmap.gif">


Para agregar un mapa, haga clic en <kbd>Insertar mapa</kbd> en la barra de herramientas Est&#225;ndar. Consulte <a href="13_map.html#495988">Elaboraci&#243;n de Mapas</a>.
<a name="70358"></a><li value="11&nbsp;&nbsp;&nbsp;&nbsp;">Para insertar una hoja de c&#225;lculo, una imagen u otro objeto OLE que pueda editar desde Seagate Crystal Reports usando las herramientas del programa original del objeto, elija el comando <strong>Objeto OLE </strong>del men&#250; Insertar. Vea <a href="14_ole.html#29938">OLE</a> y <a href="14_ole11.html#30287">Trabajo con Objetos OLE est&#225;ticos</a>.
<a name="69126"></a><li value="12&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_sordr.gif">


Para cambiar la direcci&#243;n de ordenamiento de los registros (ascendente/descendente), haga clic en el bot&#243;n <strong>Ordenar</strong> de la barra de herramientas est&#225;ndar. El cuadro de di&#225;logo Orden de Registros aparecer&#225; en la pantalla. Seleccione el (los) campo(s) que quiere utilizar para ordenar los datos del informe y la direcci&#243;n del ordenamiento. Vea <a href="08_sortgrouptotal3.html#246830">Ordenamiento de uno y m&#250;ltiples campos</a>.
<a name="70416"></a><li value="13&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_selrc.gif">


Si quiere limitar su informe de acuerdo a registros espec&#237;ficos (por ejemplo, los registros de los clientes de California que tienen compras acumuladas mayores de $10,100), haga clic en el primer campo en el cual quiere basar su selecci&#243;n y luego haga clic en el bot&#243;n <strong>Seleccionar registros</strong> de la barra de herramientas est&#225;ndar. Cuando aparezca Asistente de Selecci&#243;n, especifique su criterio de selecci&#243;n de registros.
<a name="69141"></a><li value="14&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_print.gif">


Para imprimir su informe, haga clic en el bot&#243;n <strong>Imprimir</strong> de la barra de herramientas est&#225;ndar.
</ol>
<p><a name="37353"></a>&#161;Eso es todo! As&#237; de f&#225;cil es elaborar un informe.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "04_quick36.html";
var next = "05_concept_rpt.html";

function setTopicID() { 
      var number = "89581"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


