<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>B&#250;squeda de datos</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="187023"></a><h3 class="newpage"> B&#250;squeda de datos</h3>
<a name="187024"></a><h4>&#191;Sabe usted qu&#233; datos quiere usar en su informe?</h4><p><a name="187025"></a>&#191;Sabe en qu&#233; tipo de base de datos est&#225; basando su informe? &#191;Tomar&#225; los datos de un archivo de datos, de una estructura SQL/ODBC o de un diccionarioun Info View? </p><p><a name="187026"></a>Si no lo sabe, pregunte a quien corresponda acerca del tipo de base de datos y la localizaci&#243;n de sus datos y solicite que le establezcan acceso a esa base de datos, si es que todav&#237;a no lo tiene. Vea <a href="25_access_sources.html#246299">Acceso a las fuentes de datos</a>. </p><p><a name="187030"></a>&#191;Est&#225; suficientemente familiarizado con los datos para poder encontrar la informaci&#243;n que desea? Cuando est&#225; buscando el nombre del contacto de un cliente, &#191;es capaz de encontrar el campo dentro de la tabla de una base de datos? </p><p><a name="187031"></a>El profesional en MIS, el administrador de bases de datos o un compa&#241;ero de trabajo podr&#237;a ayudarle a familiarizarse con los datos con los que se propone trabajar. </p><a name="187032"></a><h4>&#191;Qu&#233; datos espec&#237;ficos quiere que aparezcan en el cuerpo <br>del informe?</h4><p><a name="187033"></a>El cuerpo debe contener todos los datos necesarios para cumplir lo establecido en el enunciado del prop&#243;sito del informe. Y tambi&#233;n debe contener todos los datos necesarios para la variedad de usuarios que haya identificado.</p><p><a name="187034"></a>Este paso requiere que usted examine las tablas disponibles. Seagate Crystal Reports le permite combinar datos de diferentes bases de datos para crear su informe, lo que le da una gran flexibilidad en su trabajo.</p><ul type="disc"><a name="187035"></a><li>Muchos de los datos en un informe t&#237;pico ser&#225;n tomados directamente de campos de datos. &#191;Cu&#225;l campo usar&#225; y d&#243;nde se encuentra?
<a name="187036"></a><li>Otros datos ser&#225;n calculados a partir de campos de datos. &#191;Cu&#225;les campos usar&#225; para dichos c&#225;lculos?
<a name="187037"></a><li>Otros datos ser&#225;n insertados directamente en el informe, utilizando objetos de texto (encabezados, notas, r&#243;tulos, etc.).
</ul><a name="187038"></a><h4>&#191;Existen los datos en campos de datos o necesitan ser calculados a partir de los valores de los campos?</h4><p><a name="191233"></a>Parte de la informaci&#243;n del informe puede ser tomada directamente de campos de datos (cifras de ventas, por ejemplo); otra informaci&#243;n tendr&#225; que ser calculada en base a los valores de los campos (comisi&#243;n de ventas, por ejemplo, es el producto de cifras de ventas por porcentaje de comisi&#243;n). En su plan, podr&#237;a ser &#250;til separar o marcar los datos que deben ser calculados, de los que pueden ser usados directamente. Vea <a href="19_introformulas6.html#209532">Especificaci&#243;n de f&#243;rmulas</a>.</p><a name="191240"></a><h4>&#191;En qu&#233; tipo de campos est&#225;n contenidos los datos: num&#233;ricos, textuales u otros?</h4><p><a name="187044"></a>Aun cuando es importante entender los diferentes tipos de datos que usar&#225; en su informe, es de suma importancia saber el tipo de datos de los campos que ser&#225;n usados en los c&#225;lculos. Funciones y operadores trabajan con espec&#237;ficos tipos de datos, por lo que es importante saber el tipo de datos para determinar cuales funciones y operadores pueden ser usados en sus c&#225;lculos.Vea <a href="Functions.html#1000849874">Funciones</a> e <a href="Operators.html#1000024073">Operadores</a>.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "05_concept_rpt4.html";
var next = "05_concept_rpt6.html";

function setTopicID() { 
      var number = "187023"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


