<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Manipulaci&#243;n de datos</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="187046"></a><h3 class="newpage"> Manipulaci&#243;n de datos</h3>
<a name="187047"></a><h4>&#191;Quiere que sus datos se ordenen en grupos?</h4><p><a name="187048"></a>&#191;Quiere sus datos organizados en grupos? &#191;Bajo qu&#233; criterio: por fecha, por cliente? Seagate Crystal Reports provee varias opciones para agrupar sus datos en su informe. Vea <a href="08_sortgrouptotal4.html#245030">Agrupamiento de datos</a>.</p><a name="187052"></a><h4>&#191;Quiere sus datos ordenados en base a registros o valores <br>de grupo?</h4><p><a name="187055"></a>Seagate Crystal Reports le ofrece ambas alternativas. Vea <a href="08_sortgrouptotal2.html#246787">Comprensi&#243;n de las opciones de ordenamiento</a>.</p><a name="187057"></a><h4>&#191;Quiere que su informe se base en todos los registros o grupos en la base de datos o solamente en registros y grupos espec&#237;ficos?</h4><p><a name="187058"></a>Seagate Crystal Reports le da la oportunidad de basar su informe en todos los registros de una base de datos, o en un conjunto limitado de registros de la misma. Usando Seagate Crystal Reports usted puede seleccionar registros basado en un simple rango de datos o comparaciones, o puede crear f&#243;rmulas complejas para identificar los registros que ser&#225;n incluidos. Tome unos minutos para determinar los registros necesarios para su informe y liste los criterios que ser&#225;n usados para seleccionar esos registros. Vea <a href="07_recordgroupsel2.html#53146">Selecci&#243;n de registros</a>.</p><a name="187062"></a><h4>&#191;Desea resumir los datos?</h4><p><a name="187063"></a>&#191;Quiere totalizar, promediar, contar o determinar el m&#225;ximo y el m&#237;nimo valor contenidos entre todos los valores de una columna de su informe?</p><p><a name="187064"></a>Seagate Crystal Reports le permite hacer esto y poner el total (o total promedio, total de recuento, etc.) al final de la p&#225;gina de la columna seleccionada.</p><a name="187065"></a><h4>&#191;Qu&#233; informaci&#243;n quiere marcar en su informe?</h4><p><a name="187066"></a>Podr&#237;a ser que usted quiera llamar la atenci&#243;n a algunos datos, marc&#225;ndolos. Por ejemplo, productos en inventario que no tienen salida, a menudo se marcan en el informe de inventario para tomar decisiones especiales acerca de ellos. Podr&#237;a ser que quiera marcar cada producto que no ha mostrado actividad durante el &#250;ltimo mes, durante los &#250;ltimos tres meses, o durante alg&#250;n per&#237;odo definido. En resumen, si quiere marcar cierta informaci&#243;n, identifique dicha informaci&#243;n y las condiciones que van a provocar que sea marcada.</p><a name="187067"></a><h4>&#191;C&#243;mo quiere marcar la informaci&#243;n?</h4><p><a name="187068"></a>Podr&#237;a ser que quiera marcar elementos con un asterisco u otro s&#237;mbolo, o tal vez usando una palabra como marcador. Por lo tanto, si quiere cierta informaci&#243;n marcada, debe escribir las condiciones que provoquen dicha marcaci&#243;n.</p><p><a name="187283"></a>Seagate Crystal Reports le ofrece la oportunidad de subrayar elementos de informe y cambiar el tipo, tama&#241;o o color de la fuente usada para elementos espec&#237;ficos del informe. Le permite colocar bordes alrededor de elementos, dibujar l&#237;neas y cuadros (para dividir el informe en secciones), establecer encabezados, etc. Todas estas herramientas de formato se pueden usar para destacar datos clave de un informe. Vea <a href="11_format.html#94868">Formato</a>.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "05_concept_rpt5.html";
var next = "05_concept_rpt7.html";

function setTopicID() { 
      var number = "187046"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


