<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Caracter&#237;sticas del &#225;rea de impresi&#243;n</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="187286"></a><h3 class="newpage"> Caracter&#237;sticas del &#225;rea de impresi&#243;n</h3>
<p><a name="187287"></a>Cada &#225;rea del informe tiene sus propias caracter&#237;sticas de impresi&#243;n. Es importante entender estas caracter&#237;sticas porque afectan cu&#225;ndo y qu&#233; tan a menudo se imprimen los diferentes objetos del informe.</p><a name="187320"></a><h4>&#191;En qu&#233; orden se imprimen las &#225;reas del informe?</h4><p><a name="187321"></a>Las &#225;reas se imprimen en el orden que aparecen en la ficha Dise&#241;o (de arriba hacia abajo). Si hay m&#225;s de una secci&#243;n en un &#225;rea, estas se imprimen en el orden en que aparecen dentro del &#225;rea. As&#237;, si tiene tres secciones de Encabezado del informe, las tres secciones ser&#225;n impresas, en orden, antes de comenzar a imprimir la(s) secci&#243;n(es) en el Encabezado de p&#225;gina.</p><a name="187326"></a><h4>&#191;Cu&#225;n a menudo se imprimen los informes?</h4><p><a name="187327"></a>Es m&#225;s f&#225;cil decidir d&#243;nde ubicar los objetos en la ficha Dise&#241;o si entiende qu&#233; tan a menudo se imprimen las diferentes &#225;reas del informe. Esta informaci&#243;n es de suma utilidad, cuando est&#225; tratando de decidir d&#243;nde ubicar gr&#225;ficos, tablas cruzadas y f&#243;rmulas, para obtener resultados espec&#237;ficos: </p><a name="187328"></a><h5>Encabezado de informe</h5><p><a name="187329"></a>Objetos ubicados en el &#225;rea del Encabezado del informe se imprimen una sola vez, al principio del informe.</p><ul type="disc"><a name="187330"></a><li>Gr&#225;ficos y tablas cruzadas ubicados en esta &#225;rea contienen datos para todo el informe.
<a name="187331"></a><li>F&#243;rmulas ubicadas en esta &#225;rea son evaluadas una sola vez, al principio del informe.
</ul><a name="187332"></a><h5>Encabezado de p&#225;gina</h5><p><a name="187333"></a>Objetos ubicados en el &#225;rea del Encabezado de p&#225;gina se imprimen al principio de cada nueva p&#225;gina.</p><ul type="disc"><a name="187334"></a><li>No es posible ubicar gr&#225;ficos o tablas cruzadas en esta secci&#243;n.
<a name="187335"></a><li>F&#243;rmulas ubicadas en esta &#225;rea son evaluadas una vez por p&#225;gina, al principio de cada nueva p&#225;gina.
</ul><a name="187336"></a><h5>Encabezado de grupo</h5><p><a name="187337"></a>Objetos ubicados en el &#225;rea del Encabezado de grupo se imprimen al principio de cada nuevo grupo.</p><ul type="disc"><a name="187338"></a><li>Gr&#225;ficos y tablas cruzadas ubicados en esta &#225;rea contienen datos solamente de este grupo.
<a name="187339"></a><li>F&#243;rmulas ubicadas en esta &#225;rea son evaluadas una sola vez por cada grupo, al principio del grupo.
</ul><a name="187340"></a><h5>&Aacute;rea de Detalles</h5><p><a name="187341"></a>Objetos ubicados en el &#225;rea de Detalles se imprimen con cada nuevo registro.</p><ul type="disc"><a name="187342"></a><li>No es posible ubicar gr&#225;ficos o tablas cruzadas en esta &#225;rea.
<a name="187343"></a><li>F&#243;rmulas ubicadas en esta &#225;rea son evaluadas una vez por cada registro.
</ul><a name="187344"></a><h5>Pie de grupo</h5><p><a name="187345"></a>Objetos ubicados en el &#225;rea del Pie de grupo se imprimen al final de cada grupo.</p><ul type="disc"><a name="187346"></a><li>Gr&#225;ficos y tablas cruzadas ubicados en esta &#225;rea contienen datos solamente de este grupo.
<a name="187347"></a><li>F&#243;rmulas ubicadas en esta &#225;rea son evaluadas una sola vez por cada grupo, al final del grupo.
</ul><a name="187348"></a><h5>Pie de informe</h5><p><a name="187349"></a>Objetos ubicados en el &#225;rea del Pie del informe se imprimen una sola vez al final del informe.</p><ul type="disc"><a name="187350"></a><li>Gr&#225;ficos y tablas cruzadas ubicados en esta &#225;rea contienen datos de todo el informe.
<a name="187351"></a><li>F&#243;rmulas ubicadas en esta &#225;rea son evaluadas una sola vez, al final del informe.
</ul><a name="187352"></a><h5>Pie de p&#225;gina</h5><p><a name="187353"></a>Objetos ubicados en el &#225;rea del Pie de p&#225;gina se imprimen al final de cada p&#225;gina.</p><ul type="disc"><a name="187354"></a><li>No es posible ubicar gr&#225;ficos o tablas cruzadas en esta &#225;rea.
<a name="187355"></a><li>F&#243;rmulas ubicadas en esta &#225;rea son evaluadas una vez por p&#225;gina, al final de cada nueva p&#225;gina.
</ul>
<hr><br>

<script  language="JavaScript"><!--

var prev = "05_concept_rpt6.html";
var next = "05_concept_rpt8.html";

function setTopicID() { 
      var number = "187286"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


