<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Selecci&#243;n de datos</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="210272"></a><h2 class="newpage">Selecci&#243;n de datos</h2><p><a name="210273"></a>Seagate Crystal Reports provee tres diferentes tipos de datos:</p><ul type="disc"><a name="210335"></a><li>Base de datos, (que incluye fuentes de datos ODBC y SQL)
<a name="210336"></a><li>consultas
<a name="222103"></a><li>diccionarios.
</ul><a name="210339"></a><h3>Base de Datos</h3>
<p><a name="210371"></a>En los asistentes de informes elija la opci&#243;n Base de datos para generar un informe sobre cualquier base de datos de PC (que no sea cliente<nobr>-s</nobr>ervidor) o cualquier fuente de datos SQL o ODBC.</p><p><a name="210372"></a>T&#237;picamente, las bases de datos PC est&#225;ndar son bases de datos cuyos datos y todo el software usado para crear acceso a dichos datos est&#225;n ubicados en una misma m&#225;quina. Seagate Crystal Reports puede tener acceso directo a muchos de los formatos m&#225;s comunes de bases de datos PC; el programa tiene capacidades integradas para abrir directamente archivos de bases de datos y tablas dise&#241;adas en dBASE, FoxPRO, Clipper, Btrieve, Paradox, Microsoft Access y otras. Una vez que el programa est&#225; instalado en su sistema, puede comenzar inmediatamente a crear informes basados en bases de datos de dichos formatos, con s&#243;lo seleccionar los archivos apropiados. </p><p><a name="222124"></a>Vea <a href="25_access_sources.html#246299">Acceso a las fuentes de datos</a>.</p><p><a name="210410"></a>Bases de datos SQL (Structured Query Language) son probablemente los formatos m&#225;s populares y vers&#225;tiles. Por lo general trabajan muy bien en arquitectura de redes cliente/servidor y usan:</p><ul type="disc"><a name="210411"></a><li>un servidor SQL para crear, almacenar y manipular archivos de bases de datos, tablas, campos y registros, y
<a name="210412"></a><li>una interfaz para el cliente SQL que permite la recuperaci&#243;n de datos a los usuarios de la estaci&#243;n de trabajo.
</ul><p><a name="210416"></a>Vea <a href="24_under_databases28.html#322386">Uso de SQL y bases de datos SQL</a>.</p><p><a name="210417"></a>ODBC (Open Database Connectivity) es una tecnolog&#237;a desarrollada por Microsoft, mediante la cual un solo programa puede tener acceso a diferentes tipos de datos. El programa s&#243;lo necesita comunicarse con un conjunto de archivos, ODBC, para trabajar instant&#225;neamente con cualquier fuente de datos a la cual ODBC pueda tener acceso.</p><p><a name="210418"></a>Seagate Crystal Reports provee controladores directos para la mayor&#237;a de los sistemas SQL y ODBC m&#225;s populares.</p><p><a name="210452"></a>La opci&#243;n Base de datos fue elegida para <a href="04_quick.html#65368">Inicio r&#225;pido</a>, ya que los datos de muestra, Xtreme_es.mdb, son una base de datos de Microsoft Access.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "06_create_rpt2.html";
var next = "06_create_rpt4.html";

function setTopicID() { 
      var number = "210272"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


