<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Opciones en la creaci&#243;n de informes</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="210191"></a><h2 class="newpage">Opciones en la creaci&#243;n de informes</h2><p><a name="210192"></a>Cada vez que crea un nuevo informe, usted tiene cuatro opciones:</p><ul type="disc"><a name="210193"></a><li>usar un Asistente de Informes,
<a name="210194"></a><li>usar otro informe como plantilla, o
<a name="210195"></a><li>crear un informe personalizado desde el principio.
</ul><p><a name="210196"></a>Probablemente usar&#225; las cuatro opciones con el tiempo.</p><a name="210197"></a><h3>Asistente de Informes</h3>
<p><a name="210198"></a>Los Asistentes de Informes le ayudan a crear informes de manera r&#225;pida y tanto usuarios sin experiencia como programadores, prefieren crear la mayor&#237;a de sus informes usando estos modelos. Todo lo que tiene que hacer es elegir el modelo que m&#225;s se acerque a sus necesidades. El asistente le lleva paso a paso a trav&#233;s del proceso de creaci&#243;n de su informe.</p><p><a name="210199"></a>Puede crear el informe r&#225;pidamente y ver c&#243;mo luce con los datos reales. Y lo mejor de todo, si es que decide hacer cambios, puede regresar al Asistente para modificar su informe. Busque <kbd>Indice de Asistentes </kbd>en la Ayuda en l&#237;nea de Seagate Crystal Reports.</p><a name="210201"></a><h3>Otro Informe</h3>
<p><a name="210202"></a>Si usted quiere construir un nuevo informe basado en otro que ya existe, puede utilizar ese otro informe como plantilla. El programa har&#225; un duplicado del informe original, el cual puede modificar a su antojo para crear el nuevo informe. Use esta opci&#243;n cuando crea que una plantilla le puede ahorrar tiempo. Las plantillas son &#250;tiles cuando necesita:</p><ul type="disc"><a name="210203"></a><li>crear un nuevo informe con un agrupamiento o selecci&#243;n de registros diferente al del informe existente;
<a name="210204"></a><li>crear una serie de informes, cada uno un poco diferente del anterior;
<a name="210205"></a><li>reconstruir un informe basado en un per&#237;odo de tiempo pasado, usando la misma estructura de un informe actual;
<a name="210206"></a><li>crear un informe completamente nuevo basado en un conjunto de bases de datos que est&#225;n vinculadas en otro informe. Usted puede crear un informe y eliminar los campos sin perturbar los v&#237;nculos internos. Despu&#233;s, sin necesidad de establecer v&#237;nculos nuevamente, puede construir todos sus nuevos informes basado en este informe.
</ul><a name="210265"></a><h3>Informe nuevo</h3>
<p><a name="210266"></a>La opci&#243;n <strong>Como informe en blanco</strong> se usa cuando usted quiere crear un informe partiendo de cero. Esta situaci&#243;n se presenta cuando quiere toda la flexibilidad y el control para construir su informe desde el principio o cuando el tipo de informe que quiere realizar es diferente al de los modelos que ofrece el programa.</p><p><a name="214092"></a>La opci&#243;n <strong>Como informe en blanco</strong> fue elegida para el <a href="04_quick.html#65368">Inicio r&#225;pido</a>, ya que crear un informe desde el principio permite ilustrar con mayor cobertura los conceptos b&#225;sicos en la elaboraci&#243;n de informes.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "06_create_rpt.html";
var next = "06_create_rpt3.html";

function setTopicID() { 
      var number = "210191"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


