<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Objetos de Texto</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="230499"></a><h4 class="newpage"> Objetos de Texto</h4><p><a name="230500"></a>Los objetos de texto ser&#225;n usados en su informe en una multitud de prop&#243;sitos. Estos proveen una manera vers&#225;til para insertar t&#237;tulos, rotular res&#250;menes y otros datos en su informe, y para combinar f&#225;cilmente campos de base de datos. Por ejemplo, en el <a href="04_quick.html#65368">Inicio r&#225;pido</a>, se usan objetos de texto para desplegar los dos campos de nombre del contacto como un solo objeto, tanto para insertar un encabezado de columna para el nombre del contacto concatenado, como para insertar un t&#237;tulo en su informe. </p><a name="222496"></a><h6>Para insertar un objeto de Texto</h6><ol>
<a name="211864"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_intxt.gif">


Haga clic en el bot&#243;n <strong>Insertar objeto de texto</strong> de la barra de herramientas est&#225;ndar. Un marco de objeto vac&#237;o aparecer&#225; en su pantalla.
<p><a name="211872"></a> <img src="images/plc_text.gif">


</p>
<a name="216923"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">Ponga el objeto de texto donde quiere que aparezca en el informe.
<p class="indent"><a name="211875"></a>Haga clic una vez en el borde del objeto de texto para seleccionarlo para movimiento y cambio de tama&#241;o.</p><p class="indent"><a name="211876"></a>Haga doble clic dentro del objeto de texto para seleccionarlo para edici&#243;n. La regla de la ficha Dise&#241;o cambia a una regla del objeto de texto del mismo tama&#241;o del objeto seleccionado. A la izquierda, aparecer&#225; un indicador de tabulaci&#243;n.</p><p><a name="223401"></a> </p>
<p><a name="211877"></a> </p>
</ol>
<p><a name="211878"></a>La regla le permite agregar sangr&#237;as y alinear texto dentro del objeto de texto. Haciendo clic en el indicador de tabulaci&#243;n, puede moverse en c&#237;rculo a trav&#233;s de las cuatro formas de tabular disponibles.</p><p><a name="211879"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Cuando inserta un objeto de texto por primera vez en su informe, el objeto queda autom&#225;ticamente seleccionado para edici&#243;n.</p>
<a name="211881"></a><h6>C&#243;mo usar un campo de base de datos en un objeto de texto</h6><p><a name="211882"></a>La funci&#243;n principal de un objeto de texto es contener texto. Sin embargo, objetos de texto tambi&#233;n pueden contener campos de base de datos, convirti&#233;ndose as&#237; en instrumentos ideales para crear cartas modelo personalizadas.</p><ol>
<a name="211883"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">Inserte un objeto de texto en su informe.
<p><a name="211892"></a> <img src="images/06_create_rpt16a.gif">


</p>
<a name="216944"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">Escriba el texto (o espacios) que quiere que aparezca antes del primer campo de la base de datos.
<a name="211899"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_indat.gif">


Haga clic en el bot&#243;n <strong>Insertar campos</strong> de la barra de herramientas est&#225;ndar.
<p class="indent"><a name="211900"></a>El cuadro de di&#225;logo Insertar Campos aparecer&#225; con la ficha base datos activa.</p><a name="211901"></a><li value="4&nbsp;&nbsp;&nbsp;&nbsp;">Resalte el campo que quiere insertar y arr&#225;strelo hacia el interior del objeto de texto. Cuando mueve el cursor de arrastrar y colocar sobre el objeto de texto, el programa despliega un punto de inserci&#243;n m&#243;vil.
<p><a name="211911"></a> <img src="images/dw_dbtx2.gif">


</p>
<a name="211913"></a><li value="5&nbsp;&nbsp;&nbsp;&nbsp;">Arrastre el objeto de modo que el punto de inserci&#243;n est&#233; localizado donde usted quiere que aparezca el campo. Coloque el campo en ese punto, liberando el bot&#243;n del mouse.
</ol>

<hr><br>

<script  language="JavaScript"><!--

var prev = "06_create_rpt19.html";
var next = "06_create_rpt21.html";

function setTopicID() { 
      var number = "230499"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


