<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Diccionarios</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="214168"></a><h3 class="newpage"> Diccionarios</h3>
<p><a name="214169"></a>En muchas organizaciones grandes, los datos se almacenan en diferentes lugares, por ejemplo, diferentes bases de datos o diferentes servidores. Departamentos de SI (Sistemas de Informaci&#243;n) a menudo usan arreglos de nombres para tablas y campos que son l&#243;gicos y predecibles, pero estos mismos nombres pueden parecer cr&#237;pticos para aquellos miembros del personal sin conocimiento t&#233;cnico. Entrenar al personal para elaborar informes en este medio (con terminolog&#237;a t&#233;cnica) puede consumir mucho tiempo, crear problemas de entrenamiento y de apoyo, y posiblemente, comprometer la integridad de los datos. Los diccionarios proveen la soluci&#243;n a este problema. Ellos le permiten proveer al personal f&#225;cil acceso a los datos en una forma m&#225;s comprensible para &#233;stos, pero a la vez le permiten mantener completo control y seguridad de sus bancos de datos. </p><p><a name="214170"></a>Un diccionario es una vista estructurada, simplificada y segura de los bancos de datos generales, que usted puede crear para algunos o todos los usuarios de su organizaci&#243;n. </p><p><a name="214171"></a>Un diccionario es un filtro interno que usted puede poner entre los usuarios y los datos. Usando las capacidades de este filtro puede: </p><ul type="disc"><a name="214172"></a><li>dise&#241;ar una sola vista din&#225;mica de todos los datos que son necesarios para crear informes y consultas a nivel de la organizaci&#243;n,
<a name="214173"></a><li>incluir diferentes fuentes y tablas de datos y v&#237;nculos entre ellas,
<a name="214174"></a><li>organizar los datos y cambiar de nombre a tablas y campos para que los usuarios puedan entender f&#225;cilmente el contenido y el prop&#243;sito de los datos,
<a name="214175"></a><li>limitar el acceso a columnas de datos espec&#237;ficas (por ejemplo, s&#243;lo permitir a los ejecutivos ver la columna de salarios de los archivos de datos de los empleados),
<a name="214176"></a><li>poner f&#243;rmulas de restricci&#243;n en filas de datos espec&#237;ficas (por ejemplo, permitir a los gerentes ver informaci&#243;n personal s&#243;lo de los empleados con un salario menor de $40,000.00),
<a name="214177"></a><li>crear f&#243;rmulas complejas de manipulaci&#243;n de datos accesibles a los usuarios sin necesidad de que &#233;stos entiendan los conceptos de dichas f&#243;rmulas. 
</ul><p><a name="214178"></a>Los diccionarios reducen tiempo y costo de apoyo, incrementan la productividad de los usuarios y le permiten agregar un filtro de seguridad entre los usuarios y los datos.</p><p><a name="210475"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font></p>
<ul type="disc"><a name="216751"></a><li>Cuando usted crea un informe usando un diccionario, los &#250;nicos datos que puede usar son los que puede recuperar a trav&#233;s del diccionario; no puede usar un diccionario y otra fuente de datos en el mismo informe. Debido a que los diccionarios son usados a menudo para imponer condiciones de seguridad a los datos, ser&#237;a contradictorio a dichas condiciones el permitir el acceso ilimitado a los datos en un informe de diccionario.
<a name="216424"></a><li>Si es posible incluir un subinforme basado en una fuente de datos diferente en un informe principal basado en un diccionario.
<a name="214185"></a><li>Los diccionarios son filtros opcionales. Puede usar Seagate Crystal Reports sin necesidad de usar diccionarios. 
</ul><p><a name="214189"></a>Vea <a href="27_dictionary.html#143975">Diccionarios</a>.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "06_create_rpt4.html";
var next = "06_create_rpt6.html";

function setTopicID() { 
      var number = "214168"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


