<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Barra de herramientas y men&#250; contextual</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="208602"></a><h4 class="newpage"> Barra de herramientas y men&#250; contextual</h4><p><a name="208603"></a>La barra de herramientas ofrece botones con informaci&#243;n sobre la herramienta y combinaciones de teclas de acceso directo. Puede hacer clic con el bot&#243;n derecho en cualquier elemento de la vista de &#225;rbol para abrir un men&#250; contextual.</p><p><a name="208604"></a>La barra de herramientas y el men&#250; contextual ofrecen estas funciones: </p><ul type="disc"><a name="208605"></a><li><kbd>Insertar a informe<br></kbd>Use esta opci&#243;n para agregar un campo al informe. Es posible insertar m&#225;s de un campo a la vez seleccionando varios campos, haciendo clic con el bot&#243;n derecho y eligiendo Insertar a informe.
<p class="indent"><a name="208606"></a>De modo alternativo, para insertar un campo, puede arrastrar y soltarlo en las fichas Dise&#241;o o Vista previa.</p><a name="208607"></a><li><kbd>Examinar datos<br></kbd>Use esta opci&#243;n para examinar datos de un campo de base de datos o de f&#243;rmula.
<p class="indent"><a name="208608"></a>Al hacer clic con el bot&#243;n derecho en un campo de base de datos, las funciones Insertar a informe y Examinar datos estar&#225;n activadas.</p><a name="208609"></a><li><kbd>Nuevo<br></kbd>Use esta opci&#243;n para crear un campo de f&#243;rmula, un campo de enunciado SQL, un campo de par&#225;metro o un campo de total acumulado.
<a name="208610"></a><li><kbd>Editar<br></kbd>Use esta opci&#243;n para modificar un campo de f&#243;rmula, un campo de enunciado SQL, un campo de par&#225;metro o un campo de total acumulado existentes.
<a name="208611"></a><li><kbd>Cambiar nombre<br></kbd>Use esta opci&#243;n para modificar el nombre de un campo de f&#243;rmula, un campo de enunciado SQL, un campo de par&#225;metro o un campo de total acumulado existentes.
<a name="208612"></a><li><kbd>Eliminar<br></kbd>Use esta opci&#243;n para eliminar un campo de f&#243;rmula, un campo de enunciado SQL, un campo de par&#225;metro o un campo de total acumulado. Tambi&#233;n puede seleccionar varios campos si hace clic con el bot&#243;n derecho y elige Eliminar para quitarlos todos a la vez.
<a name="208613"></a><li><kbd>Mover par&#225;metro arriba (o abajo)<br></kbd>Use esta opci&#243;n para cambiar el orden de los campos de par&#225;metros.
<p class="indent"><a name="208614"></a>Al hacer clic con el bot&#243;n derecho en un campo de par&#225;metro, se activan todas las funciones excepto Examinar datos.</p></ul><a name="208615"></a><h4>Campos de nombre de grupo</h4><p><a name="210576"></a>Es posible insertar un campo de nombre de grupo existente mostrado en el Explorador de campos haciendo clic con el bot&#243;n derecho y seleccionando Insertar. Sin embargo, a diferencia de los campos de f&#243;rmula, de par&#225;metro o de total acumulado, no puede crear un campo de nombre de grupo usando el Explorador de campos. (Un campo de nombre de grupo se crea al insertar un grupo.)</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "06_create_rpt8.html";
var next = "06_create_rpt10.html";

function setTopicID() { 
      var number = "208602"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


