<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Semejanzas y diferencias con respecto a la ficha Dise&#241;o</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="211374"></a><h4 class="newpage"> Semejanzas y diferencias con respecto a la ficha Dise&#241;o</h4><p><a name="211375"></a>La capacidad de edici&#243;n en la ficha Vista previa est&#225; en la ficha Dise&#241;o Men&#250;es (barra de men&#250;es y men&#250;es contextuales), las barras de herramientas est&#225;ndar y suplementaria, reglas y la barra de formato permanecen activas, d&#225;ndole a usted la misma funcionalidad que tiene en la ficha Dise&#241;o. Sin embargo, cuando tiene que hacer muchos cambios, es m&#225;s r&#225;pido hacerlos en la ficha Dise&#241;o. Tenga en cuenta los siguientes puntos:</p><ul type="disc"><a name="211376"></a><li>La ficha Dise&#241;o y la ficha Vista previa est&#225;n ligadas internamente. Cualquier cambio que hace en una de ellas, se refleja autom&#225;ticamente en la otra.
<a name="211377"></a><li>La ficha Vista previa tiene una regla vertical a la izquierda, en lugar de las reglas de secci&#243;n individuales como la ficha Dise&#241;o. La funcionalidad de las reglas es la misma.
<a name="211378"></a><li>La ficha Vista previa identifica las secciones del informe en el &#225;rea sombreada a la izquierda de los datos. De una mirada usted puede saber de cual secci&#243;n del informe se est&#225;n imprimiendo los datos. Mientras que los nombres de secci&#243;n aparecen s&#243;lo una vez en la ficha Dise&#241;o, en la ficha Vista previa se "imprimen" cada vez que se "imprime" una secci&#243;n.
<a name="211381"></a><li>El Contador de registros , el Indicador de edad de los datos (vea <a href="06_create_rpt14.html#210691">El Indicador de Edad de Los Datos</a>) y los controles de Siguiente p&#225;gina/P&#225;gina previa (vea <a href="06_create_rpt13.html#222791">Ficha Vista previa</a>), est&#225;n todos activos en la ficha Vista previa.
<a name="211389"></a><li>La ficha Vista previa resalta cada valor cuando usted selecciona un campo; a diferencia, s&#243;lo el marco del campo es resaltado en la ficha Dise&#241;o.
</ul><p><a name="211390"></a>Trabajar en la ficha Vista previa tiene una sensaci&#243;n diferente a trabajar en la ficha Dise&#241;o.</p><p><a name="211391"></a>Cada campo en una base de datos contiene docenas, cientos o miles de valores, dependiendo del n&#250;mero de registros en la base de datos. Cuando ubica un campo en la ficha Dise&#241;o, un solo marco de campo representa todos los valores, cuando resalta el campo, aparecen controladores de tama&#241;o en el marco y, a la vez, el marco cambia de color.</p><p><a name="226196"></a>En la ficha Vista previa, sin embargo, est&#225; trabajando con los datos reales. En lugar de un marco representando los valores de los campos, el valor real aparece dentro del marco. Tenga en cuenta los siguientes puntos:</p><ul type="disc"><a name="211393"></a><li>Cuando resalta un campo o el valor de un campo de f&#243;rmula, en realidad est&#225; seleccionando todos los valores en el campo.
<ul type="disc"><ul type="disc"><a name="211394"></a><li>El programa pone un marco de cambio de tama&#241;o alrededor del valor espec&#237;fico que usted selecciona.<a name="211395"></a><li>Resalta todos los dem&#225;s valores del campo.</ul></ul><a name="211396"></a><li>De igual manera, cuando selecciona el valor de un resumen, est&#225; seleccionando todos los valores de los res&#250;menes relacionados.
<ul type="disc"><ul type="disc"><a name="211397"></a><li>El programa pone un marco de cambio de tama&#241;o alrededor del valor espec&#237;fico que selecciona.<a name="211398"></a><li>Resalta todos los valores de los res&#250;menes relacionados.</ul></ul></ul><p><a name="211399"></a>Aparte de las obvias diferencias de apariencia, el proceso de elaborar y modificar un informe es el mismo en ambas fichas (Vista Previa y Dise&#241;o). Encontrar&#225; f&#225;cil trabajar en su informe en cualquiera de ellas.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "06_create_rpt15.html";
var next = "06_create_rpt17.html";

function setTopicID() { 
      var number = "211374"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


