<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Areas de la ficha Dise&#241;o</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="210598"></a><h4 class="newpage"> Areas de la ficha Dise&#241;o</h4><p><a name="210599"></a>Cuando comienza a crear un informe, Seagate Crystal Reports crea autom&#225;ticamente cinco &#225;reas en la ficha Dise&#241;o.</p><ul type="disc"><a name="210602"></a><li><strong>Encabezado del informe<br></strong>Esta secci&#243;n es usada generalmente para el t&#237;tulo del informe y otra informaci&#243;n que quiere que aparezca al principio de su informe. Tambi&#233;n puede ser usada para gr&#225;ficos y tablas cruzadas que incluyan datos para todo el informe.
<a name="210604"></a><li><strong>Encabezado de p&#225;gina<br></strong>Esta secci&#243;n se usa generalmente para incluir informaci&#243;n que quiere que aparezca en la parte superior de cada p&#225;gina, tal como nombre de cap&#237;tulo, nombre del documento u otra informaci&#243;n similar. Tambi&#233;n puede usar esta secci&#243;n para desplegar t&#237;tulos de campo sobre los campos mismos en su informe.
<a name="210606"></a><li><strong>Detalles<br></strong>Esta secci&#243;n es usada para el cuerpo del informe y se imprime una vez por registro. La mayor parte de los datos de su informe aparecer&#225; generalmente en esta secci&#243;n. 
<a name="222608"></a><li><strong>Pie del informe<br></strong>Esta secci&#243;n es usada para mostrar informaci&#243;n que quiere que aparezca s&#243;lo una vez en su informe, tal como totales generales, gr&#225;ficos y tablas cruzadas que incluyen datos para todo el informe.
<a name="210608"></a><li><strong>Pie de p&#225;gina<br></strong>Esta secci&#243;n contiene generalmente el numero de p&#225;gina y cualquier otra informaci&#243;n que quiere que aparezca en la parte inferior de cada p&#225;gina.
</ul><p><a name="222620"></a>Si agrega un grupo, un resumen o un subtotal a su informe, el programa crea dos secciones adicionales:</p><ul type="disc"><a name="222627"></a><li><strong>Encabezado de grupo<br></strong>Esta secci&#243;n por lo general contiene el campo de nombre de grupo y puede ser usado para mostrar gr&#225;ficos o tablas cruzadas que contienen datos espec&#237;ficos del grupo. S&#243;lo se imprime una vez al principio de un grupo.
<a name="222623"></a><li><strong>Pie de grupo<br></strong>Esta secci&#243;n generalmente contiene el valor total de ese grupo, si es que existe alguno, y tambi&#233;n puede ser utilizado para mostrar gr&#225;ficos o tablas cruzadas. Se imprime s&#243;lo una vez al final de un grupo.
</ul><p><a name="210616"></a>Cuando agrega un grupo, un valor total o un subtotal, el &#225;rea del Encabezado de grupo aparece directamente arriba del &#225;rea de Detalles y el Pie de grupo aparece directamente debajo del &#225;rea de Detalles.</p><p><a name="222668"></a> <img src="images/06_create_rpt31a.gif">


</p>
<p><a name="216461"></a>Si incluye m&#225;s grupos, el programa crea m&#225;s &#225;reas entre el &#225;rea de Detalles y las &#225;reas de Encabezado y Pie de grupo que ya existen.</p><p><a name="233191"></a> <img src="images/Dw_hdft2.gif">


</p>
<p><a name="233247"></a> <img src="images/Dw_hdft3.gif">


</p>
<p><a name="229263"></a> .</p>
<p><a name="231903"></a> </p>
<p><a name="210618"></a>Tal como las &#225;reas originales, cada una de estas &#225;reas adicionales pueden contener una o m&#225;s secciones. El programa asigna a cada &#225;rea una sola secci&#243;n en forma autom&#225;tica.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "06_create_rpt10.html";
var next = "06_create_rpt12.html";

function setTopicID() { 
      var number = "210598"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


