<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Selecci&#243;n de grupos N superiores o inferiores</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="247620"></a><h3 class="newpage"> Selecci&#243;n de grupos N superiores o inferiores</h3>
<p><a name="247621"></a>En algunas ocasiones, quiz&#225;s quiera mostrar s&#243;lo el grupo superior o inferior en un informe: las l&#237;neas de producci&#243;n m&#225;s r&#225;pidamente vendidas, las regiones de venta menos productivas, los estados que generan m&#225;s pedidos, etc. Debido a que este tipo de selecci&#243;n de grupo es tan popular el programa incluye el Asistente de N Superiores/Ordenamiento de Grupo para configurarlo f&#225;cilmente.</p><p><a name="247622"></a>Sin embargo, hay otra consideraci&#243;n con la selecci&#243;n de grupos N Superiores y es, qu&#233; hacer con todos los registros de otros grupos que no concuerden con los criterios de N Superiores o N Inferiores que usted establezca. Aqu&#237; necesita decidir si desea eliminar por completo esos registros de su informe, o ponerlos juntos en un solo grupo con el nombre que usted designe. El programa le permite hacer ambas cosas. </p><p><a name="249046"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>El informe debe contener un valor resumido para poder realizar la selecci&#243;n de N Superiores y N Inferiores.</p>
<a name="247627"></a><h6>Seleccionar los grupos N Superiores o N Inferiores:</h6><ol>
<a name="247628"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">Haga el informe y resuma los datos como lo desee. Cuando resume los datos, el programa divide los datos en grupos y resume cada grupo.
<ul type="disc"><ul type="disc"><a name="247629"></a><li>Con el Agrupamiento de N Superiores, usted est&#225; dando instrucciones al programa para presentar aquellos grupos que tengan los valores de resumen m&#225;s altos (N Superiores).<a name="247630"></a><li>Con el Agrupamiento de N Inferiores, le est&#225; dando instrucciones al programa para presentar aquellos grupos que tengan los valores resumidos m&#225;s bajos(N Inferiores).</ul></ul><a name="247636"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/08_sortgrouptotal20a.gif">


Haga clic en el bot&#243;n<strong> Asistente de n superiores</strong> en la barra de herramientas suplementaria.
<p class="indent"><a name="247637"></a>El Asistente de N Superiores/Ordenamiento de Grupos aparece con una ficha para su grupo.</p><p class="indent"><a name="250045"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Si tiene grupo de secciones m&#250;ltiples, el programa mostrar&#225; una ficha para cada grupo.</p>
<p><a name="260229"></a> <img src="images/db_topn.gif">


</p>
<a name="250046"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">Seleccione <strong>N Superiores, N Inferiores</strong> o <strong>Seleccione Todos</strong> de esta lista.
<a name="250047"></a><li value="4&nbsp;&nbsp;&nbsp;&nbsp;">Seleccione el resumen en que desea basar su selecci&#243;n del cuadro desplegable de res&#250;menes a la derecha.
<p class="indent"><a name="247641"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>El cuadro desplegable de res&#250;menes a la derecha es para aquellos casos en los cuales tiene m&#250;ltiples res&#250;menes en una secci&#243;n de grupo. Por ejemplo, en un informe de pedidos, quiz&#225;s quiera sumar y promediar los pedidos de cada cliente y mostrar ambos, el total y el promedio en la misma secci&#243;n de grupo. En tal caso usted seleccionar&#237;a el total o el promedio desde este cuadro desplegable.</p>
<a name="247642"></a><li value="5&nbsp;&nbsp;&nbsp;&nbsp;">En el cuadro <strong>donde N es</strong>, inserte el n&#250;mero de grupos que quiere desplegar. Por ejemplo:
<ul type="disc"><ul type="disc"><a name="245990"></a><li>para crear un informe sobre las tres l&#237;neas de productos de ventas m&#225;s r&#225;pidas, seleccione la opci&#243;n N superior en el Asistente de N superiores/ordenamiento y fije <EM>N</EM> igual a tres.<a name="245991"></a><li>para crear un informe sobre las cinco regiones de ventas menos productivas, seleccione la opci&#243;n N inferior en el Asistente de N superiores/ordenamiento<kbd> </kbd>y fije <EM>N</EM> igual a cinco.</ul></ul><a name="245992"></a><li value="6&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en la casilla de verificaci&#243;n <strong>incluir Otros, con el nombre</strong> e ingrese un nombre si desea agrupar todos los dem&#225;s registros en un solo grupo.
<a name="247747"></a><li value="7&nbsp;&nbsp;&nbsp;&nbsp;">Al terminar, haga clic en <strong>Aceptar</strong>.
<p class="indent"><a name="249123"></a>Ahora, cuando el programa ejecute el informe, &#233;ste incluir&#225; s&#243;lo aquellos grupos que usted especifique.</p></ol>
<hr><br>

<script  language="JavaScript"><!--

var prev = "08_sortgrouptotal16.html";
var next = "08_sortgrouptotal18.html";

function setTopicID() { 
      var number = "247620"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


