<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Modo de Edici&#243;n</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="60717"></a><h4 class="newpage"> Modo de Edici&#243;n</h4><p><a name="60718"></a>Cuando el objeto est&#225; en el modo de Edici&#243;n, aparece como un marco de l&#237;neas diagonales sin controles para ajustar y con una regla integrada en la parte superior de la ficha.</p><p><a name="60722"></a> <img src="images/frame2.gif">


</p>
<p><a name="64858"></a>Cuando usted ubica un objeto de texto por primera vez, el programa lo pone en el modo de Edici&#243;n. Tambi&#233;n puede poner un objeto de texto en modo de Edici&#243;n al hacerle doble clic si est&#225; inactivo o en el modo Mover/Ajustar.</p><p><a name="60725"></a>Cada objeto de texto contiene las capacidades de un mini procesador de palabras, incluyendo la habilidad de cambiar la fuente para caracteres y campos individuales, y ajuste autom&#225;tico de palabras. En el modo de Edici&#243;n usted puede insertar texto y objetos no textuales, tales como campos de bases de datos y f&#243;rmulas. Siempre que el objeto est&#225; en el modo de Edici&#243;n, contiene un punto de inserci&#243;n, es decir, una l&#237;nea vertical intermitente que indica la posici&#243;n inicial del texto tecleado o los campos insertados.</p><p><a name="60726"></a>El punto de inserci&#243;n se mueve a medida que usted escriba, permaneciendo autom&#225;ticamente a la derecha del &#250;ltimo car&#225;cter. Tambi&#233;n se mueve cuando se inserta un campo, permaneciendo autom&#225;ticamente a la derecha del campo. Se mueve una posici&#243;n de car&#225;cter a la vez cuando presiona la barra espaciadora. Se mueve una l&#237;nea hacia abajo y hacia el borde interior izquierdo del objeto de texto cuando presiona Entrar. Se mueve a la posici&#243;n de su cursor cuando hace clic en cualquier parte dentro del texto existente.</p><p><a name="60727"></a>A medida que usted avanza en estos tutoriales, siempre se espera que escriba o inserte campos en el punto existente de inserci&#243;n, a menos que se le indique lo contrario.</p><ul type="disc"><a name="60728"></a><li>Para seleccionar texto en un objeto de texto (para eliminarlo, cambiar una fuente y dem&#225;s), coloque el cursor sobre el texto y cuando aparezca el cursor intermitente "I", arr&#225;strelo para resaltar el texto que desea selecciona campo de manera que se sobreponga al objeto de texto, en lugar de insertarlo en &#233;l. 
<a name="68533"></a><li>Podr&#237;a parecer que est&#225; dentro del objeto de texto, pero si mueve el objeto, el campo no se mover&#225; con &#233;ste.
<a name="68562"></a><li>Para insertar texto, escr&#237;balo y &#233;ste aparecer&#225; en el punto de inserci&#243;n.
<p><a name="68540"></a> <img src="images/in_txt2.gif">


</p>
<p class="indent"><a name="68541"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Es necesario que el cursor para arrastrar y soltar aparezca antes de ubicar el campo. Si no aparece, es posible que ubique el campo de modo que &#233;ste tape el objeto de texto en lugar de estar insertado en &#233;l. Parecer&#225; que est&#225; dentro del objeto de texto, pero si mueve el objeto, el campo no se mover&#225; al mismo tiempo.</p>
<a name="60740"></a><li>El punto de inserci&#243;n est&#225; unido con el cursor de arrastrar y ubicar. Si ya tiene alg&#250;n texto o campo en el objeto de texto, el punto de inserci&#243;n se mover&#225; conforme mueva el cursor de arrastrar y ubicar, permiti&#233;ndole elegir el punto exacto donde desea colocar el campo. El programa siempre coloca el campo en el punto de inserci&#243;n.
<p><a name="72643"></a> </p>
</ul><a name="59163"></a><h6>Temas relacionados</h6><p><a name="68327"></a><kbd><a href="10_multsec_rep13.html#60698">Trabajar con objetos de texto</a>.</kbd></p><a name="68309"></a><h3>Creaci&#243;n de una carta modelo usando un objeto de texto</h3>
<p><a name="59164"></a>La siguiente secci&#243;n muestra c&#243;mo crear una carta modelo.</p><p><a name="59165"></a>Usaremos un objeto de texto para crear una carta modelo. La carta modelo que usted crea estar&#225; vinculada a una tabla de base de datos, de modo que cada carta se personalizar&#225; con informaci&#243;n de la compa&#241;&#237;a proveniente de un registro diferente.</p><p><a name="59169"></a>Si tiene alguna dificultad en efectuar cualquiera de los pasos, vea <a href="10_multsec_rep13.html#60698">Trabajar con objetos de texto</a>.</p><a name="60968"></a><h6>Para crear una carta modelo</h6><p><a name="60969"></a>La carta consistir&#225; de la fecha, direcci&#243;n, saludo, cuerpo de la carta y despedida.</p><ol>
<a name="60974"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">Cree un informe en blanco. Use la tabla <kbd>Cliente</kbd> de <kbd>Xtreme_es.mdb</kbd>.
<p class="indent"><a name="60975"></a>La ficha Dise&#241;o aparece con la ficha Base de datos activa en el cuadro de di&#225;logo Insertar Campos.</p><a name="60976"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">Ya que no desea que los t&#237;tulos de los campos aparezcan arriba de los campos que inserte en la carta, desactive la opci&#243;n <kbd>Insertar t&#237;tulos de campos de Detalles</kbd> en la ficha <kbd>Esquema</kbd> del cuadro de di&#225;logo Opciones.
<a name="60977"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">Inserte un objeto de texto en la secci&#243;n <kbd>Detalles</kbd> de su informe.
<p><a name="60981"></a> <img src="images/Formltr1.gif">


</p>
<a name="60983"></a><li value="4&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en el marco del objeto de texto para poner el objeto en el modo Mover/Ajustar.
<a name="60984"></a><li value="5&nbsp;&nbsp;&nbsp;&nbsp;">Arrastre el control de ajuste al lado derecho del objeto hacia el borde derecho de la ficha <kbd>Dise&#241;o</kbd>. Esto har&#225; al objeto de 8 pulgadas de ancho m&#225;s o menos; la anchura aproximada de la p&#225;gina. Es posible que tenga que detener el ajuste, desplazar la ventana y ajustar un poco m&#225;s para completar la operaci&#243;n.
<p><a name="60988"></a> <img src="images/Formltr2.gif">


</p>
<a name="60990"></a><li value="6&nbsp;&nbsp;&nbsp;&nbsp;">Haga doble clic dentro del objeto de texto para ponerlo en el modo de Edici&#243;n, listo para empezar a trabajar. Cuando haga esto, el punto de inserci&#243;n ser&#225; colocado a la extrema izquierda, dentro del objeto.
</ol>

<hr><br>

<script  language="JavaScript"><!--

var prev = "10_multsec_rep14.html";
var next = "10_multsec_rep16.html";

function setTopicID() { 
      var number = "60717"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


