<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Uso de los m&#225;rgenes predeterminados</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="85001"></a><h4 class="newpage"> Uso de los m&#225;rgenes predeterminados</h4><p><a name="88517"></a>Cuando en el dise&#241;o de su informe usted usa los m&#225;rgenes establecidos por la impresora, podr&#237;an darse ciertas situaciones espec&#237;ficas.</p><ul type="disc"><a name="88518"></a><li>Cuando el informe es impreso en otra m&#225;quina cuyos m&#225;rgenes son <EM>mayores</EM> (reduciendo el &#225;rea de impresi&#243;n), los objetos al lado derecho del informe quedar&#225;n fuera de la impresi&#243;n.
<a name="88519"></a><li>Cuando el informe es impreso en otra m&#225;quina cuyos m&#225;rgenes son <EM>menores</EM> (aumentando el &#225;rea de impresi&#243;n), el informe completo ser&#225; movido hacia la izquierda de la p&#225;gina.
</ul><p><a name="88520"></a>Se recomienda que siempre establezca sus propios m&#225;rgenes. Aun si los m&#225;rgenes que quiere usar son iguales a los de la impresora, aseg&#250;rese de desactivar la opci&#243;n Usar m&#225;rgenes predeterminados del cuadro de di&#225;logo Configurar P&#225;gina, y de especificar sus m&#225;rgenes manualmente usando el comando Preparar impresora.</p><a name="88524"></a><h3>Impresora predeterminada</h3>
<p><a name="88525"></a>En general, es una buena idea no elegir una impresora espec&#237;fica. Aun cuando una impresora puede ser id&#233;ntica, la manera en que es reconocida puede variar de acuerdo al sistema operativo.</p><p><a name="88585"></a>Por ejemplo, una impresora HP L&#225;ser III se instala en tres sistemas operativos diferentes.</p><ul type="disc"><a name="88586"></a><li>Con Windows 95, el nombre de la impresora puede ser cambiado de manera que HP L&#225;ser III ser&#237;a Front Reception Printer, pero el controlador de la impresora ser&#225; listado como HPPCL5MS.DRV.
<a name="88587"></a><li>Con Windows NT, el nombre de la impresora es tambi&#233;n por referencia y puede ser cambiado por el usuario, pero el controlador de la impresora es siempre WINSPOOL.
</ul><p><a name="88588"></a>Cuando usted elija una impresora espec&#237;fica, Seagate Crystal Reports buscar&#225; esa impresora por su nombre. Si dicha impresora no se encuentra en el sistema, ser&#225; reemplazada por la impresora predeterminada, abriendo la posibilidad de inconsistencias en la impresi&#243;n.</p><p><a name="88589"></a>Si usted necesita especificar una impresora, tal como una impresora de sobres o de etiquetas, el nombre de la impresora debe ser el mismo que fue usado al momento de dise&#241;ar el informe. Tome en cuenta que cualquiera que imprima el informe debe usar la misma impresora, de lo contrario, podr&#237;an surgir problemas inesperados.</p><p><a name="91040"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Si su informe es parte de un programa para ser distribuido, puede incluir el cuadro de di&#225;logo Seleccionar Impresora. Usando este cuadro de di&#225;logo, los usuarios del informe pueden elegir la impresora correcta o cambiarle de nombre apropiadamente.</p>

<hr><br>

<script  language="JavaScript"><!--

var prev = "11_format27.html";
var next = "11_format29.html";

function setTopicID() { 
      var number = "85001"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


