<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Ubicaci&#243;n en modo libre</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="90895"></a><h3 class="newpage"> Ubicaci&#243;n en modo libre</h3>
<p><a name="84461"></a>Tambi&#233;n puede desear utilizar Seagate Crystal Reportssin una cuadr&#237;cula, en un ambiente de modo libre similar al de un programa de dibujo. Modo libre significa que puede reubicar objetos en cualquier parte en que desee que aparezcan en su informe. Su &#250;nica restricci&#243;n es que el programa no le permite ubicar objetos de gr&#225;fico y Tabla Cruzada en el Encabezado de P&#225;gina, Pie de P&#225;gina o secci&#243;n Detalles.</p><p><a name="88238"></a>Para trabajar en un ambiente de modo libre, seleccione la opci&#243;n Ubicaci&#243;n en Modo Libre de la ficha Organizaci&#243;n del cuadro de di&#225;logo Opciones.</p><a name="88239"></a><h4>Opcion Ubicacion en Modo Libre Activada</h4><p><a name="88240"></a>Para crear informes din&#225;micos y reducir la dependencia del controlador de la impresora tanto como sea posible, se recomienda que el formato de todas las secciones del informe se definan teniendo activada la opci&#243;n Ubicaci&#243;n en modo libre. Esto es especialmente importante si su informe incluye objetos OLE, tales como gr&#225;ficos, cuadros, l&#237;neas o im&#225;genes en formato de bits (como el logotipo de la compa&#241;&#237;a).</p><p><a name="88241"></a>Cuando una secci&#243;n tiene formato Ubicaci&#243;n en modo libre, <EM>todos</EM> los objetos pueden ser ubicados en<EM> cualquier parte</EM> de dicha secci&#243;n. Seagate Crystal Reports ubica objetos dentro de una secci&#243;n en base a sus coordenadas absolutas. Estas coordenadas determinan la ubicaci&#243;n vertical de los objetos en su informe, es decir, que usted, y no el controlador, controla la ubicaci&#243;n vertical de objetos monolineales (aquellos que imprimen en una sola l&#237;nea). De esta forma, usted garantiza menos inconsistencias cuando se usan diferentes controladores en la impresi&#243;n.</p><p><a name="88242"></a>Sin embargo, aunque el controlador de la impresora ya no controla el espaciado vertical de los objetos base<nobr>-t</nobr>exto dentro de la secci&#243;n, a&#250;n determina el espaciado horizontal de los caracteres dentro de los objetos base<nobr>-t</nobr>exto, as&#237; como tambi&#233;n el espacio entre l&#237;neas de los objetos de texto multilineales. As&#237;, mientras Ubicaci&#243;n en modo libre le permite mejor control, usted todav&#237;a debe tomar en cuenta estas consideraciones en el dise&#241;o de sus informes. Vea <a href="11_format9.html#87449">Ubicaci&#243;n de objetos base<nobr>-t</nobr>exto multilineales</a>.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "11_format19.html";
var next = "11_format21.html";

function setTopicID() { 
      var number = "90895"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


