<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Importaci&#243;n de objetos basados en texto desde un archivo</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="83677"></a><h3 class="newpage"> Importaci&#243;n de objetos basados en texto desde un archivo</h3>
<p><a name="83678"></a>Con Seagate Crystal Reports, puede importar un objeto con formato y basado en texto desde un archivo existente a su informe.</p><a name="83679"></a><h6>Para importar objetos basados en texto desde un archivo</h6><ol>
<a name="83680"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">Haga doble clic en el objeto basado en texto al que desea dar formato, luego haga clic con el bot&#243;n derecho para hacer aparecer el men&#250; contextual.
<a name="83681"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">En el men&#250; contextual, haga clic en <kbd>Insertar desde archivo</kbd>.
<a name="83682"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">En el cuadro de di&#225;logo Abrir, seleccione el archivo en que est&#225; almacenado su objeto basado en texto, luego haga clic en <kbd>Abrir</kbd>.
<p class="indent"><a name="87525"></a>El objeto se importa desde el archivo a su informe, reemplazando el objeto al que seleccion&#243; dar formato en el paso 1.</p></ol>
<a name="87528"></a><h3>Espacios entre objetos base-texto</h3>
<p><a name="83730"></a>Utilice las opciones de cuadr&#237;cula y l&#237;neas gu&#237;a para ayudar a alinear en forma equilibrada los objetos basados en texto.</p><p><a name="83731"></a>Puede seleccionar la opci&#243;n Ajustar a cuadr&#237;cula, establecer la cuadr&#237;cula con un m&#225;ximo de 2,5 cm, y hacer que la cuadr&#237;cula sea visible o invisible en la ficha Dise&#241;o, en la ficha Vista previa o en ambas. Para obtener m&#225;s informaci&#243;n de c&#243;mo trabajar con cuadr&#237;culas, vea <a href="11_format10.html#87563">Utilizacion de la Cuadr&#237;cula</a>.</p><p><a name="87561"></a>Tambi&#233;n puede trabajar sin una cuadr&#237;cula, ubicando objetos donde desee dentro de un informe. Es preferible trabajar en un entorno de modo libre, pero conservando la capacidad de alinear objetos, o bien mover o ajustar el tama&#241;o de &#233;stos como grupo. Puede hacerlo usando l&#237;neas gu&#237;a. Vea <a href="11_format12.html#83854">Uso de l&#237;neas gu&#237;a</a>.</p><a name="87563"></a><h4>Utilizacion de la Cuadr&#237;cula</h4><p><a name="87582"></a>La cuadr&#237;cula es una serie de coordenadas de l&#237;neas y columnas. Cuando se selecciona la cuadr&#237;cula, Seagate Crystal Reports le permite ubicar objetos basados en texto s&#243;lo en estas coordenadas, no entre ellas. Puede espaciar los datos del informe y alinear objetos seg&#250;n sea necesario. Si intenta ubicar un objeto entre coordenadas de cuadr&#237;cula, el objeto se "ajusta autom&#225;ticamente" a la cuadr&#237;cula; es decir, el objeto se desplaza hacia el conjunto de coordenadas de filas o columnas m&#225;s cercano.</p><p><a name="87583"></a>Cada secci&#243;n del informe contiene una cuadr&#237;cula de dise&#241;o. Puede ser activada o desactivada y ajustada a diferentes tama&#241;os seg&#250;n sea la necesidad.</p><p><a name="87584"></a>Una vez establecida, la cuadr&#237;cula permanece del mismo tama&#241;o para todas las secciones. Se mide desde la esquina superior izquierda de cada secci&#243;n y se extiende hacia abajo y hacia la derecha hasta el final de la secci&#243;n. Una nueva cuadr&#237;cula del mismo tama&#241;o comienza desde la esquina superior izquierda de la siguiente secci&#243;n, y contin&#250;a del mismo modo hasta el final del informe.</p><p><a name="83798"></a>Si selecciona la opci&#243;n Ajustar a cuadr&#237;cula, tendr&#225;n lugar las condiciones siguientes:</p><ul type="disc"><a name="87616"></a><li>La esquina superior izquierda de cualquier objeto base<nobr>-t</nobr>exto u objeto OLE que usted ubique, se alinear&#225; a un punto de la cuadr&#237;cula.
<a name="87617"></a><li>Los objetos ubicados antes de activar la opci&#243;n Ajustar a cuadr&#237;cula, no se mover&#225;n al punto de la cuadr&#237;cula m&#225;s cercano, es decir, que permanecer&#225;n donde se encuentren al momento de cambiar la opci&#243;n.
<a name="87618"></a><li>Si ajusta el tama&#241;o de un objeto, el lado (o lados) que est&#225; ajustando se ajustar&#225;n al punto de la cuadr&#237;cula m&#225;s cercana.
</ul>
<hr><br>

<script  language="JavaScript"><!--

var prev = "11_format9.html";
var next = "11_format11.html";

function setTopicID() { 
      var number = "83677"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


