<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Tipos de gr&#225;ficos</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="41970"></a><h3 class="newpage"> Tipos de gr&#225;ficos</h3>
<p><a name="41971"></a>Diferentes conjuntos de datos son particularmente aptos para ciertos tipos de gr&#225;ficos. A continuaci&#243;n hay una vista general de los tipos de gr&#225;ficos principales y sus usos m&#225;s com&#250;nes.</p><a name="41972"></a><h5>Gr&#225;fico de Barras</h5><p><a name="41973"></a>El gr&#225;fico de Barras (tambi&#233;n conocido como gr&#225;fico de Columnas) es una herramienta excelente para presentar o comparar varios conjuntos de datos. Dos gr&#225;ficos de barras muy &#250;tiles son:</p><ul type="disc"><a name="41974"></a><li>Gr&#225;fico de barras Lado a Lado<br>El gr&#225;fico de barras Lado a Lado muestra sus datos como una serie de barras verticales. Este tipo de gr&#225;fico es mejor utilizado para representar los datos de varios conjuntos a trav&#233;s de un per&#237;odo de tiempo (por ejemplo, las figuras de ventas del a&#241;o pasado en CA, AZ, OR y WA).
<a name="41975"></a><li>Gr&#225;fico de barras Apiladas <br>Un gr&#225;fico de barras Apiladas muestra los datos como una serie de barras verticales. Use este tipo de gr&#225;fico para mejor representar tres series de datos, cada una de las cuales es representada por un color apilado en una sola barra (por ejemplo, las ventas de 1994, 1995 y 1996).
</ul><a name="41976"></a><h5>Gr&#225;fico de L&#237;nea</h5><p><a name="41977"></a>Este gr&#225;fico presenta sus datos como una serie de puntos conectados por una l&#237;nea. El gr&#225;fico de l&#237;nea se usa mejor con los datos de un gran n&#250;mero de grupos (por ejemplo, las ventas totales a trav&#233;s de varios a&#241;os pasados).</p><a name="41978"></a><h5>Gr&#225;fico de Area</h5><p><a name="41979"></a>Un gr&#225;fico de &#225;rea muestra sus datos como &#225;reas llenas de colores o dise&#241;os. Use este tipo de gr&#225;fico para representar los datos de un n&#250;mero de grupos limitados (por ejemplo, el porcentaje de las ventas totales de CA, AZ, OR y WA). </p><a name="41980"></a><h5>Gr&#225;fico Circular</h5><p><a name="41981"></a>Un gr&#225;fico circular muestra los datos como un c&#237;rculo dividido en secciones de colores o dise&#241;os. Este tipo de gr&#225;fico se usa solamente con un grupo de datos (por ejemplo, el porcentaje de las ventas para el inventario completo). Tambi&#233;n est&#225; disponible un gr&#225;fico Circular M&#250;ltiple y un gr&#225;fico Circular 3D.</p><a name="41982"></a><h5>Gr&#225;fico de Anillo</h5><p><a name="41983"></a>El gr&#225;fico de Anillo es similar al gr&#225;fico circular y muestra los datos como secciones de un c&#237;rculo o anillo. Si, por ejemplo, usted ha graficado las ventas por regi&#243;n en un informe, ver&#237;a el n&#250;mero total de ventas (la figura) en el centro del anillo, y ver&#237;a las regiones como secciones del anillo en colores. Como con el gr&#225;fico circular, tiene la opci&#243;n de elegir m&#250;ltiples gr&#225;ficos de anillo para m&#250;ltiples grupos de datos.</p><a name="41984"></a><h5>Gr&#225;fico de Ascensi&#243;n 3D</h5><p><a name="41985"></a>Un gr&#225;fico de ascensi&#243;n 3D presenta sus datos en una serie de objetos tresdimensionales, alineados lado a lado, en un plano de tres dimensiones. Este tipo de gr&#225;fico es excelente para mostrar los puntos extremos de los datos en su informe. Por ejemplo, la diferencia de ventas entre pa&#237;ses es visualmente din&#225;mica cuando usted lo representa por medio de este gr&#225;fico.</p><a name="41986"></a><h5>Gr&#225;fico de Superf&#237;cie 3D</h5><p><a name="41987"></a>Este tipo de gr&#225;fico presenta una vista topogr&#225;fica de conjuntos de datos m&#250;ltiples. Si, por ejemplo, usted necesita un gr&#225;fico para mostrar el n&#250;mero de ventas por cliente por pa&#237;s, y lo quiere de manera visualmente din&#225;mica y de formato relacional, podr&#237;a considerar un gr&#225;fico de superf&#237;cie 3D.</p><a name="41988"></a><h5>Gr&#225;fico de Dispersi&#243;n XY</h5><p><a name="41989"></a>El gr&#225;fico de Dispersi&#243;n XY es esencialmente una colecci&#243;n de puntos trazados los cuales representan datos espec&#237;ficos en una fuente de informaci&#243;n. Este gr&#225;fico hace posible que el usuario considere una esfera mayor de datos con el prop&#243;sito de determinar algunas tendencias. Por ejemplo, si usted registra informaci&#243;n sobre clientes, incluyendo ventas, productos, pa&#237;ses, meses y a&#241;os, usted entonces tiene una colecci&#243;n de puntos trazados que representan la fuente de informaci&#243;n de clientes. Poder ver todos estos datos en un gr&#225;fico de dispersi&#243;n XY le permitir&#225; especular por qu&#233; ciertos productos se est&#225;n vendiendo mejores que otros o por qu&#233; ciertas regiones tienen m&#225;s compras que otras.</p><a name="41990"></a><h5>Gr&#225;fico de Radar</h5><p><a name="41991"></a>Este gr&#225;fico coloca los datos de grupo, tales como pa&#237;ses o clientes, en el per&#237;metro del radar. El gr&#225;fico de radar entonces ubica valores n&#250;mericos, aumentando en valor, desde el centro del radar hasta el per&#237;metro. De esta forma, el usuario puede determinar, con solo un vistazo, c&#243;mo los datos de grupo espec&#237;ficos est&#225;n relacionados con todos los datos del grupo.</p><a name="41992"></a><h5>Gr&#225;fico de Burbujas</h5><p><a name="41993"></a>El gr&#225;fico de Burbujas presenta los datos como una serie de burbujas, donde el tama&#241;o de las burbujas est&#225; en proporci&#243;n a la cantidad de datos. Un gr&#225;fico de este tipo ser&#237;a muy efectivo para mostrar el n&#250;mero de productos vendidos en cierta regi&#243;n.</p><a name="41994"></a><h5>Gr&#225;fico de Cotizaciones</h5><p><a name="41995"></a>Este tipo de gr&#225;fico presenta los valores altos y bajos relacionados con unos datos. Por esta capacidad, el gr&#225;fico de cotizaciones es una herramienta excelente para observar las actividades financieras o de ventas.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "12_chart2.html";
var next = "12_chart4.html";

function setTopicID() { 
      var number = "41970"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


