<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Edici&#243;n de gr&#225;ficos en la ficha Analizador</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="43612"></a><h3 class="newpage"> Edici&#243;n de gr&#225;ficos en la ficha Analizador</h3>
<p><a name="42734"></a>Seagate Crystal Reports proporciona una tercera ficha, la ficha Analizador espec&#237;ficamente para gr&#225;ficos y mapas avanzados. Use esta ficha para organizar sus gr&#225;ficos y analizar sus datos con m&#225;s eficiencia. </p><a name="42768"></a><h6>Para lanzar la ficha Analizador</h6><ol>
<a name="42769"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">Desde la ficha <kbd>Dise&#241;o</kbd> o la ficha <kbd>Vista</kbd> <kbd>previa</kbd>, haga clic en el gr&#225;fico con el bot&#243;n derecho del mouse y elija el comando Cambiar bordec en el men&#250; contextual.
<a name="41515"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">En el men&#250; contextual, haga clic en <kbd>Analizador de gr&#225;ficos</kbd>.
<p class="indent"><a name="41516"></a>Seagate Crystal Reports abre la ficha Analizador.</p></ol>
<p><a name="41517"></a>Al ver un gr&#225;fico en la ficha Analizador, puede efectuar las siguientes operaciones usando los comandos del men&#250; contextual:</p><ul type="disc"><a name="41518"></a><li>aplicar zoom a gr&#225;ficos de barras y de l&#237;neas
<a name="41519"></a><li>guardar la plantilla actual en un archivo
<a name="41520"></a><li>aplicar una nueva plantilla al gr&#225;fico
<a name="41521"></a><li>cambiar las especificaciones de plantilla del gr&#225;fico
<a name="41522"></a><li>cambiar los t&#237;tulos de gr&#225;fico
<a name="41523"></a><li>cambiar las escalas y cuadr&#237;culas de ejes num&#233;ricos del gr&#225;fico
<a name="41524"></a><li>efectuar cualquier operaci&#243;n de formato adicional espec&#237;fica del tipo de gr&#225;fico
<a name="42787"></a><li>organizar autom&#225;ticamente la apariencia del gr&#225;fico.
</ul><p><a name="42788"></a>Hay un n&#250;mere de operaciones que usted puede realizar en cualquier elemento gr&#225;fico usando la ficha Analizador, tal como se describe a continuaci&#243;n. Adem&#225;s, el men&#250; contextual tiene varios comandos que son espec&#237;ficamente para gr&#225;ficos. Por ejemplo, en el caso de un gr&#225;fico circular, estos comandos le permiten hacer cambios de tama&#241;o y ajustar su rotaci&#243;n. Si es un gr&#225;fico de barras, puede encontrar comandos para alternar las etiquetas. De esta manera, la ficha Analizador le ofrece la m&#225;xima flexibilidad.</p><p><a name="41544"></a>Con la ficha Analizador se pueden ver hasta dos objetos de gr&#225;fico simult&#225;neamente. En este caso, la ficha Analizador se convierte en una ficha de divisi&#243;n de pantalla y cada gr&#225;fico aparece en una secci&#243;n separada. Para cambiar el tama&#241;o de una secci&#243;n, mueva el cursor sobre el borde de la secci&#243;n hasta que se convierta en el cursor de cambio de tama&#241;o de secci&#243;n y luego arrastre la l&#237;nea de borde para aumentar o reducir su tama&#241;o, en la medida de lo necesario.</p><p><a name="42793"></a>La ficha Analizador tambi&#233;n se puede usar para trabajar con objetos de gr&#225;fico que se hayan colocado en un sub<nobr>-i</nobr>nforme. El programa abre una ficha Analizador separada para cada sub<nobr>-i</nobr>nforme que contenga un objeto de gr&#225;fico que est&#225; analizando. Puede ver hasta dos objetos de gr&#225;fico simult&#225;neamente del mismo subinforme en la ficha Analizador.</p><p><a name="42794"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Los cambios efectuados en la ficha Analizador pertenecen al gr&#225;fico o gr&#225;ficos que est&#225;n actualmente selecciondos. Usted puede tener dos gr&#225;ficos seleccionados en la ficha de an&#225;lisis a la misma vez. Cuando trata de seleccionar un tercer gr&#225;fico y ponerlo en la ficha de an&#225;lisis tendr&#225; que descartar uno de los gr&#225;ficos previamente seleccionados.</p>

<hr><br>

<script  language="JavaScript"><!--

var prev = "12_chart11.html";
var next = "12_chart13.html";

function setTopicID() { 
      var number = "43612"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


