<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Edici&#243;n de mapas en Ficha Analizador</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="78239"></a><h3 class="newpage"> Edici&#243;n de mapas en Ficha Analizador</h3>
<p><a name="78240"></a>Seagate Crystal Reports proporciona una tercera ficha (adem&#225;s de las fichas Dise&#241;o y Vista previa) espec&#237;ficamente para manipulaci&#243;n avanzada de gr&#225;ficos y mapas. Esta es la ficha Analizador. Use esta ficha para organizar sus mapas de manera que le permitan analizar con m&#225;s eficiencia. La ficha Analizador le permite establecer las propiedades de una instancia individual de un mapa, independiente del resto del informe.</p><a name="76562"></a><h6>Para lanzar la ficha Analizador</h6><ol>
<a name="76563"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">En la ficha <kbd>Dise&#241;o</kbd> o <kbd>Vista previa</kbd>, haga clic con el bot&#243;n derecho en el mapa para abrir el men&#250; contextual.
<a name="76564"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">En el men&#250; contextual, haga clic en <kbd>Analizador de mapa</kbd>.
<p class="indent"><a name="76565"></a>Seagate Crystal Reports abre la ficha Analizador.</p></ol>
<p><a name="76566"></a>Al visualizar un mapa en la ficha Analizador, puede efectuar las siguientes operaciones:</p><ul type="disc"><a name="76567"></a><li>zoom y panor&#225;mica del mapa
<a name="76568"></a><li>centrado del mapa
<a name="76569"></a><li>modificaci&#243;n del t&#237;tulo del mapa y establecimiento del estilo general
<a name="76570"></a><li>reorganizaci&#243;n de las capas de elementos del informe (por ejemplo, puede mostrar la capa de ciudades principales sobre la capa de carreteras)
<a name="76571"></a><li>soluci&#243;n de inconsistencias de datos
<a name="76572"></a><li>modificaci&#243;n del mapa geogr&#225;fico
<a name="76573"></a><li>visualizaci&#243;n del navegador del mapa
</ul><p><a name="76574"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Las capacidades de zoom, panor&#225;mica y centrado de la ficha Analizador tambi&#233;n est&#225;n disponibles como comandos contextuales en el navegador del mapa y en la ficha Vista previa (haga clic con el bot&#243;n derecho en el objeto de mapa en la ficha Vista previa). Para m&#225;s informaci&#243;n acerca del navegador del mapa, vea <a href="13_map21.html#78562">Zoom, panor&#225;mica y centrado de mapas con el navegador del mapa</a>.</p>
<p><a name="76578"></a>Con la ficha Analizador se pueden ver hasta dos objetos de mapa simult&#225;neamente. En este caso, la ficha Analizador se convierte en una ficha de divisi&#243;n de pantalla, y cada mapa aparece en una secci&#243;n separada. Para cambiar el tama&#241;o de una secci&#243;n, mueva el cursor sobre el borde de la secci&#243;n hasta que se convierta en un cursor de cambio de tama&#241;o de secci&#243;n y luego arrastre la l&#237;nea del borde para aumentar o reducir el tama&#241;o de la secci&#243;n, seg&#250;n sea necesario.</p><p><a name="76579"></a>La ficha Analizador tambi&#233;n se puede usar para trabajar con objetos de mapa que se hayan colocado en un subinforme. El programa abre una ficha Analizador separada para cada subinforme que contenga un objeto de mapa que est&#233; analizando. Puede visualizar hasta dos objetos de mapa simult&#225;neamente del mismo subinforme en la ficha Analizador.</p><p><a name="76580"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Tambi&#233;n puede cambiar el tama&#241;o de la leyenda, que se muestra a la derecha de cada mapa.</p>
<a name="78273"></a><h3>Cambio del t&#237;tulo del mapa</h3>
<ol>
<a name="76583"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic con el bot&#243;n derecho para abrir el men&#250; contextual.
<a name="76584"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">En el men&#250; contextual, haga clic en <kbd>Cambiar t&#237;tulo del mapa</kbd>.
<a name="76585"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">En el cuadro de di&#225;logo Cambiar t&#237;tulo del mapa, ingrese un nuevo t&#237;tulo.
<a name="76586"></a><li value="4&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en <kbd>Aceptar</kbd> para guardar los cambios.
</ol>
<p><a name="90303"></a>Seagate Crystal Reports vuelve a la ficha Analizador y aplica sus cambios.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "13_map12.html";
var next = "13_map14.html";

function setTopicID() { 
      var number = "78239"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


