<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Uso del Asistente de Seagate Crystal Report para crear un informe en Excel</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="82556"></a><h3 class="newpage"> Uso del Asistente de Seagate Crystal Report para crear un informe en Excel</h3>
<p><a name="82557"></a>El Asistente de Seagate Crystal Reports en Excel ofrece pantallas conocidas de dise&#241;o y selecci&#243;n Crystal para ayudarle a crear un informe a partir de su hoja de c&#225;lculo. Puede seleccionar un rango de celdas o un rango de datos completo en una hoja de c&#225;lculo para usarlo como contenido de su informe.</p><p><a name="85901"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Al crear un informe a partir de una hoja de c&#225;lculo Excel, Seagate Crystal Reports crea un archivo de base de datos (.mdb). Este archivo, el archivo de hoja de c&#225;lculo Excel (.xls) y el archivo del informe (.rpt) no se pueden mover o perder&#225; los v&#237;nculos entre ellos y despu&#233;s no podr&#225; actualizar los datos de su informe.</p>
<a name="82994"></a><h6>Para crear un informe en Excel mediante el Asistente de Seagate Crystal Report</h6><ol>
<a name="83021"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/bt_addin_Excel.gif">


En el men&#250; <kbd>Herramientas</kbd> de Excel, elija <kbd>Asistente de Seagate Crystal Report</kbd>.
<p class="indent"><a name="83037"></a>Si la hoja de c&#225;lculo contiene datos no guardados, Excel le advierte que debe guardarlos antes de ejecutar el asistente.</p><p><a name="87780"></a> <img src="images/db_CRWizard_Excel1.gif">


</p>
<a name="87841"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">Ingrese un rango de datos en el cuadro de<kbd> </kbd>rango de celda, o haga clic en su bot&#243;n para elegir un rango directamente de la hoja de c&#225;lculo.
<p class="indent"><a name="83046"></a>Al hacer clic en el bot&#243;n el asistente se minimiza de modo que puede hacer clic y arrastrar para seleccionar un rango de datos. Para volver al asistente, haga clic en el bot&#243;n del asistente minimizado.</p><p class="indent"><a name="83060"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Para seleccionar un rango completo de datos de la hoja de c&#225;lculo, haga clic en <EM>Expandir autom&#225;ticamente el rango</EM>.</p>
<a name="83053"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">Cuando tenga seleccionado un rango de datos, haga clic en <kbd>Crear un informe Crystal</kbd>.
<p class="indent"><a name="87882"></a>Aparece el Asistente de Seagate Crystal Report.</p><p><a name="86067"></a> <img src="images/db_CRWizard.gif">


</p>
<p class="indent"><a name="85938"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Mientras dise&#241;a su informe, el programa crea un archivo de base de datos (.mdb). El archivo de base de datos, el archivo de hoja de c&#225;lculo (.xls), y el archivo del informe (.rpt) no se pueden mover o despu&#233;s no podr&#225; actualizar los datos de su informe.</p>
<a name="83099"></a><li value="4&nbsp;&nbsp;&nbsp;&nbsp;">Agregue los campos de la base de datos que Ud. desee ver en su informe a la lista <kbd>Mostrar campos </kbd>.
<p class="indent"><a name="83103"></a>Los botones de flecha en este cuadro de di&#225;logo le permiten mover campos de una lista a la otra. Una flecha mueve s&#243;lo el campo seleccionado, la flecha doble mueve todos los campos al mismo tiempo.</p><a name="83111"></a><li value="5&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en <kbd>Siguiente</kbd> para elegir qu&#233; campos desea agrupar.
<a name="83122"></a><li value="6&nbsp;&nbsp;&nbsp;&nbsp;">Agregue los campos de la base de datos que desea agrupar en el cuadro <kbd>Agrupar por</kbd>.
<p class="indent"><a name="83126"></a>Cuando selecciona un campo de grupo, puede elegir un orden en el cuadro Orden.</p><a name="83133"></a><li value="7&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en <kbd>Siguiente</kbd> para elegir qu&#233; campos desea resumir.
<a name="83140"></a><li value="8&nbsp;&nbsp;&nbsp;&nbsp;">Agregue los campos de la base de datos que desea totalizar en la lista <kbd>Campos resumidos</kbd>.
<p class="indent"><a name="83144"></a>Los campos resumidos se aplican al grupo especificado en el cuadro Para el grupo. Puede usar los mismos campos en cada uno de los numerosos grupos.</p><p class="indent"><a name="83151"></a>Cuando selecciona un campo de resumen, puede elegir un tipo de resumen para &#233;ste y agregar un total general.</p><a name="87897"></a><li value="9&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en <kbd>Siguiente</kbd> para ordenar los grupos seg&#250;n sus totales resumidos.
<p class="indent"><a name="87904"></a>Puede seleccionar Ordenar todos los grupos, o bien puede especificar un <br>N Superior o N Inferior.</p><a name="83162"></a><li value="10&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en <kbd>Siguiente</kbd> para crear una selecci&#243;n de registros para su informe.
<a name="83166"></a><li value="11&nbsp;&nbsp;&nbsp;&nbsp;">Agregue los campos de la base de datos que va a usar para filtrar su informe a la lista <kbd>Campos filtrados</kbd>.
<p class="indent"><a name="83175"></a>Defina su selecci&#243;n de registros eligiendo en el cuadro de operadores limitantes e ingresando el valor de campo adecuado.</p><a name="83184"></a><li value="12&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en <kbd>Siguiente</kbd> para seleccionar un estilo de informe.
<a name="83191"></a><li value="13&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en <kbd>Siguiente</kbd> para ingresar un t&#237;tulo y una ubicaci&#243;n para guardar su informe.
<a name="83197"></a><li value="14&nbsp;&nbsp;&nbsp;&nbsp;">Elija un m&#233;todo para obtener una vista previa de su informe.
<p class="indent"><a name="85315"></a>Existen cuatro opciones:</p><ul type="disc"><ul type="disc"><a name="85316"></a><li>Vista previa (s&#243;lo lectura)<a name="85321"></a><li>Editar con Seagate Crystal Report Designer<a name="85325"></a><li>Analizar con Seagate Analysis<a name="87919"></a><li>Ver despu&#233;s</ul></ul><p class="indent"><a name="85326"></a>La opci&#243;n Vista previa abre el informe en el visor ActiveX. Puede ver, imprimir y actualizar el informe en el visor.</p><p class="indent"><a name="85331"></a>Las opciones Editar y Analizar abren el informe en el programa apropiado. Puede ver, imprimir, actualizar y modificar el informe mientras utiliza todas las capacidades de Seagate Crystal Reports o Seagate Analysis.</p><p class="indent"><a name="87924"></a>La opci&#243;n Ver despu&#233;s guarda el informe con el nombre que le dio en el directorio especificado.</p></ol>
<p><a name="83244"></a>Ahora que su informe se ha creado, puede usarlo y modificarlo como lo har&#237;a con cualquier otro informe en Seagate Crystal Reports. Permanece vinculado a su hoja de c&#225;lculo Excel de modo que si Ud. actualiza el informe despu&#233;s de alterar la hoja de c&#225;lculo, lo que se muestra son sus datos cambiados (vea <a href="18_addins3.html#82536">Acerca del complemento Microsoft Excel</a>).</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "18_addins5.html";
var next = "18_addins7.html";

function setTopicID() { 
      var number = "82556"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


