<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Mensajes de error y advertencias del compilador de f&#243;rmulas</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="315904"></a><h2 class="newpage">Mensajes de error y advertencias del compilador de f&#243;rmulas</h2><a name="315913"></a><h5>Falta un ).</h5><p><a name="315914"></a>Los par&#233;ntesis deben ser usados en pares, cada par&#233;ntesis de apertura debe coincidir con un par&#233;ntesis de cierre. Uno de los par&#233;ntesis de apertura no tiene el correspondiente par&#233;ntesis de cierre. Inserte el par&#233;ntesis faltante y revise nuevamente.</p><a name="315915"></a><h5>Falta un  ].</h5><p><a name="315916"></a>Los corchetes deben ser usados en pares, cada corchete de apertura debe coincidir con un corchete de cierre. Uno de los corchetes de apertura no tiene el correspondiente corchete de cierre. Inserte el corchete faltante y revise nuevamente.</p><a name="315917"></a><h5>No se permite una variable de rango Booleano.</h5><p><a name="315918"></a>Usted ha introducido una variable de rango Booleano. Las variables de rango pueden ser introducidas en todo tipo de datos excepto en datos Booleanos. Cambie el tipo de datos a alguna otra cosa que no sea Booleano, o introduzca un elemento Booleano variable para reemplazar la variable de rango Booleano.</p><a name="315919"></a><h5>Acceso Denegado.</h5><p><a name="315920"></a>DOS no permite el acceso al archivo especificado. Aseg&#250;rese que el archivo no est&#233; siendo usado por otro programa (u otro usuario en la red), y/o aseg&#250;rese que tiene la debida autorizaci&#243;n de red e intente nuevamente.</p><a name="315921"></a><h5>Un n&#250;mero de d&#237;a debe estar entre 1 y el n&#250;mero de d&#237;as en el mes.</h5><p><a name="315922"></a>Usted ha escrito un n&#250;mero de d&#237;a que no concuerda con el mes. El verificador de f&#243;rmula despliega esta advertencia si, para el mes de enero, por ejemplo, usted escribe un n&#250;mero de d&#237;a cero (0) o un n&#250;mero 32 o mayor. Cambie el n&#250;mero de d&#237;a y revise nuevamente.</p><a name="315923"></a><h5>En esta posici&#243;n se requiere un campo.</h5><p><a name="315924"></a>Usted ha introducido en su f&#243;rmula algo que no es un campo en una posici&#243;n donde debe ir un campo. Corrija el problema y revise nuevamente.</p><a name="315925"></a><h5>Una f&#243;rmula no puede referirse a si misma, ya sea directa o indirectamente.</h5><p><a name="315926"></a>No puede introducir una f&#243;rmula que se refiere a si misma. Por ejemplo, al crear la f&#243;rmula @Profit, no puede usar @Profit como el argumento a una funci&#243;n. Quite esa referencia y revise nuevamente.</p><a name="315927"></a><h5>Se necesita un funci&#243;n.</h5><p><a name="315928"></a>El Editor de F&#243;rmula est&#225; esperando una funci&#243;n pero ninguna a sido introducida. Revise la f&#243;rmula e introduzca la funci&#243;n requerida o corrija la f&#243;rmula si es que est&#225; equivocada.</p><a name="315929"></a><h5>No se puede usar un campo memo en una f&#243;rmula.</h5><p><a name="315930"></a>Usted ha escogido un campo memo para usar en la f&#243;rmula. El uso de campos memo no est&#225; permitido en f&#243;rmulas. Quite el campo memo de la f&#243;rmula e intente nuevamente.</p><a name="315931"></a><h5>Un n&#250;mero de mes debe estar entre 1 y 12.</h5><p><a name="315932"></a>Usted ha escrito un n&#250;mero de mes que est&#225; fuera del rango permitido. Introduzca un n&#250;mero de mes entre 1 y 12 y revise nuevamente.</p><a name="315933"></a><h5>Una cadena no puede contener m&#225;s de 254 caracteres.</h5><p><a name="315934"></a>El programa permite cadenas de no m&#225;s de 254 caracteres en las f&#243;rmulas. Usted ha introducido una cadena que excede ese l&#237;mite. Reduzca el largo de la cadena y revise nuevamente. </p><a name="315935"></a><h5>Un sub&#237;ndice debe ser entre 1 y el largo de la cadena.</h5><p><a name="315936"></a>Usted ha introducido un n&#250;mero de sub&#237;ndice que especifica un car&#225;cter que no existe. Usted recibir&#225; esta advertencia si, por ejemplo, introduce un sub&#237;ndice que hace referencia al 6&#176; u 8&#176; car&#225;cter en una cadena de cinco caracteres. Cambie el sub&#237;ndice a un valor existente y revise nuevamente. </p><a name="315937"></a><h5>Un sub&#237;ndice debe ser entre 1 y el tama&#241;o de la matriz.</h5><p><a name="315938"></a>Usted ha introducido un n&#250;mero de sub&#237;ndice que especifica un elemento de matriz que no existe. Si introduce un sub&#237;ndice que hace referencia al 6&#176; u 8&#176; elemento en una matriz de cinco elementos, por ejemplo, recibir&#225; esta advertencia. Cambie el sub&#237;ndice a un valor existente y revise nuevamente.</p><a name="315939"></a><h5>Todas las licencias de la red est&#225;n en uso. Usted podr&#225; ejecutar su programa una vez que otro de los usuarios haya terminado. Para incrementar el n&#250;mero de copias autorizadas en su red, comun&#237;quese con Seagate Software, Information Management Group al (604) 681-3435 y pregunte acerca de Network LanPaks.</h5><p><a name="315940"></a>Su licencia especifica el m&#225;ximo n&#250;mero de usuarios que pueden usar el programa en la red al mismo tiempo. El m&#225;ximo n&#250;mero de usuarios est&#225; usando el programa en este momento. Usted puede incrementar el n&#250;mero de usuarios autorizados en el sistema al mismo tiempo, comprando m&#225;s Network LanPaks a trav&#233;s de Seagate Software, Information Management Group.</p><a name="315941"></a><h5>No puede usar una condici&#243;n de subtotal.</h5><p><a name="315942"></a>Usted ha introducido una condici&#243;n de subtotal para un subtotal que usa algo diferente a un campo de fecha o campo Booleano como el campo de ordenar y agrupar. Este subtotal no requiere una condici&#243;n. Elimine la condici&#243;n y contin&#250;e.</p><a name="315943"></a><h5>Una condici&#243;n de subtotal debe ser una cadena.</h5><p><a name="315944"></a>Usted ha introducido una condici&#243;n de subtotal que no est&#225; en un formato de cadena. Aseg&#250;rese de que cuando introduzca una condici&#243;n en la f&#243;rmula est&#233; encerrada entre comillas simples o dobles.</p><a name="315945"></a><h5>Una variable no puede ser declarada nuevamente con un tipo de datos diferente.</h5><p><a name="315946"></a>Usted ha declarado una variable con el mismo nombre pero con un tipo de datos diferente a una variable ya declarada. Esto no se puede hacer. Cambie el nombre de la variable o cambie el tipo de datos para que sea igual al tipo de datos original.</p><a name="315947"></a><h5>Se necesita una variable.</h5><p><a name="315948"></a>Usted ha usado el operador de asignaci&#243;n <strong>(=:)</strong> en una f&#243;rmula sin estar precedida por una variable. El programa necesita una variable inmediatamente antes del operador de asignaci&#243;n (a su izquierda). Introduzca una variable e intente nuevamente.</p><a name="315949"></a><h5>Necesita un nombre para la variable.</h5><p><a name="315950"></a>Usted ha declarado un tipo de datos de variable sin establecer un nombre para esa variable. Debe incluir un nombre de variable para poder completar el enunciado. Introduzca un nombre para la variable y contin&#250;e. </p><a name="315951"></a><h5>La fecha debe ser entre los a&#241;os 1 y 9999.</h5><p><a name="315952"></a>Usted ha introducido una fecha que est&#225; fuera del rango permitido. Escriba una fecha que est&#233; en el rango de los a&#241;os 1 y 9999 (incluyendo los valores finales) y revise nuevamente.</p><a name="315953"></a><h5>No se puede asignar memoria.</h5><p><a name="315954"></a>Por lo general, este mensaje aparece cuando no hay suficiente memoria disponible. Cierre los informes que no necesita, y salga de los programas que no est&#225; usando en este momento. Luego intente nuevamente.</p><a name="315955"></a><h5>No se puede reasignar memoria.</h5><p><a name="315956"></a>Por lo general, este mensaje aparece cuando no hay suficiente memoria disponible. Cierre los informes que no necesita, y salga de los programas que no est&#225; usando en este momento. Luego intente nuevamente.</p><a name="315957"></a><h5>Disco lleno.</h5><p><a name="315958"></a>Usted ha intentado guardar el informe en un disco que est&#225; lleno. Guarde el informe en un disco diferente, o elimine los archivos innecesarios en el disco que tiene e intente nuevamente.</p><a name="315959"></a><h5>Divisi&#243;n por cero.</h5><p><a name="315960"></a>Usted ha introducido una f&#243;rmula que trata de dividir por cero. El programa no permite esta divisi&#243;n. Edite la f&#243;rmula para que esto no ocurra y luego revise nuevamente.</p><p><a name="315961"></a>Si quiere evitar este tipo de problema, puede usar una prueba como esta:</p><PRE><a name="315962"></a>If {archivo.PRONOSTICO} = 0 Then<br>
0<br>
Else<br>
{archivo.VENTAS} / {archivo.PRONOSTICO}
</PRE><a name="315963"></a><h5>Error en el c&#243;digo de f&#243;rmula. Por favor comun&#237;quese con Seagate Software, Information Management Group.</h5><p><a name="315964"></a>Existe algo inusual en esta f&#243;rmula que no hab&#237;a sido previsto. Por favor guarde el texto de la f&#243;rmula que produjo esta advertencia y contacte la compa&#241;&#237;a. </p><a name="315965"></a><h5>Error en el &#225;rbol de an&#225;lisis. Por favor comun&#237;quese con Seagate Software, Information Management Group.</h5><p><a name="315966"></a>Al analizar su f&#243;rmula, el programa encontr&#243; una situaci&#243;n que el &#225;rbol de an&#225;lisis no puede procesar. Por favor guarde el texto de la f&#243;rmula que produjo esta advertencia y contacte la compa&#241;&#237;a.</p><a name="315967"></a><h5>Este campo todav&#237;a est&#225; en uso.</h5><p><a name="315968"></a>El campo que usted a solicitado est&#225; en uso. Intente nuevamente una vez que el campo est&#233; disponible.</p><a name="315969"></a><h5>Ya ha utilizado este nombre de archivo. Cierre la ventana de xxx antes de guardar utilizando este nombre.</h5><p><a name="315970"></a>Usted ha intentado guardar un archivo con un nombre que ya ha utilizado en un informe abierto. Cierre ese informe primero, y luego intente nuevamente.</p><a name="315971"></a><h5>Ese archivo no existe.</h5><p><a name="315972"></a>No se pudo encontrar el nombre de archivo especificado. El nombre de archivo o la ruta de acceso podr&#237;a estar equivocada. Introduzca el nombre o la ruta de acceso correcta e intente nuevamente. En algunos casos el archivo WBTRVDEF.DLL no existe en su diccionario. Este archivo es necesario para leer archivos en Data Dictionary (Diccionario de Datos) junto con WBTRCALL.DLL.</p><a name="315973"></a><h5>Error de permiso de archivo.</h5><p><a name="315974"></a>Usted ha solicitado un archivo para el cual no tiene el debido permiso. Debe obtener la autorizaci&#243;n necesaria antes de activar este archivo.</p><a name="315975"></a><h5>Instalaci&#243;n incorrecta de Borland Custom Control DLL (BWCC.DLL). Necesita la Versi&#243;n m.n o m&#225;s reciente.</h5><p><a name="315976"></a>Este programa est&#225; usando una versi&#243;n de BWCC.DLL que es demasiada antigua para que el programa opere adecuadamente. Esto puede suceder cuando:</p><p><a name="315977"></a>BWCC.DLL es instalado en el directorio CRW (el mismo directorio en donde reside CRW.EXE o CRW32.EXE) durante la instalaci&#243;n del programa.</p><p><a name="315978"></a>El directorio CRW es agregado al final del enunciado de ruta de acceso en AUTOEXEC.BAT durante la instalaci&#243;n (si usted permiti&#243; que la instalaci&#243;n del programa actualice el enunciado de la ruta de acceso).</p><p><a name="315979"></a>Si una versi&#243;n m&#225;s antigua de BWCC.DLL ha sido instalado en el directorio de Windows, el directorio de Windows System, o un directorio que aparece antes que el directorio de CRW en la ruta de acceso (como resultado de una instalaci&#243;n anterior), el programa utiliza esa versi&#243;n, no la versi&#243;n m&#225;s reciente en el directorio de CRW.</p><a name="315980"></a><h6>Para corregir este problema</h6><p><a name="315981"></a>La versi&#243;n correcta de BWCC.DLL es enviada con Crystal Report Designer. Para corregir el problema, elimine las versiones anteriores de BWCC.DLL en los directorios anteriores a CRW en la ruta de acceso.</p><p><a name="315982"></a>Si esto no resuelve el problema, mueva la versi&#243;n m&#225;s reciente de BWCC.DLL del directorio CRW al directorio de Windows.</p><a name="315983"></a><h5>Error interno: fallo PrintDlg: 4100.</h5><p><a name="315984"></a>No hay un controlador de impresora instalado en el Panel de Control de Windows. Cuando Crystal Report Designer abre un informe, busca la impresora que fue guardada con el informe. Si no puede encontrar esa impresora, busca la impresora predeterminada. Si no hay una impresora predeterminada configurada, aparece este mensaje de error. </p><a name="315985"></a><h5>Memoria insuficiente.</h5><p><a name="315986"></a>No hay suficiente memoria para hacer lo que usted quiere que el programa haga. Libere memoria e intente nuevamente.</p><a name="315987"></a><h5>Versi&#243;n DOS inv&#225;lida.</h5><p><a name="315988"></a>Usted est&#225; usando una versi&#243;n de DOS anterior a la versi&#243;n 3.0. Instale la versi&#243;n DOS 3.0 o m&#225;s reciente e intente nuevamente.</p><a name="315989"></a><h5>Controlador de archivo inv&#225;lido.</h5><p><a name="315990"></a>Usted ha especificado un controlador de archivo que no existe. Introduzca el controlador correcto y contin&#250;e.</p><a name="315991"></a><h5>No ha seleccionado una impresora predeterminada. Puede usar el Panel de Control para seleccionar la impresora.</h5><p><a name="315992"></a>Por favor use el Panel de Control para seleccionar una impresora y comience el programa nuevamente.</p><p><a name="315993"></a>No puede comenzar a usar el programa a menos que tenga una impresora predeterminada. Tratar de comenzar el programa sin una impresora predeterminada resulta en recibir este mensaje de error.</p><a name="315994"></a><h6>Para seleccionar una impresora predeterminada:</h6><p><a name="315995"></a>Haga clic en el icono de Impresoras en el Panel de Control de Windows; el cuadro de di&#225;logo Panel aparecer&#225; con todas las impresoras instaladas listadas en el cuadro Impresoras instaladas.</p><p><a name="315996"></a>Si todav&#237;a no ha instalado la impresora, inst&#225;lela primero, y luego haga doble clic en esta lista.</p><p><a name="316194"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font></p>
<ul type="disc"><a name="316199"></a><li>Una impresora debe estar Activa antes que pueda ser seleccionada como la impresora predeterminada
<a name="316204"></a><li>Para mayor informaci&#243;n sobre instalaci&#243;n de impresoras e impresoras predeterminadas, refi&#233;rase a la documentaci&#243;n que vino con Microsoft Windows.
</ul><a name="316013"></a><h5>&nbsp;&nbsp;&nbsp;&nbsp;Error en la referencia a la tabla: nombre de tabla.</h5><p><a name="316014"></a>Por lo general esto sucede cuando una tabla tiene un nombre que contiene un gui&#243;n de subrayar (_) o tiene m&#225;s de 15 caracteres, o comienza con un n&#250;mero.</p><a name="316015"></a><h5>La funci&#243;n no tiene suficientes argumentos.</h5><p><a name="316016"></a>La funci&#243;n necesita m&#225;s argumentos de los que usted a puesto. Escriba los argumentos que le faltan y revise nuevamente.</p><a name="316017"></a><h5>No hay suficiente memoria.</h5><p><a name="316018"></a>No hay suficiente memoria disponible para procesar este comando. cierre los informes que no necesita, y salga de los programas que no est&#225; usando en este momento. Luego intente nuevamente.</p><a name="316019"></a><h5>Desbordamiento num&#233;rico.</h5><p><a name="316020"></a>El resultado intermedio o el resultado final no puede ser representado porque el n&#250;mero es demasiado grande. Reestructure o subdivida la f&#243;rmula para crear resultados m&#225;s peque&#241;os y luego revise nuevamente.</p><a name="316021"></a><h5>No se pudo encontrar la base de datos f&#237;sica.</h5><p><a name="316022"></a>El programa no puede ubicar la base de datos o DLL. Aseg&#250;rese que los directorios que contienen esos archivos est&#225;n en la lista del enunciado de ruta de acceso.</p><a name="316023"></a><h5>Por favor cancele la impresi&#243;n antes de cerrar.</h5><p><a name="316024"></a>Su procesador de informes est&#225; tratando de cerrar una tarea antes de que haya terminado. Aseg&#250;rese de cancelar la impresi&#243;n antes de cerrar la tarea de impresi&#243;n.</p><a name="316025"></a><h5>La impresora no est&#225; disponible.</h5><p><a name="316026"></a>Hay un problema al conectar a la impresora seleccionada. Seleccione otra vez la impresora en el Panel de Control de Windows e intente nuevamente.</p><a name="316027"></a><h5>El archivo de informe ya existe. &#191;Desea sobrescribir <EM>sample.rpt</EM>?</h5><p><a name="316028"></a>Usted est&#225; intentando guardar un informe con el mismo nombre que otro informe ya existente. Esto har&#225; que el informe existente sea sobrescrito y que nunca m&#225;s pueda usarlo. Haga clic en S&#237;, si desea sobrescribir el informe, No para parar el proceso de guardar y poder escoger un nombre diferente.</p><a name="316029"></a><h5>El informe ha cambiado<br>&#191;Desea guardar los cambios en <EM>sample.rpt</EM> antes de cerrar?</h5><p><a name="316030"></a>Usted est&#225; intentando cerrar un informe sin antes guardarlo, a&#250;n cuando a hecho cambios en el informe. Los cambios se perder&#225;n a menos que guarde el informe antes de cerrarlo. Haga clic en S&#237; para guardar los cambios, en No para cerrar el informe sin guardar los cambios.</p><a name="316031"></a><h5>Este elemento todav&#237;a no est&#225; puesto en uso. Pruebe otra vez m&#225;s adelante.</h5><p><a name="316032"></a>Usted ha intentado utilizar un elemento que no est&#225; en uso en la edici&#243;n presente del programa. Espere hasta obtener una versi&#243;n m&#225;s reciente que utilice esta funci&#243;n o elemento e intente nuevamente.</p><a name="316033"></a><h5>No se puede evaluar la f&#243;rmula a la hora especificada.</h5><a name="316034"></a><h5>Este campo no puede ser usado porque debe ser evaluado m&#225;s tarde.</h5><a name="316035"></a><h5>Esta f&#243;rmula no puede ser usada porque debe ser evaluada m&#225;s tarde.</h5><a name="316036"></a><h5>Esta funci&#243;n no puede ser usada porque debe ser evaluada m&#225;s tarde.</h5><p><a name="316037"></a>Usted est&#225; tratando de forzar una evaluaci&#243;n en el campo, f&#243;rmula, o funci&#243;n antes de lo previsto. Funciones de tiempo de evaluaci&#243;n s&#243;lo pueden forzar una evaluaci&#243;n posterior, nunca una m&#225;s temprana. Cambie la f&#243;rmula para que se adapte al tiempo de evaluaci&#243;n requerido.</p><a name="316038"></a><h5>La f&#243;rmula es demasiado compleja. Trate de simplificarla.</h5><p><a name="316039"></a>La f&#243;rmula no pudo ser evaluada porque excede el m&#225;ximo n&#250;mero de 50 operaciones pendientes. Operaciones pendientes son aquellas operaciones que est&#225;n en espera debido al orden de reglas de precedencia; ser&#225;n ejecutadas una vez que las operaciones con un nivel m&#225;s alto de precedencia hayan terminado.</p><p><a name="316040"></a>A veces es posible componer la f&#243;rmula para que calcule los mismos valores sin requerir tantas operaciones pendientes. Como un ejemplo muy simple, en la f&#243;rmula 2+3*4, la suma no puede realizarse hasta que la multiplicaci&#243;n no sea hecha. Por lo tanto la suma queda pendiente, esperando hasta que la multiplicaci&#243;n haya terminado. Sin embargo, si escribiera la f&#243;rmula de esta manera, 3*4+2, las operaciones pueden realizarse de izquierda a derecha con el mismo resultado, pero eliminando la operaci&#243;n pendiente.</p><p><a name="316041"></a>Corrija la f&#243;rmula y rev&#237;sela nuevamente.</p><a name="316042"></a><h5>Falta la segunda llave } para este nombre de campo.</h5><p><a name="316043"></a>Los nombres de campos deben estar encerrados con llaves { }. Usted ha escrito una de las llaves pero no la otra. Inserte la llave faltante y revise nuevamente.</p><a name="316044"></a><h5>Falta la segunda comilla ' en esta cadena.</h5><p><a name="316045"></a>Una cadena que comienza con una comilla ' debe terminar con una comilla ' antes del final de la l&#237;nea. Usted ha usado una comilla ' en una de las posiciones pero no la otra. Inserte la comilla faltante y revise nuevamente.</p><a name="316046"></a><h5>Falta la segunda comilla " en esta cadena.</h5><p><a name="316047"></a>Una cadena que comienza con una comilla" debe terminar con una comilla " antes del final de la l&#237;nea. Usted ha usado una comilla " en una de las posiciones pero no la otra. Inserte la comilla faltante y revise nuevamente.</p><a name="316048"></a><h5>El n&#250;mero de copias de la cadena es demasiado larga o no es un n&#250;mero entero.</h5><p><a name="316049"></a>Usando la funci&#243;n ReplicateString, usted a solicitado demasiadas copias o ha solicitado un n&#250;mero fragmentario de copias. Reduzca el n&#250;mero de copias que est&#225; solicitando o especifique un n&#250;mero entero de copias e intente nuevamente.</p><a name="316050"></a><h5>El n&#250;mero de d&#237;as es demasiado grande o no es un n&#250;mero entero.</h5><p><a name="316051"></a>Cuando agrega d&#237;as a sus fechas, o sustrae d&#237;as de las fechas, s&#243;lo puede usar n&#250;meros enteros de d&#237;as; no puede agregar o sustraer n&#250;meros fragmentarios de d&#237;as (1/2 d&#237;as, 3.6 d&#237;as, etc.). Adem&#225;s, una vez que ha agregado o sustra&#237;do d&#237;as de la fecha, la fecha resultante debe caer dentro del rango de fecha (a&#241;o) permisible, 0000-9999. Si introduce un n&#250;mero fragmentario o si el resultado cae fuera del rango permisible, el Editor de F&#243;rmula muestra esta advertencia. Corrija el problema y revise nuevamente.</p><a name="316052"></a><h5>El n&#250;mero de lugares decimales es muy grande o no es un n&#250;mero entero.</h5><p><a name="316053"></a>El segundo argumento de las funciones Round(x, # de lugares) o ToText(x, # de lugares) debe ser un n&#250;mero entero m&#225;s peque&#241;o. Usted ha introducido un n&#250;mero como segundo argumento (# de lugares) que especifica demasiados lugares decimales o que no es un n&#250;mero entero. Cambie el n&#250;mero a un entero m&#225;s peque&#241;o y revise nuevamente.</p><a name="316054"></a><h5>La selecci&#243;n de f&#243;rmula de registro no puede incluir 'PageNumber', 'RecordNumber', 'GroupNumber', 'Previous', o 'Next'.</h5><p><a name="316055"></a>No puede incluir los campos PageNumber, RecordNumber, GroupNumber, Previous, o Next en selecci&#243;n de f&#243;rmulas de registro. Elimine los campos y revise nuevamente.</p><a name="316056"></a><h5>La selecci&#243;n de f&#243;rmulas de registro no puede incluir un campo de resumen.</h5><p><a name="316057"></a>Usted ha incluido un campo de resumen en una selecci&#243;n de f&#243;rmula de registro. El programa no permite esto. Elimine el campo de resumen y revise nuevamente.</p><a name="316058"></a><h5>El resto del texto no parece ser parte de la f&#243;rmula.</h5><p><a name="316059"></a>Usted ha incluido una f&#243;rmula operando (el elemento en que la operaci&#243;n de la f&#243;rmula se lleva a cabo) donde no se esperaba. Por lo general esto significa que usted se olvid&#243; de colocar un operador, o una parte anterior de una funci&#243;n, o un elemento de sintaxis requerido. Corrija el error y luego revise nuevamente.</p><a name="316060"></a><h5>El resultado de una f&#243;rmula no puede ser un rango.</h5><p><a name="316061"></a>Usted a creado una f&#243;rmula que resulta en un rango. Una f&#243;rmula debe resultar en un solo valor. Corrija la f&#243;rmula y revise nuevamente.</p><a name="316062"></a><h5>El resultado de una f&#243;rmula no puede ser una matriz.</h5><p><a name="316063"></a>Usted a creado una f&#243;rmula que resulta en una matriz. Una f&#243;rmula debe resultar en un solo valor. Corrija la f&#243;rmula y revise nuevamente.</p><a name="316064"></a><h5>El resultado de una selecci&#243;n de f&#243;rmula debe ser un Booleano.</h5><p><a name="316065"></a>Usted ha creado una selecci&#243;n de f&#243;rmula que retorna un valor que no es Booleano. Reestructure la f&#243;rmula usando un operador de comparaci&#243;n (=, etc.) y revise nuevamente.</p><a name="316066"></a><h5>La cadena no es num&#233;rica.</h5><p><a name="316067"></a>El argumento a la funci&#243;n ToNumber debe ser un n&#250;mero almacenado como una cadena (por ejemplo, un n&#250;mero de cliente, n&#250;mero de Identificaci&#243;n, etc.). La cadena puede estar precedida por un signo menos y puede contener espacios en blanco a la izquierda y a la derecha. Usted ha usado un argumento que no es num&#233;rico y por lo tanto no puede ser convertido a un n&#250;mero. Cambie el argumento a num&#233;rico y revise nuevamente.</p><a name="316068"></a><h5>La variable no pudo ser creada.</h5><p><a name="316069"></a>La variable que usted declar&#243; no pudo ser creada. Verifique la ortograf&#237;a y la sintaxis de su declaraci&#243;n e intente nuevamente.</p><a name="316070"></a><h5>Falta la palabra 'Else'.</h5><p><a name="316071"></a>En un enunciado If<nobr>-T</nobr>hen<nobr>-E</nobr>lse, usted a dejado afuera (o puesto en un lugar diferente) el componente 'Else' y la f&#243;rmula no funcionar&#225;. Inserte (o coloque correctamente) el componente 'Else' y revise nuevamente.</p><a name="316072"></a><h5>Falta la palabra 'Then'.</h5><p><a name="316073"></a>En un enunciado If<nobr>-T</nobr>hen<nobr>-E</nobr>lse, usted a dejado afuera (o puesto en un lugar diferente) el componente 'Then' y la f&#243;rmula no funcionar&#225;. Inserte (o coloque correctamente) el componente 'Then' y revise nuevamente.</p><a name="316074"></a><h5>Hay demasiados caracteres en este nombre de campo.</h5><p><a name="316075"></a>Un nombre de campo puede tener como m&#225;ximo 254 caracteres. Usted ha introducido un nombre que excede ese n&#250;mero. Escriba un nombre de campo que tenga un n&#250;mero de caracteres permisible e intente nuevamente.</p><a name="316076"></a><h5>Hay demasiados caracteres en esta cadena.</h5><p><a name="316077"></a>Las cadenas en f&#243;rmulas solo pueden contener 200 caracteres o menos. Usted a introducido una cadena que excede ese n&#250;mero. Reduzca la longitud de la cadena ( o div&#237;dala en 2 o m&#225;s cadenas concatenadas) y revise nuevamente.</p><a name="316078"></a><h5>Hay demasiados d&#237;gitos en este n&#250;mero.</h5><p><a name="316079"></a>Los n&#250;meros en f&#243;rmulas solo pueden contener 25 d&#237;gitos o menos antes del punto decimal. Usted ha introducido un n&#250;mero que excede ese l&#237;mite. Reduzca el n&#250;mero ( o div&#237;dalo en 2 o m&#225;s n&#250;meros peque&#241;os) y revise nuevamente. </p><a name="316080"></a><h5>Hay demasiadas letras y d&#237;gitos en este nombre.</h5><p><a name="316081"></a>Un nombre de variable solo puede contener 254 caracteres. Usted ha introducido un nombre que excede ese n&#250;mero. Escriba un nombre m&#225;s corto y contin&#250;e. </p><a name="316082"></a><h5>Hay un error en esta f&#243;rmula. Edite la f&#243;rmula para ver todos los detalles.</h5><p><a name="316083"></a>Usted ha intentado aceptar una f&#243;rmula (por medio del bot&#243;n Aceptar en el Editor de F&#243;rmula) que contiene un error no corregido. Corrija el error indicado e intente nuevamente.</p><a name="316084"></a><h5>Debe haber una secci&#243;n de subtotal que coincida con este campo.</h5><p><a name="316085"></a>Usted ha introducido un subtotal en la f&#243;rmula sin haber un correspondiente subtotal en el informe. Cualquier subtotal que usted incluya en la f&#243;rmula debe reflejar un subtotal existente en el informe. Agregue primero el subtotal requerido en el informe, y luego introd&#250;zcalo otra vez en la f&#243;rmula, y revise nuevamente. </p><a name="316086"></a><h5>El campo variable especial no pudo ser creado.</h5><p><a name="316087"></a>Por lo general este mensaje indica que no hay suficiente memoria disponible. Cierre los informes que no necesita, y salga de los programas que no est&#225; usando en este momento. Luego intente nuevamente.</p><a name="316088"></a><h5>El campo de resumen no pudo ser creado.</h5><p><a name="316089"></a>Por lo general este mensaje indica que no hay suficiente memoria disponible. Cierre los informes que no necesita, y salga de los programas que no est&#225; usando en este momento. Luego intente nuevamente.</p><a name="316090"></a><h5>Este campo no pudo ser resumido.</h5><p><a name="316091"></a>Usted ha introducido un campo de resumen que todav&#237;a no existe en el informe. Cualquier campo de resumen en la f&#243;rmula debe reflejar un campo similar existente en el informe. Incluya primero un campo de resumen en su informe, y luego introduzca nuevamente el campo en la f&#243;rmula, o no incluya ning&#250;n campo de resumen en la f&#243;rmula.</p><a name="316092"></a><h5>Este campo no puede ser usado como un campo condicional de subtotal.</h5><p><a name="316093"></a>El campo que usted est&#225; incluyendo como campo condicional hace que el subtotal en la f&#243;rmula no coincida con ning&#250;n subtotal en el informe. Cualquier subtotal que usted incluya en la f&#243;rmula debe reflejar un subtotal ya existente en el informe. Agregue primero el subtotal en su informe y luego introd&#250;zcalo nuevamente en la f&#243;rmula, o no incluya un subtotal en la f&#243;rmula. </p><a name="316094"></a><h5>Este campo no tiene ning&#250;n valor posterior o anterior.</h5><p><a name="316095"></a>Usted a incluido un campo para el cual no existe ning&#250;n valor "anterior" como el argumento para la funci&#243;n Previous o PreviousIsNull, o ha incluido un campo para el cual no existe ning&#250;n valor "posterior" como el argumento para la funci&#243;n Next o NextIsNull. Si quiere usar cualquiera de estas dos funciones, reemplace el argumento con un campo que contenga los valores apropiados.</p><a name="316096"></a><h5>Este campo debe estar en la misma secci&#243;n que la f&#243;rmula presente.</h5><p><a name="316097"></a>Desde que este campo fue incluido en la f&#243;rmula como un operando, ha sido movido a una secci&#243;n donde no es un operando v&#225;lido. </p><a name="316098"></a><h5>Este nombre de campo no es conocido.</h5><p><a name="316099"></a>Usted ha introducido un nombre de campo que no aparece en ninguna base de datos activa. Corrija el nombre del campo y / o su alias, y revise nuevamente. O si quiere incluir un nombre de campo de una base de datos que no est&#225; activa en este momento, primero active la base de datos y luego introduzca nuevamente el nombre del campo.</p><a name="316100"></a><h5>Esta secci&#243;n de grupos no puede ser impreso porque el campo condicional no existe o no es v&#225;lido.</h5><p><a name="316101"></a>Su informe contiene una secci&#243;n de grupos basada en un campo condicional que ya no existe en el informe o ha cambiado de tal manera que ya no es v&#225;lido para la secci&#243;n de grupos. Revise su criterio de agrupamiento para identificar y corregir el origen del problema.</p><a name="316102"></a><h5>Esta matriz debe estar indexada. Por ejemplo: Matriz [i].</h5><p><a name="316103"></a>Usted ha introducido una matriz sin encerrarla entre corchetes. Encierre la matriz entre corchetes y luego revise nuevamente.</p><a name="316104"></a><h5>Esta condici&#243;n de subtotal no es conocida.</h5><p><a name="316105"></a>Usted ha incluido una condici&#243;n de subtotal que no aparece en ninguna parte de su informe. Cualquier subtotal que incluya en la f&#243;rmula debe reflejar un subtotal existente en el informe. Cambie la condici&#243;n y revise nuevamente.</p><a name="316106"></a><h5>Ha incluido demasiados argumentos en esta funci&#243;n.</h5><p><a name="316305"></a>Usted ha incluido una matriz como el argumento en una funci&#243;n sin matriz. Este tipo de problema ocurre, por ejemplo, si usted se olvida de colocar los corchetes (los elementos de sintaxis requeridos en una matriz) para encerrar una matriz. El Verificador de F&#243;rmula ve los valores de la matriz como argumentos a una funci&#243;n sin matriz y muestra este error.</p><a name="316108"></a><h5>Ha incluido demasiados elementos en esta matriz.</h5><p><a name="316109"></a>El programa s&#243;lo permite hasta 50 valores en una matriz. Usted ha excedido ese l&#237;mite. Reduzca el n&#250;mero de valores y revise nuevamente.</p><a name="316110"></a><h5>Hay demasiados archivos abiertos.</h5><p><a name="316111"></a>Tiene demasiados archivos abiertos (base de datos, informes) para el n&#250;mero de archivos que usted especific&#243; en el enunciado CONFIG.SYS FILES =. Para que este error no ocurra nuevamente, use menos archivos o incremente el n&#250;mero de archivos especificado en el enunciado FILES =.</p><a name="316112"></a><h5>Advertencias de operandos faltantes o incorrectos.</h5><p><a name="316113"></a>Las siguientes advertencias aparecen cuando el Verificador de F&#243;rmula espera encontrar un cierto tipo de operando (el elemento en que la operaci&#243;n de f&#243;rmula se lleva a cabo), pero encuentra algo diferente. Por ejemplo, la f&#243;rmula <strong>5&gt;a</strong> est&#225; comparando un n&#250;mero a un texto (la antigua analog&#237;a de comparar peras con manzanas).Cuando el Verificador de F&#243;rmula ve que el n&#250;mero cinco est&#225; siendo comparado con algo, espera que ese algo sea otro n&#250;mero. Si aparece algo diferente a un n&#250;mero, muestra esta advertencia:</p><p><a name="316114"></a>Aqu&#237; se requiere un n&#250;mero.</p><p><a name="316115"></a>Aqu&#237; se requiere una matriz Booleana.</p><p><a name="316116"></a>Aqu&#237; se requiere un Booleano.</p><p><a name="316117"></a>Aqu&#237; se requiere un valor de moneda.</p><p><a name="316118"></a>Aqu&#237; se requiere una matriz de valores de moneda.</p><p><a name="316119"></a>Aqu&#237; se requiere un rango de moneda.</p><p><a name="316120"></a>Aqu&#237; se requiere una matriz de fechas.</p><p><a name="316121"></a>Aqu&#237; se requiere una fecha.</p><p><a name="316122"></a>Aqu&#237; se requiere un rango de fechas.</p><p><a name="316123"></a>Aqu&#237; se requiere una matriz de n&#250;meros.</p><p><a name="316124"></a>Aqu&#237; se requiere una matriz de n&#250;meros o una matriz de valores de moneda.</p><p><a name="316125"></a>Aqu&#237; se espera un n&#250;mero, un valor de moneda, un valor Booleano o una cadena.</p><p><a name="316126"></a>Aqu&#237; se requiere un n&#250;mero, valor de moneda, valor Booleano, fecha o cadena.</p><p><a name="316127"></a>Aqu&#237; se requiere un n&#250;mero, valor de moneda, fecha o cadena.</p><p><a name="316128"></a>Aqu&#237; se requiere un n&#250;mero, valor de moneda, o fecha.</p><p><a name="316129"></a>Aqu&#237; se requiere un n&#250;mero de campo o campo de valor de moneda.</p><p><a name="316130"></a>Aqu&#237; se requiere un n&#250;mero.</p><p><a name="316131"></a>Aqu&#237; se requiere un n&#250;mero o valor de moneda.</p><p><a name="316132"></a>Aqu&#237; se requiere un rango de n&#250;meros.</p><p><a name="316133"></a>Aqu&#237; se requiere una matriz de cadena.</p><p><a name="316134"></a>Aqu&#237; se requiere una cadena.</p><p><a name="316135"></a>Aqu&#237; se requiere una cadena o una matriz de cadena.</p><p><a name="316136"></a>Aqu&#237; se requiere una matriz de valores.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "19_introformulas26.html";
var next = "19_introformulas28.html";

function setTopicID() { 
      var number = "315904"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


