<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Especificaci&#243;n de f&#243;rmulas</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="209532"></a><h2 class="newpage">Especificaci&#243;n de f&#243;rmulas</h2><p><a name="227443"></a>Existen cuatro grupos diferentes de f&#243;rmulas en Seagate Crystal Reports: f&#243;rmulas de informe, de formato, de selecci&#243;n y de b&#250;squeda. La mayor&#237;a de las f&#243;rmulas de un informe son f&#243;rmulas de informe y f&#243;rmulas de formato condicional.</p><a name="227628"></a><h5>F&#243;rmulas de informe</h5><p><a name="227598"></a>Las f&#243;rmulas de informe son aquellas creadas para que sean independientes en un informe. Por ejemplo, una f&#243;rmula que calcula los d&#237;as entre la fecha del pedido y la fecha de env&#237;o es una f&#243;rmula de informe.</p><a name="227625"></a><h5>F&#243;rmulas de formato condicional</h5><p><a name="272586"></a>Las f&#243;rmulas de formato cambian la presentaci&#243;n y el dise&#241;o de un informe, as&#237; como tambi&#233;n la apariencia del texto, de los campos de la base de datos, de los objetos o de secciones completas de un informe. El Editor de formato le ayuda a aplicar formato al texto. Si necesita crear una f&#243;rmula de formato, acceda al Editor de f&#243;rmulas desde el Editor de formato. <a href="11_format43.html#89319">See Trabajo con Formato condicional.</a></p><a name="272589"></a><h5>F&#243;rmulas de selecci&#243;n</h5><p><a name="227652"></a>Las f&#243;rmulas de selecci&#243;n especifican y limitan los registros y grupos que aparecen en un informe. Por lo general, Ud. no ingresa estas f&#243;rmulas directamente, sino que en cambio especifica la selecci&#243;n mediante el Asistente de Selecci&#243;n. Seagate Crystal Reports entonces genera la f&#243;rmula de selecci&#243;n de registros y de selecci&#243;n de grupos. Ud. tiene la opci&#243;n de editar manualmente estas f&#243;rmulas, pero debe usar sintaxis Crystal. <a href="07_recordgroupsel2.html#53146">See Selecci&#243;n de registros.</a></p><a name="227681"></a><h5>F&#243;rmulas de b&#250;squeda</h5><p><a name="252441"></a>Las f&#243;rmulas de b&#250;squeda ayudan a ubicar datos del informe. Al igual que las f&#243;rmulas de selecci&#243;n, Ud. generalmente no ingresa estas f&#243;rmulas directamente, sino que en cambio especifica los criterios de b&#250;squeda mediante el Asistente de B&#250;squeda. Seagate Crystal Reports genera la f&#243;rmula. Ud. tiene la opci&#243;n de editar manualmente estas f&#243;rmulas, pero debe usar sintaxis Crystal.</p><p><a name="252432"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Si ya conoce la sintaxis Basic, s&#243;lo necesita conocer los principios b&#225;sicos de la sintaxis Crystal para modificar la mayor&#237;a de las f&#243;rmulas de selecci&#243;n y de b&#250;squeda.</p>

<hr><br>

<script  language="JavaScript"><!--

var prev = "19_introformulas5.html";
var next = "19_introformulas7.html";

function setTopicID() { 
      var number = "209532"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


