<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Actualizaci&#243;n de los datos del informe</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="47266"></a><h4 class="newpage"> Actualizaci&#243;n de los datos del informe</h4><p><a name="47267"></a>Cuando usted actualiza los datos desde la ficha Vista previa, aparece el cuadro de dialogo Actualizar los datos del Informe.</p><p><a name="53183"></a> <img src="images/db_refs2.gif">


</p>
<p><a name="49508"></a>Seleccione <kbd>Usar valores de par&#225;metros actuales </kbd>si quiere usar esos valores.</p><p><a name="47302"></a>Seleccione <kbd>Solicitar nuevos valores de par&#225;metros</kbd> si quiere ingresar un nuevo valor de par&#225;metro. Si selecciona esta opci&#243;n y hace clic en <kbd>Aceptar</kbd>, aparecer&#225; el cuadro de di&#225;logo Introducir Valores de Par&#225;metro para el Informe Principal.</p><ul type="disc"><a name="47303"></a><li>Introduzca valores de cadena exactamente como aparecen en el campo. Si el campo de par&#225;metro permite valores m&#250;ltiples, usted puede introducir valores de par&#225;metro adicionales usando el bot&#243;n Agregar.
<a name="47304"></a><li>Introduzca valores Booleanos usando el formato TRUE (Verdadero) o FALSE (Falso).
<a name="47305"></a><li>Introduzca valores num&#233;ricos exactamente como aparecen en los campos.
<a name="47306"></a><li>Introduzca valores monetarios exactamente como aparecen en el campo.
<a name="47338"></a><li>Introduzca valores de fechas usando el siguiente formato: Fecha (A&#241;o/Mes/D&#237;a). Por ejemplo, Fecha (1997/5/21). Para acceder al calendario, clic en la flecha de la lista desplegable.
<a name="47339"></a><li>Introduzca valores de hora usando el siguiente formato: Hora (Horas:Minutos:Segundos AM/PM). Por ejemplo, Hora (04:32:12 AM). Tambi&#233;n puede introducir valores de hora en el estilo de Windows (el cual est&#225; especificado en la ficha Hora del cuadro de di&#225;logo Configuraci&#243;n Regional, en el Panel de Control). El selector de hora aparece a la derecha de la lista desplegable.
<a name="46550"></a><li>Introduzca valores de Fecha<nobr>-H</nobr>ora usando el siguiente formato: Fecha (A&#241;o/Mes/D&#237;a), Hora (Horas:Minutos:Segundos AM/PM). Por ejemplo, Fecha (1997, 5, 21), Hora (04:32:12 AM). Tambi&#233;n es posible ingresar valores de fechahora usando la flecha hacia abajo asociada para acceder al calendario y las flechas hacia arriba y hacia abajo para desplazarse por la hora.
<p class="indent"><a name="46551"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>La flecha hacia abajo para acceder al calendario para las fechas y las flechas hacia arriba y hacia abajo para desplazarse por las horas s&#243;lo est&#225;n disponibles si  tiene la versi&#243;n correcta (4.70 o posterior) de comctl32.dll (existe un programa de instalaci&#243;n independiente para este archivo en el disco de instalaci&#243;n de Seagate Crystal Reports).</p>
</ul><p><a name="46555"></a>Para usar un valor distinto al valor predeterminado mostrado, escriba un nuevo valor en el cuadro de texto y haga clic en <strong>Aceptar</strong>.</p><p><a name="46556"></a>Para usar el valor predeterminado, haga clic en <strong>Aceptar</strong>.</p><ul type="disc"><a name="46557"></a><li>Si el campo de par&#225;metro es limitado por rango, s&#243;lo puede ingresar valores dentro de un cierto rango. El l&#237;mite de rango se especifica en el cuadro de di&#225;logo Establecer valor predeterminado cuando se crea o edita un par&#225;metro.
<a name="46558"></a><li>Si el par&#225;metro es un tipo de valor de cadena, puede limitar los valores que el usuario puede ingresar usando la opci&#243;n de limitaci&#243;n de longitud o usando una m&#225;scara de edici&#243;n para restringir el formato.
</ul><p><a name="46559"></a>El programa ahora ejecuta el informe usando los nuevos valores que especific&#243;.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "22_param7.html";
var next = "22_param9.html";

function setTopicID() { 
      var number = "47266"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


