<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>C&#243;mo dar formato condicional usando campos de par&#225;metro </title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="47349"></a><h4 class="newpage"> C&#243;mo dar formato condicional usando campos de par&#225;metro </h4><p><a name="47350"></a>Usted puede dar formato condicional usando campos de par&#225;metro que puede personalizar cada vez que actualice los datos en el informe. Un uso t&#237;pico para este tipo de f&#243;rmula ser&#237;a poner indicadores de colores a datos si es que cumplen ciertos requisitos. Por ejemplo:</p><ul type="disc"><a name="47351"></a><li>representantes de venta que hayan vendido m&#225;s de 10% sobre la cuota,
<a name="47352"></a><li>clientes que no hayan ordenado en los tres meses pasados, y
<a name="47353"></a><li>productos en el inventario que no se han movido en el &#250;ltimo mes.
</ul><p><a name="47354"></a>Si las condiciones bajo las cuales usted pone los indicadores en estos elementos no cambia, no hay necesidad de usar campos de par&#225;metro. Simplemente, puede usar f&#243;rmulas (para indicadores de texto) o dar formato condicional (para indicadores de color o borde). Pero si usted quiere cambiar las condiciones de informe a informe, puede usar campos de par&#225;metro en f&#243;rmulas y el formato condicional para hacerlo.</p><ol>
<a name="47355"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">Establezca el campo de par&#225;metro en el tipo de datos que necesita en la f&#243;rmula.
<a name="52496"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/22_param5a.gif">


Origine la f&#243;rmula y use el campo de par&#225;metro en lugar del valor fijo que normalmente usar&#237;a.
<a name="52502"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">Por ejemplo, para imprimir en rojo los nombres de todos los clientes que el a&#241;o pasado hicieron compras superiores a cierto valor (que usted quiere que se le pida), seleccione el campo Ventas del A&#241;o Pasado y haga clic en el bot&#243;n <kbd>Propiedad de objetos</kbd> en la barra de herramientas suplementaria.
<p class="indent"><a name="47363"></a>El Editor de Formato aparecer&#225; en su pantalla.</p><a name="47368"></a><li value="4&nbsp;&nbsp;&nbsp;&nbsp;"><img src="images/Bt_cdfml.gif">


Haga clic en el bot&#243;n F&#243;rmula condicional al lado de la propiedad color en la ficha <kbd>Fuente</kbd>, y d&#233; formato al campo usando una f&#243;rmula de formato condicional c&#243;mo esta:
</ol>
<PRE><a name="47369"></a>If {cliente.VENTAS DEL A&Ntilde;O PASADO} &gt; {?SalesTarget} Then <br>
&nbsp;&nbsp;&nbsp;&nbsp;Red<br>
Else<br>
&nbsp;&nbsp;&nbsp;&nbsp;Black
</PRE><p><a name="47370"></a>Ahora cuando usted actualice los datos, el programa le pedir&#225; el valor l&#237;mite (el valor que activa el indicador de color). Seguidamente, elabora el informe y pone indicadores a todos los clientes que el a&#241;o pasado hicieron compras mayores que la cantidad l&#237;mite. Si lo desea, puede cambiar esa cantidad cada vez que elabora el informe y el programa pondr&#225; indicadores en un conjunto diferente de Nombres de Clientes.</p><p><a name="47427"></a>Para m&#225;s informaci&#243;n, vea <a href="20_basicsyntax41.html#130639">Funciones de formato condicional</a>.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "22_param9.html";
var next = "22_param11.html";

function setTopicID() { 
      var number = "47349"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


