<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Introducci&#243;n</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="394319"></a><h2 class="newpage">Introducci&#243;n</h2><p><a name="196705"></a>Seagate Crystal Reports puede acceder a los datos almacenados en casi todo formato com&#250;n de base de datos, as&#237; como tambi&#233;n en muchos formatos no comunes. Adem&#225;s, Seagate Crystal Reports aprovecha todos los beneficios de los archivos de consulta (.QRY) y diccionarios (.DC5). Vea <a href="26_sql.html#59071">Crystal SQL Designer</a> y <a href="27_dictionary.html#143975">Diccionarios</a>.</p><p><a name="30303"></a>Esta secci&#243;n analiza los diferentes tipos de datos a que puede acceder Seagate Crystal Reports y explica las capas de acceso que participan en la conexi&#243;n a los datos. Si no est&#225; seguro de qu&#233; sistema de administraci&#243;n de bases de datos (DBMS) usa su compa&#241;&#237;a, comun&#237;quese con su administrador de red o gerente de sistemas de informaci&#243;n.</p><p><a name="3807"></a>El objetivo principal de Seagate Crystal Reports es simplemente acceder a los datos almacenados en una base de datos y elaborar informes con dichos datos. Este objetivo es uno de los usos m&#225;s antiguos de las computadoras y contin&#250;a siendo uno de los m&#225;s comunes y necesarios. Seagate Crystal Reports est&#225; dise&#241;ado para facilitar esta tarea, en menor tiempo y con mayor capacidad.</p><p><a name="3852"></a>Esta idea de acceder a los datos est&#225; en la ra&#237;z de cada informe elaborado. Al comprender c&#243;mo accede Seagate Crystal Reports a los datos, obtendr&#225; un mayor conocimiento del proceso de elaboraci&#243;n de informes, as&#237; como tambi&#233;n un conocimiento m&#225;s preciso del tipo de datos con los que el programa puede trabajar.</p><p><a name="3935"></a>Adem&#225;s, al comprender el proceso de acceso a los datos podr&#225; solucionar los problemas que pueda encontrar al intentar abrir un archivo de base de datos en particular. Esto es de especial utilidad para los gerentes de sistemas de informaci&#243;n o para cualquier otra persona que proporcione soporte de acceso de datos a un grupo de usuarios.</p><p><a name="196726"></a>La mayor parte de la informaci&#243;n contenida en este secci&#243;n est&#225; dise&#241;ada para usuarios de Seagate Crystal Reports con experiencia y gerentes de sistemas de informaci&#243;n y cubre aspectos t&#233;cnicos del sistema de administraci&#243;n de bases de datos (DBMS) y t&#233;cnicas de almacenamiento de datos. Se considera que el usuario est&#225; familiarizado con el manejo de computadoras; con los sistemas operativos Windows 95 y Windows 98 o Windows NT; y por lo menos con un programa DBMS.</p><p><a name="304791"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Muchos de los archivos de traducci&#243;n mencionados en este secci&#243;n tienen nombres ligeramente diferentes cuando aparecen en el cuadro de di&#225;logo Convertir controlador de base de datos. Por ejemplo, el archivo de traducci&#243;n normalmente denominado P2sodbc.dll aparece como Pdsodbc.dll en este cuadro de di&#225;logo. Ambos nombres representan al mismo archivo.</p>

<hr><br>

<script  language="JavaScript"><!--

var prev = "25_access_sources2.html";
var next = "25_access_sources4.html";

function setTopicID() { 
      var number = "394319"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


