<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Introducci&#243;n a los diccionarios</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="140974"></a><h2 class="newpage">Introducci&#243;n a los diccionarios</h2><p><a name="140975"></a>Un diccionario es un panorama de datos simple y estructurado, creado para todos o algunos de sus colegas en la empresa usando Seagate Crystal Reports.</p><p><a name="140976"></a>A diferencia de algunos sistemas que obligan a los usuarios a obtener los datos a trav&#233;s de una metacapa de distribuci&#243;n de datos, los diccionarios son componentes opcionales. Los datos pueden ser obtenidos directamente por el usuario. Los diccionarios simplemente, proveen la conveniencia sin las restricciones impuestas por otros sistemas.</p><p><a name="140977"></a>Los diccionarios le permiten:</p><ul type="disc"><a name="140978"></a><li>dise&#241;ar un panorama &#250;nico y din&#225;mico de todos los datos necesarios para crear informes y consultas organizacionales,
<a name="140979"></a><li>organizar los datos y dar nuevos nombres a tablas y campos y as&#237; hacer m&#225;s f&#225;cil entender el contenido y prop&#243;sito de los datos, y 
<a name="140980"></a><li>crear f&#243;rmulas complejas de manipulaci&#243;n de datos que los usuarios pueden obtener sin necesidad de entender los conceptos de f&#243;rmulas.
</ul><p><a name="144018"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>El Editor de F&#243;rmulas que usa Crystal Dictionaries no es tan completo como el que se usa en Seagate Crystal Reports.</p>
<p><a name="140983"></a>Los diccionarios reducen costo y tiempo, mejoran la productividad del usuario y reducen p&#233;rdida, da&#241;o y uso indebido de los datos. Cuando usted crea un informe usando un diccionario, los &#250;nicos datos que puede utilizar en el informe son aquellos a los cuales tiene acceso a trav&#233;s de un diccionario; no puede usar en el mismo informe un diccionario y una fuente de datos diferente. Debido a que los diccionarios son usados com&#250;nmente para imponer protecci&#243;n de datos, ser&#237;a una violaci&#243;n de esa protecci&#243;n permitir el acceso libre en un informe de un diccionario.</p><p><a name="140984"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Lo que s&#237; puede hacer, es incluir un subinforme basado en una fuente de datos diferente en un informe principal basado en un Dictionario<strong>.</strong></p>
<p><a name="140986"></a>Finalmente, los diccionarios proveen una manera f&#225;cil de cambiar el conjunto de datos subyacente sin cambiar la aparencia de los datos que son vistos por los usuarios. Por ejemplo, usted puede cambiar los nombres de campos y tablas en los datos subyacentes. Luego bosqueja nuevamente el diccionario al nuevo nombre del campo y tabla sin cambiar el alias asignado a los datos. Los usuarios crean sus informes usando la misma interfaz de datos a la que est&#225;n acostumbrados, sin conocimiento de los cambios ocurridos en el trasfondo.</p><p><a name="144136"></a>Una vez creado, el diccionario act&#250;a como un filtro, que provee al usuario una vista clara y f&#225;cil de entender de datos complejos.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "27_dictionary.html";
var next = "27_dictionary3.html";

function setTopicID() { 
      var number = "140974"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


