<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Ficha Etiqueta</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="353942"></a><h3 class="newpage"> Ficha Etiqueta</h3>
<p><a name="353956"></a>Use la ficha Etiqueta para configurar opciones de etiquetas de correo. La ficha Etiqueta de correo es un poderoso panel de control que le permite imprimir datos en casi cualquier etiqueta comercialmente disponible para impresoras de l&#237;neas (matriz de punto) o impresoras de p&#225;ginas (l&#225;ser, inyecci&#243;n de tinta). Use los comandos de configuraci&#243;n y de formato para afinar su impresi&#243;n de modo que las etiquetas tengan el aspecto deseado.</p><p><a name="353960"></a>La ficha Etiqueta de correo ofrece dos formas de configurar etiquetas:</p><ul type="disc"><a name="353962"></a><li>Autom&#225;ticamente, de acuerdo al n&#250;mero de etiqueta Avery
<a name="353964"></a><li>Manualmente 
</ul><a name="353966"></a><h5>Autom&#225;ticamente, de acuerdo al n&#250;mero de etiqueta Avery</h5><p><a name="353968"></a>Para facilitar su trabajo, el programa adjunta plantillas preestablecidas para las etiquetas Avery m&#225;s usadas. Esas etiquetas aparecen, por n&#250;mero, en la lista Tipo de etiqueta de correo. </p><ol>
<a name="353970"></a><li value="1&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en la flecha de desplazamiento y despl&#225;cese hacia abajo para ver si aparece la etiqueta Avery que est&#225; usando.
<a name="353972"></a><li value="2&nbsp;&nbsp;&nbsp;&nbsp;">Si es as&#237;, seleccione el n&#250;mero y el programa autom&#225;ticamente configurar&#225; los ajustes de esa etiqueta.
<a name="353974"></a><li value="3&nbsp;&nbsp;&nbsp;&nbsp;">Haga clic en Aceptar cuando haya finalizado.
</ol>
<a name="353976"></a><h5>Manualmente</h5><p><a name="353978"></a>Si su etiqueta no aparece en la lista Tipo de etiqueta de correo, es necesario usar varios ajustes en la ficha Etiquetas de correo para configurar la etiqueta manualmente. Seleccione la opci&#243;n de etiqueta definida por el usuario de la lista y cambie el resto de la configuraci&#243;n del cuadro de di&#225;logo para adecuarla a la etiqueta que va a usar.</p><a name="353989"></a><h5>Tipo de etiqueta de correo</h5><p><a name="353991"></a>Esta lista muestra las plantillas preestablecidas para la mayor&#237;a de etiquetas Avery, as&#237; como tambi&#233;n una opci&#243;n de etiqueta definida por el usuario para crear tama&#241;os personalizados de etiquetas.</p><a name="353993"></a><h5>Tama&#241;o de etiqueta de correo</h5><p><a name="353995"></a>Estos cuadros de edici&#243;n le permiten especificar las dimensiones (alto y ancho) de una etiqueta. Esta informaci&#243;n normalmente se puede encontrar en la caja o carpeta en que vienen las etiquetas. Simplemente ingrese los valores de alto y ancho en los cuadros de edici&#243;n respectivos.</p><p><a name="353999"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>La unidad de medida utilizada en el cuadro de di&#225;logo (pulgadas o cent&#237;metros) se basa en la configuraci&#243;n de medida de la secci&#243;n Internacional del Panel de control de Windows (ingl&#233;s = pulgadas; m&#233;trico = cent&#237;metros).</p>
<a name="354003"></a><h5>Espacio entre etiquetas</h5><p><a name="354005"></a>Estos cuadros de edici&#243;n le permiten especificar el &#225;rea vac&#237;a (espacio, medianil, etc.) entre etiquetas. Simplemente mida los espacios y luego ingrese los valores horizontales y verticales en los cuadros de edici&#243;n respectivos.</p><ul type="disc"><a name="354007"></a><li>Horizontal<br>Espacio entre etiquetas a lo ancho de la p&#225;gina. Las etiquetas individuales que aparecen en una cara (una a lo ancho) no tienen ning&#250;n espacio horizontal.
<a name="354009"></a><li>Vertical<br>Espacio entre etiquetas a lo largo de la p&#225;gina.
</ul><p><a name="354013"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>La unidad de medida utilizada en el cuadro de di&#225;logo (pulgadas o cent&#237;metros) se basa en la configuraci&#243;n de medida de la secci&#243;n Internacional del Panel de control de Windows (ingl&#233;s = pulgadas; m&#233;trico = cent&#237;metros).</p>
<a name="354017"></a><h5>M&#225;rgenes de p&#225;gina</h5><p><a name="1000234451"></a>Estos cuadros de edici&#243;n le permiten establecer los m&#225;rgenes superior, inferior, derecho e izquierdo de la p&#225;gina. Simplemente mida los m&#225;rgenes e ingrese los valores en los cuadros de edici&#243;n respectivos.</p><p><a name="1000234452"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font></p>
<ul type="disc"><a name="1000234453"></a><li>Todos los m&#225;rgenes se calculan desde el borde del papel. Por ejemplo, una configuraci&#243;n de 1,25 cm establece un margen de 1,25 cm.
<a name="354029"></a><li>No se puede usar la configuraci&#243;n de margen de p&#225;gina para establecer el tama&#241;o del papel, sino que es necesario establecer el tama&#241;o del papel mediante la lista Tama&#241;o de papel en el cuadro de di&#225;logo Preparar impresora.
<a name="354035"></a><li>La unidad de medida utilizada en el cuadro de di&#225;logo (pulgadas o cent&#237;metros) se basa en la configuraci&#243;n de medida de la secci&#243;n Internacional del Panel de control de Windows (ingl&#233;s = pulgadas; m&#233;trico = cent&#237;metros).
</ul><a name="354039"></a><h5>Direcci&#243;n de impresi&#243;n</h5><p><a name="354041"></a>La secci&#243;n Direcci&#243;n de impresi&#243;n le permite especificar la ruta que sigue el programa al imprimir los datos en las etiquetas. </p><ul type="disc"><a name="354043"></a><li>A lo ancho y luego hacia abajo <br>Imprime datos de izquierda a derecha a lo ancho de la primera fila de etiquetas, luego de la segunda fila, etc.
<a name="354045"></a><li>Hacia abajo y luego a lo ancho <br>Imprime datos hacia abajo en la primera columna de etiquetas, luego hacia abajo en la segunda columna, etc.
</ul><a name="354047"></a><h5>N&#250;mero de etiquetas</h5><p><a name="354049"></a>Este cuadro de informaci&#243;n muestra el n&#250;mero m&#225;ximo de etiquetas que se pueden imprimir a lo ancho y a lo largo de la p&#225;gina basado en la configuraci&#243;n de los cuadros de edici&#243;n M&#225;rgenes de p&#225;gina, Tama&#241;o de etiqueta de correo y Espacio entre etiquetas, as&#237; como el tama&#241;o del papel (que se configura en el Panel de control de Windows).</p><p><a name="354053"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font></p>
<ul type="disc"><a name="1000234458"></a><li>El programa muestra s&#243;lo el n&#250;mero de etiquetas completas que puede imprimir. Por ejemplo, si determina que hay espacio disponible para imprimir 2,75 etiquetas a lo ancho de la p&#225;gina, muestra 2 como configuraci&#243;n a lo ancho de la p&#225;gina e imprime s&#243;lo dos etiquetas a lo ancho de la p&#225;gina.
<a name="354059"></a><li>Si desea imprimir menos etiquetas a lo ancho que el n&#250;mero calculado (menos columnas), aumente el tama&#241;o del margen derecho, margen izquierdo o espacio horizontal hasta que el c&#225;lculo cambie al n&#250;mero que desea.
</ul>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts18.html";
var next = "experts20.html";

function setTopicID() { 
      var number = "353942"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


