<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Ficha Ejes</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="1000391931"></a><h3 class="newpage"> Ficha Ejes</h3>
<p><a name="1000391933"></a>La ficha Ejes le permite establecer las propiedades de cada uno de los ejes del gr&#225;fico. La ficha Ejes cambia dependiendo del tipo de gr&#225;fico con el que trabaje. </p><a name="1000056971"></a><h5>Mayor</h5><p><a name="1000056972"></a>Use las casillas de verificaci&#243;n Mayor para determinar si se van a mostrar l&#237;neas de divisi&#243;n mayores para los ejes del gr&#225;fico. Existe una casilla de verificaci&#243;n mayor para el eje de grupo, otra para el eje de serie, otra para el eje de datos y otra para el eje de datos 2. Estas casillas de verificaci&#243;n s&#243;lo se activan si el gr&#225;fico es de tabla cruzada u OLAP.</p><ul type="disc"><a name="354658"></a><li>Seleccione una casilla de verificaci&#243;n mayor para mostrar la l&#237;nea de divisi&#243;n del eje correspondiente.
<a name="354660"></a><li>Desactive una casilla de verificaci&#243;n mayor para ocultar la l&#237;nea de divisi&#243;n del eje correspondiente.
</ul><a name="354662"></a><h5>Menor</h5><p><a name="1000056979"></a>Use las casillas de verificaci&#243;n Menor para determinar si se van a mostrar l&#237;neas de divisi&#243;n mayores para los ejes del gr&#225;fico. Existe una casilla de verificaci&#243;n menor para el eje de grupo, otra para el eje de serie, otra para el eje de datos y otra para el eje de datos 2. Estas casillas de verificaci&#243;n s&#243;lo se activan si el gr&#225;fico es de tabla cruzada u OLAP.</p><ul type="disc"><a name="354666"></a><li>Seleccione una casilla de verificaci&#243;n mayor para mostrar la l&#237;nea de divisi&#243;n del eje correspondiente.
<a name="354668"></a><li>Desactive una casilla de verificaci&#243;n mayor para ocultar la l&#237;nea de divisi&#243;n del eje correspondiente.
</ul><a name="1000067008"></a><h5>Escala autom&#225;tica</h5><p><a name="1000067009"></a>Cuando selecciona una de las casillas de verificaci&#243;n Escala autom&#225;tica, el n&#250;mero de etiquetas del eje de datos se ajusta para garantizar una visualizaci&#243;n clara.</p><a name="1000056996"></a><h5>Rango autom&#225;tico</h5><p><a name="354672"></a>Cuando selecciona una de las casillas de verificaci&#243;n Rango autom&#225;tico, se asigna un rango predeterminado a los valores de datos del eje correspondiente.</p><a name="354674"></a><h5>Menor</h5><p><a name="354676"></a>Use los cuadros de texto Menor para ingresar el m&#237;nimo rango para los valores de datos en los ejes correspondientes. Existe un cuadro de texto de rango m&#237;nimo para el eje de datos y otro para el eje de datos 2. El segundo cuadro de texto de rango m&#237;nimo s&#243;lo se activa si el gr&#225;fico es de tabla cruzada u OLAP.</p><p><a name="354678"></a>Si se selecciona la casilla de verificaci&#243;n Rango autom&#225;tico, el cuadro de texto de rango m&#237;nimo queda inactivo.</p><a name="354680"></a><h5>M&#225;x.</h5><p><a name="354682"></a>Use los cuadros de texto M&#225;x. para ingresar el m&#225;ximo rango para los valores de datos en los ejes correspondientes. Existe un cuadro de texto de rango m&#225;ximo para el eje de datos y otro para el eje de datos 2. El segundo cuadro de texto de rango m&#225;ximo s&#243;lo se activa si el gr&#225;fico es de tabla cruzada u OLAP.</p><p><a name="354684"></a>Si se selecciona la casilla de verificaci&#243;n Rango autom&#225;tico, el cuadro de texto de rango m&#225;ximo queda inactivo.</p><a name="354686"></a><h5>Formato de n&#250;mero</h5><p><a name="354688"></a>Use las listas Formato de n&#250;mero para seleccionar un formato num&#233;rico para los valores de datos en el eje correspondiente. Existe una lista Formato de n&#250;mero para el eje de datos (y) y otra para el eje de datos 2. La segunda lista Formato de n&#250;mero s&#243;lo se activa si el gr&#225;fico es de tabla cruzada u OLAP.</p><p><a name="354690"></a>Si se selecciona la casilla de verificaci&#243;n Rango autom&#225;tico correspondiente, la lista Formato de n&#250;mero queda inactiva.</p><a name="354692"></a><h5>Autom&#225;tica</h5><p><a name="354694"></a>Si hace clic en uno de los botones de la opci&#243;n Autom&#225;tica, el programa establece de forma autom&#225;tica el n&#250;mero de divisiones para el eje correspondiente del gr&#225;fico. Existe una opci&#243;n autom&#225;tica para el eje de datos y otra para el eje de datos 2. El segundo bot&#243;n de la opci&#243;n Autom&#225;tica s&#243;lo se activa si el gr&#225;fico es de tabla cruzada u OLAP.</p><a name="354696"></a><h5>Manual</h5><p><a name="354698"></a>Use los botones de la opci&#243;n Manual para establecer manualmente el n&#250;mero de divisiones para los ejes correspondientes. Existe una opci&#243;n manual para el eje de datos y otra para el eje de datos 2. El segundo bot&#243;n de la opci&#243;n Manual s&#243;lo se activa si el gr&#225;fico es de tabla cruzada u OLAP.</p><p><a name="354700"></a>Cuando hace clic en uno de los botones de la opci&#243;n Manual, el cuadro de texto adyacente se activa. Use el cuadro de texto para ingresar el n&#250;mero de divisiones.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts40.html";
var next = "experts42.html";

function setTopicID() { 
      var number = "1000391931"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


