<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Ficha Opciones</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="354702"></a><h3 class="newpage"> Ficha Opciones</h3>
<p><a name="354712"></a>Con la ficha Opciones podr&#225; establecer distintos par&#225;metros de visualizaci&#243;n de gr&#225;ficos.</p><a name="354727"></a><h5>Color del gr&#225;fico</h5><p><a name="354729"></a>Use los botones de la opci&#243;n Color del gr&#225;fico para especificar si el gr&#225;fico va a ser de color o en blanco y negro.</p><a name="354731"></a><h5>Puntos de datos</h5><p><a name="354733"></a>Use los botones de la opci&#243;n Puntos de datos para especificar el tipo de etiqueta que va a aparecer para cada elemento de datos (es decir, para cada valor del gr&#225;fico). Puede hacer clic en Ninguno, Mostrar etiqueta o Mostrar valor. Si hace clic en Mostrar valor, se activa la lista Formato de n&#250;mero. Use la lista Formato de n&#250;mero para seleccionar un formato para los valores del gr&#225;fico. Por ejemplo, puede seleccionar un formato de 1 (numeral) o puede seleccionar un formato de $1,00 (monetario).</p><a name="1000067064"></a><h5>Fondo transparente</h5><p><a name="1000067065"></a>Cuando se selecciona esta casilla de verificaci&#243;n, el fondo del gr&#225;fico queda transparente con el fin de hacer visibles los objetos posicionados detr&#225;s.</p><a name="1000057179"></a><h5>Tama&#241;o del marcador</h5><p><a name="1000057180"></a>Use esta lista para especificar el tama&#241;o del marcador para los marcadores de valores de gr&#225;fico en un gr&#225;fico de l&#237;nea.</p><a name="1000057181"></a><h5>Figura del marcador</h5><p><a name="1000057177"></a>Use esta lista para especificar la forma del marcador para los marcadores de valores de gr&#225;fico en un gr&#225;fico de l&#237;nea.</p><a name="1000067080"></a><h5>&Aacute;ngulo de visualizaci&#243;n</h5><p><a name="1000067081"></a>Use esta lista para especificar el &#225;ngulo desde el cual se visualiza el gr&#225;fico (&#225;ngulo est&#225;ndar, desde arriba, etc.).</p><a name="354735"></a><h5>Tama&#241;o del gr&#225;fico circular</h5><p><a name="354737"></a>Use esta lista para seleccionar el tama&#241;o del c&#237;rculo para un gr&#225;fico circular (m&#237;nimo, peque&#241;o, promedio, grande o m&#225;ximo).</p><a name="354739"></a><h5>Tama&#241;o de la barra</h5><p><a name="354741"></a>Use esta lista para seleccionar el tama&#241;o de la barra para un gr&#225;fico de barra (M&#237;nimo, Peque&#241;o, Promedio, Grande o M&#225;ximo).</p><a name="1000067096"></a><h5>Separar secci&#243;n del gr&#225;fico circular</h5><p><a name="1000067097"></a>Cuando se selecciona esta casilla de verificaci&#243;n, una secci&#243;n se separa del gr&#225;fico circular. Puede hacer clic en La secci&#243;n m&#225;s peque&#241;a o La secci&#243;n m&#225;s grande para especificar qu&#233; secci&#243;n del gr&#225;fico desea separar.</p><a name="1000067098"></a><h5>Mostrar leyenda</h5><p><a name="1000067099"></a>Cuando se selecciona esta casilla de verificaci&#243;n, se muestra la leyenda para el gr&#225;fico o diagrama. Cuando la marca de verificaci&#243;n no aparece, la opci&#243;n no queda seleccionada y no se muestra ninguna leyenda para el gr&#225;fico. La opci&#243;n est&#225; seleccionada en forma predeterminada.</p><a name="354751"></a><h5>Ubicaci&#243;n</h5><p><a name="354753"></a>Use la lista Ubicaci&#243;n para especificar d&#243;nde desea que aparezca la leyenda del gr&#225;fico (esquina superior derecha del gr&#225;fico, a la izquierda, a la derecha, etc.).</p><p><a name="354755"></a>Esta lista s&#243;lo se activa cuando se ha seleccionado la casilla de verificaci&#243;n Mostrar leyenda.</p><a name="1000067109"></a><h5>Dise&#241;o</h5><p><a name="1000067110"></a>Use esta lista para mostrar valores porcentuales, valores reales, valores reales y porcentuales o ning&#250;n valor.</p><a name="1000421490"></a><h6>Temas relacionados</h6><p><a name="1000421491"></a>Editar gr&#225;ficos usando el Asistente de gr&#225;fico </p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts41.html";
var next = "experts43.html";

function setTopicID() { 
      var number = "354702"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


