<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Ficha Tabla cruzada</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="353879"></a><h3 class="newpage"> Ficha Tabla cruzada</h3>
<p><a name="353891"></a>Use la ficha Tabla cruzada para crear y dar formato a un objeto de tabla cruzada para el informe.</p><p><a name="353893"></a>Esta ficha tiene la misma funcionalidad que el cuadro de di&#225;logo Opciones de Grupo de Tabla cruzada.</p><a name="1000858151"></a><h5>Columnas</h5><p><a name="1000858152"></a>Esta lista muestra los campos que ha seleccionado como encabezados de columna para la tabla cruzada. Si tiene varios encabezados de columna, &#233;stos aparecer&#225;n en su informe en el orden en el que aparecen en esta lista. </p><p><a name="1000858153"></a>Para agregar un encabezado de columna a esta lista, seleccione un campo de la lista Campos disponibles y luego arr&#225;strelo a la lista o bien haga clic en el bot&#243;n Agregar columna.</p><a name="1000858154"></a><h5>Filas</h5><p><a name="1000858155"></a>Esta lista muestra los campos que ha seleccionado como encabezados de filas para la tabla cruzada. Si tiene varios encabezados de fila, &#233;stos aparecer&#225;n en su informe en el orden en que aparecen en esta lista. </p><p><a name="1000858156"></a>Para agregar un encabezado de fila a esta lista, seleccione un campo de la lista Campos disponibles y luego arr&#225;strelo a la lista o haga clic en el bot&#243;n Agregar fila.</p><a name="1000858157"></a><h5>Campos resumidos</h5><p><a name="1000858158"></a>Esta lista muestra los campos que ha seleccionado como encabezados de campos resumidos para la tabla cruzada. Si tiene varios encabezados de campos resumidos, &#233;stos aparecer&#225;n en su informe en el orden en el que aparecen en esta lista. </p><p><a name="1000858159"></a>Para agregar un encabezado de campo resumido a esta lista, seleccione un campo de la lista Campos disponibles y luego arr&#225;strelo a la lista o haga clic en el bot&#243;n Agregar campo resumido.</p><a name="1000858160"></a><h5>Campos disponibles</h5><p><a name="1000858161"></a>Esta lista muestra todas las tablas y campos que ha activado para usarlos en el informe. </p><p><a name="1000858162"></a>Seleccione el campo que desea usar y arr&#225;strelo a la lista apropiada o haga clic en el bot&#243;n Agregar que sea apropiado. Repita este proceso para agregar campos adicionales.</p><a name="1000858163"></a><h5>Agregar fila</h5><p><a name="1000858164"></a>Haga clic en este bot&#243;n para agregar encabezados de fila a la tabla cruzada. Los campos seleccionados en la lista Campos disponibles se desplazan a la lista Filas.</p><a name="1000858165"></a><h5>Agregar columna</h5><p><a name="1000858166"></a>Haga clic en este bot&#243;n para agregar encabezados de columna a la tabla cruzada. Los campos seleccionados en la lista Campos disponibles se desplazan a la lista Columnas.</p><a name="1000858167"></a><h5>Agregar campo resumido</h5><p><a name="1000858168"></a>Haga clic en este bot&#243;n para agregar campos resumidos a la tabla cruzada. Los campos seleccionados en la lista Campos disponibles se desplazan a la lista Campo resumido.</p><a name="1000858169"></a><h5>Quitar</h5><p><a name="1000858170"></a>Haga clic en este bot&#243;n para quitar el encabezado o campo resumido seleccionado de la tabla cruzada.</p><a name="1000858175"></a><h5>Opciones de grupo</h5><p><a name="1000858179"></a>Cuando hace clic en este bot&#243;n, aparece el cuadro de di&#225;logo Opciones de Grupo de Tabla cruzada. Use este cuadro de di&#225;logo si desea ingresar un grupo para la tabla cruzada. Las opciones de grupo s&#243;lo est&#225;n disponibles para filas y columnas.</p><a name="1000858180"></a><h5>Cambiar resumen</h5><p><a name="1000858184"></a>Cuando hace clic en este bot&#243;n, aparece el cuadro de di&#225;logo Cambiar operaci&#243;n de resumen. Use este cuadro de di&#225;logo para cambiar el tipo de resumen de los campos resumidos de la tabla cruzada. Esta opci&#243;n s&#243;lo est&#225; disponible para campos resumidos.</p><a name="1000858185"></a><h5>Nueva f&#243;rmula</h5><p><a name="1000858189"></a>Cuando hace clic en este bot&#243;n, aparece el cuadro de di&#225;logo Nombre de F&#243;rmula. Ingrese un nombre para la nueva f&#243;rmula y luego haga clic en Aceptar. Aparece el  Editor de F&#243;rmulas para que pueda crear la nueva f&#243;rmula.</p><a name="1000858193"></a><h5>Editar f&#243;rmula</h5><p><a name="1000858197"></a>Cuando hace clic en este bot&#243;n, aparece el Editor de F&#243;rmulas. Use el Editor para editar la f&#243;rmula seleccionada. Esta opci&#243;n s&#243;lo est&#225; disponible cuando un campo de f&#243;rmula est&#225; seleccionado en una de las listas.</p><a name="1000858203"></a><h5>Examinar</h5><p><a name="1000858204"></a>Use la opci&#243;n Examinar para ver los valores de un campo seleccionado en las listas Campos disponibles o Campo resumido.</p><a name="353895"></a><h6>Temas relacionados</h6><p><a name="353899"></a><a href="15_CrossTabs.html#53234">Objetos de Tablas Cruzadas</a></p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts16.html";
var next = "experts18.html";

function setTopicID() { 
      var number = "353879"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


