<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Vista de la opci&#243;n Avanzada </title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="1000781174"></a><h4 class="newpage"> Vista de la opci&#243;n Avanzada </h4><a name="1000781175"></a><h5>Campos disponibles</h5><p><a name="1000498667"></a>Esta lista muestra todos los campos disponibles que puede usar en el gr&#225;fico.</p><a name="1000498668"></a><h5>Cambio de</h5><p><a name="1000498669"></a>Use los botones A cambio de para agregar o quitar campos seleccionados de la lista A cambio de. Haga clic en el bot&#243;n Agregar (&gt;) para agregar campos seleccionados de la lista Campos disponibles a la lista A cambio de. Haga clic en el bot&#243;n Quitar (&lt;) para quitar campos de la lista A cambio de.</p><a name="1000498670"></a><h5>Evaluar</h5><p><a name="1000498671"></a>Use esta lista para determinar cu&#225;ndo debe aparecer un valor en el gr&#225;fico. Si selecciona "Para cada registro", el gr&#225;fico va a mostrar un valor para cada registro. Si selecciona "Para todos los registros", el gr&#225;fico va a mostrar un total para todos los registros. Si selecciona "A cambio de" y luego especifica un campo "a cambio de" al usar los botones Cambio de y la lista Campos disponibles, el gr&#225;fico va a mostrar un valor para cada cambio de ese campo.</p><a name="1000498672"></a><h5>cuadro de di&#225;logo Insertar grupoN Superiores</h5><p><a name="1000498673"></a>Haga clic en el bot&#243;n N Superiores para ordenar el campo seleccionado seg&#250;n N Superiores, N Inferiores u Organizar todo. Cuando hace clic en este bot&#243;n, aparece el Asistente de N Superiores/ordenamiento de grupo.</p><p><a name="1000498674"></a>Este bot&#243;n s&#243;lo se activa cuando se selecciona un solo campo en la lista A cambio de.</p><a name="1000498675"></a><h5>Orden</h5><p><a name="1000498676"></a>Haga clic en el bot&#243;n Orden para cambiar el orden del campo seleccionado. Cuando hace clic en este bot&#243;n, aparece el cuadro de di&#225;logo Insertar grupo.</p><p><a name="1000498677"></a>Este bot&#243;n s&#243;lo se activa cuando se selecciona un solo campo en la lista A cambio de.</p><a name="1000498678"></a><h5>Mostrar valor</h5><p><a name="1000498679"></a>Use los botones Mostrar valor para agregar o quitar el (los) campo(s) seleccionado(s) de la lista Mostrar valores. Haga clic en el bot&#243;n Agregar (&gt;) para agregar campos seleccionados de la lista Campos disponibles a la lista Mostrar valores. Haga clic en el bot&#243;n Quitar (&lt;) para quitar campos de la lista Mostrar valores.</p><a name="1000498680"></a><h5>Mostrar valores</h5><p><a name="1000498681"></a>Esta lista muestra el campo elegido como valor para su gr&#225;fico o diagrama. Se trazar&#225;n puntos para estos valores en el gr&#225;fico cada vez que cambie la condici&#243;n seleccionada en el cuadro de edici&#243;n A cambio de. Por ejemplo, si crea un gr&#225;fico de las ventas del &#250;ltimo a&#241;o para todos sus clientes, seleccionar&#225; el campo Nombre del cliente como condici&#243;n y el campo Ventas del &#250;ltimo a&#241;o como valor. Cada vez que cambie el Nombre del cliente, se trazar&#225; un punto de acuerdo al valor de sus ventas del &#250;ltimo a&#241;o.</p><a name="1000498682"></a><h5>Quitar (&lt;&lt;)</h5><p><a name="1000498683"></a>Haga clic en este bot&#243;n para quitar todos los campos de la lista Mostrar valores.</p><a name="1000498684"></a><h5>No resumir valores</h5><p><a name="1000498685"></a>Use la casilla de verificaci&#243;n No resumir valores para determinar si el programa debe resumir autom&#225;ticamente los valores que van a aparecer en el gr&#225;fico.</p><ul type="disc"><a name="1000498686"></a><li>Si selecciona esta casilla de verificaci&#243;n, el programa no va a resumir los valores.
<a name="1000498687"></a><li>Si no selecciona esta casilla de verificaci&#243;n, el programa va a resumir los valores de mapa y el bot&#243;n Establecer operaci&#243;n de resumen se va a activar. El programa agrega un campo de resumen a la lista de Valores de mapa.
</ul><a name="1000498688"></a><h5>Establecer operaci&#243;n de resumen</h5><p><a name="1000498689"></a>Use este bot&#243;n para establecer o cambiar la operaci&#243;n de resumen del campo seleccionado. Cuando hace clic en este bot&#243;n, aparece el cuadro de di&#225;logo Cambiar operaci&#243;n de resumen. Este bot&#243;n s&#243;lo se activa cuando la casilla de verificaci&#243;n No resumir valores no est&#225; marcada y ha seleccionado un campo en la lista Valores de mapa.</p><a name="1000498690"></a><h5>Examinar</h5><p><a name="1000498691"></a>Haga clic en este bot&#243;n para examinar los datos del campo seleccionado en la lista Campos disponibles.</p><a name="1000498692"></a><h6>Temas relacionados</h6><p><a name="1000498696"></a>Editar gr&#225;ficos usando el Asistente de gr&#225;fico </p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts36.html";
var next = "experts38.html";

function setTopicID() { 
      var number = "1000781174"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


