<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Asistente de resaltado</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="354824"></a><h2 class="newpage">Asistente de resaltado</h2><p><a name="354840"></a>El Asistente de resaltado le permite aplicar formato condicional en forma eficiente a campos monetarios y num&#233;ricos. El Asistente de resaltado se usa mayormente para destacar valores de campo que en alguna forma se distinguen de otros valores de un informe. Por ejemplo, si desea resaltar el campo {cliente.VENTAS DEL &Uacute;LTIMO A&Ntilde;O} en rojo cada vez que las ventas sean superiores a $25.000, podr&#237;a especificar en el Asistente de resaltado que, si el valor es superior a $25.000, se aplique un color rojo al fondo del campo. Puede tambi&#233;n usar el cuadro de di&#225;logo para establecer color de fuente y estilo de borde condicionales.</p><p><a name="354852"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Considere el Asistente de resaltado como una alternativa al Editor de f&#243;rmulas. Esencialmente, este asistente ejecuta la siguiente ecuaci&#243;n: Si la condici&#243;n es verdadera, entonces aplicar estas especificaciones de formato.</p>
<p><a name="354858"></a>Para este prop&#243;sito, el Asistente de resaltado est&#225; dividido en dos secciones: la secci&#243;n Lista de elementos (que muestra la f&#243;rmula) y el Editor de elementos (que le permite establecer la f&#243;rmula). El Editor de elementos incluye una vista de muestra para mostrar las especificaciones de formato aplicadas.</p><p><a name="354860"></a>Estos son algunos beneficios adicionales a considerar:</p><ul type="disc"><a name="354866"></a><li>El Asistente de resaltado tambi&#233;n puede ser &#250;til para campos num&#233;ricos o monetarios en tablas cruzadas.
<a name="354870"></a><li>Se puede deshacer el resaltado.
<a name="354874"></a><li>Tambi&#233;n se pueden establecer prioridades de resaltado.
</ul><a name="1000003055"></a><h5>Lista de elementos</h5><p><a name="354897"></a>La lista de elementos muestra las f&#243;rmulas de resaltado creadas para el campo actualmente seleccionado.</p><a name="354899"></a><h5>Prioridad</h5><p><a name="354901"></a>Use los botones Prioridad de la Lista de elementos del Asistente de resaltado y establezca prioridades para las f&#243;rmulas.</p><a name="354903"></a><h5>Quitar</h5><p><a name="354905"></a>Use el bot&#243;n Quitar para descartar f&#243;rmulas resaltadas no deseadas para el campo actualmente seleccionado.</p><a name="354907"></a><h5>Quitar todos</h5><p><a name="354909"></a>Use el bot&#243;n Quitar todos para descartar todas las f&#243;rmulas resaltadas para el campo actualmente seleccionado.</p><a name="354911"></a><h5>El valor es</h5><p><a name="354913"></a>Use esta lista para seleccionar un calificador para el n&#250;mero de valor monetario. Por ejemplo, puede aplicar un color rojo de fondo cuando el valor contenido en un campo sea igual a $25.000. En la lista El valor es, puede determinar el calificador 'igual a'.</p><a name="354915"></a><h5>Valores de campo</h5><p><a name="354917"></a>Use este cuadro de texto para ingresar el valor monetario o valor num&#233;rico al cual desea aplicar condiciones de resaltado. Por ejemplo, puede aplicar un color rojo de fondo mediante el Asistente de resaltado cuando el valor contenido en un campo sea igual a $25.000. En el cuadro de texto Valores<strong> </strong>de campo, escribir&#237;a 25.000.</p><a name="354919"></a><h5>Color de fuente</h5><p><a name="354921"></a>Use esta lista para seleccionar el color de fuente para el valor num&#233;rico o monetario al cual desea aplicar una condici&#243;n de resaltado.</p><a name="354923"></a><h5>Fondo</h5><p><a name="354925"></a>Use esta lista para seleccionar un color de fondo para el valor num&#233;rico o monetario al cual desea aplicar una condici&#243;n de resaltado.</p><a name="354927"></a><h5>Borde</h5><p><a name="354929"></a>Use esta lista para seleccionar un estilo de borde para el valor num&#233;rico o monetario al cual desea aplicar una condici&#243;n de resaltado.</p><a name="1000401399"></a><h5>Muestra</h5><p><a name="1000401400"></a>Aparece una muestra usando la configuraci&#243;n seleccionada en el asistente.</p><a name="1000421805"></a><h6>Temas relacionados</h6><p><a name="1000421809"></a><a href="11_format49.html#86412">Deshacer/Rehacer actividades</a></p><p><a name="1000421813"></a><a href="11_format48.html#86388">Formato condicional de los campos usando el Asistente de resaltado</a></p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts43.html";
var next = "experts45.html";

function setTopicID() { 
      var number = "354824"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


