<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Ficha Personalizar estilo (OLAP y Tabla cruzada)</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="1000856282"></a><h3 class="newpage"> Ficha Personalizar estilo (OLAP y Tabla cruzada)</h3>
<p><a name="1000856285"></a>Use la ficha Personalizar estilo para dar formato a una cuadr&#237;cula con color de fondo, l&#237;neas de cuadr&#237;cula y m&#225;rgenes de celda.</p><p><a name="1000856286"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>La ficha Personalizar estilo s&#243;lo da formato a las dimensiones principales de cuadr&#237;cula seleccionada en la ficha Filas/Columnas.</p>
<a name="1000856287"></a><h5>Columnas</h5><p><a name="1000856288"></a>Esta lista muestra la dimensi&#243;n y niveles usados como aspecto de columna en la cuadr&#237;cula.</p><a name="1000856289"></a><h5>Filas</h5><p><a name="1000856290"></a>Esta lista muestra la dimensi&#243;n y niveles usados como aspecto de fila en la cuadr&#237;cula.</p><a name="1000856291"></a><h5>Color de fondo</h5><p><a name="1000856292"></a>Use esta lista para seleccionar un color para el nivel seleccionado de fila o columna.</p><a name="1000856293"></a><h5>Alias para f&#243;rmulas</h5><p><a name="1000856294"></a>Escriba el alias para la dimensi&#243;n seleccionada. Es preferible usar nombres cortos de dimensi&#243;n al crear f&#243;rmulas de formato condicional.</p><a name="1000856295"></a><h5>Mostrar m&#225;rgenes de celdas</h5><p><a name="1000856296"></a>Seleccione esta casilla de verificaci&#243;n para ampliar los anchos de columna y mostrar as&#237; toda la cuadr&#237;cula. Si desactiva esta casilla de verificaci&#243;n, los anchos de columna ser&#225;n uniformes y parte de los datos quedar&#225;n ocultos detr&#225;s de la cuadr&#237;cula.</p><a name="1000856297"></a><h5>Aplicar sangr&#237;a a etiquetas de fila</h5><p><a name="1000856298"></a>Seleccione esta casilla de verificaci&#243;n y luego escriba la medida de sangr&#237;a para las etiquetas de fila en el cuadro correspondiente. &Eacute;sta puede tener hasta dos p&#225;ginas de largo.</p><p><a name="1000856299"></a>Cuando especifica una sangr&#237;a, todas las etiquetas de fila tendr&#225;n una sangr&#237;a igual, excepto la etiqueta del miembro de entrada del primer nivel.</p><a name="1000856300"></a><h5>Repetir etiquetas de fila</h5><p><a name="1000856301"></a>Seleccione esta cuadr&#237;cula de verificaci&#243;n para repetir etiquetas de fila en cada p&#225;gina para las cuadr&#237;culas que se impriman a lo ancho en m&#225;s de una p&#225;gina.</p><a name="1000856302"></a><h5>Mantener columnas juntas</h5><p><a name="1000856303"></a>Seleccione esta cuadr&#237;cula de verificaci&#243;n para juntar las columnas en cada p&#225;gina para las cuadr&#237;culas que se impriman a lo ancho en m&#225;s de una p&#225;gina.</p><a name="1000856304"></a><h5>Totales de filas en la parte superior</h5><p><a name="1000856305"></a>Seleccione esta casilla de verificaci&#243;n para mostrar los totales en la parte superior (en relaci&#243;n al miembro de entrada de fila correspondiente).</p><a name="1000856306"></a><h5>Totales de columna a la izquierda</h5><p><a name="1000856307"></a>Seleccione esta casilla de verificaci&#243;n para mostrar los totales a la izquierda (en relaci&#243;n al miembro de entrada de columna correspondiente).</p><a name="1000856308"></a><h5>Suprimir filas vac&#237;as</h5><p><a name="1000856309"></a>Seleccione esta casilla de verificaci&#243;n para suprimir filas vac&#237;as para el objeto de cuadr&#237;cula OLAP. Si desactiva la casilla de verificaci&#243;n, las filas vac&#237;as aparecer&#225;n en el objeto de cuadr&#237;cula OLAP.</p><a name="1000856310"></a><h5>Suprimir columnas vac&#237;as</h5><p><a name="1000856311"></a>Seleccione esta casilla de verificaci&#243;n para suprimir columnas vac&#237;as para el objeto de cuadr&#237;cula OLAP. Si desactiva la casilla de verificaci&#243;n, las columnas vac&#237;as aparecer&#225;n en el objeto de cuadr&#237;cula OLAP.</p><a name="1000856312"></a><h5>Dar formato a l&#237;neas de cuadr&#237;cula</h5><p><a name="1000856313"></a>Haga clic en este bot&#243;n para especificar la configuraci&#243;n de las l&#237;neas de cuadr&#237;cula en el cuadro de di&#225;logo Dar formato a l&#237;neas de cuadr&#237;cula.</p><p><a name="1000856335"></a>Especifique la cantidad de espacio entre el borde izquierdo de la p&#225;gina del informe y la etiqueta en el cuadro Espacio horizontal.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts23.html";
var next = "experts25.html";

function setTopicID() { 
      var number = "1000856282"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


