<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Ficha Organizaci&#243;n</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="1000734403"></a><h3 class="newpage"> Ficha Organizaci&#243;n</h3>
<p><a name="1000734405"></a>La ficha Organizaci&#243;n aparece cuando ha seleccionado la secci&#243;n de detalles y est&#225; marcada la casilla Formato de columnas m&#250;ltiples en la ficha Com&#250;n. </p><p><a name="1000083958"></a>Use la ficha Organizaci&#243;n para configurar el informe en un formato de columnas m&#250;ltiples. Es decir, en lugar de hacer que los datos se impriman hacia abajo en la p&#225;gina, se pueden establecer columnas m&#250;ltiples y hacer que los datos fluyan de una columna a otra. Tambi&#233;n puede hacer que sus datos se impriman a lo ancho y luego hacia abajo en la p&#225;gina, imprimiendo un registro en cada columna, luego imprimiendo un segundo registro en cada columna, luego un tercero, etc. El cuadro de di&#225;logo se divide en cuadro cuadros m&#225;s peque&#241;os.</p><a name="1000083873"></a><h5>Tama&#241;o de detalles</h5><p><a name="1000083874"></a>Este cuadro le permite especificar las dimensiones (alto y ancho) de un detalle. Determine el ancho para cada detalle (seg&#250;n un n&#250;mero de caracteres, tama&#241;o de fuente, etc.) e ingrese ese valor en el cuadro de edici&#243;n Ancho.</p><p><a name="1000083875"></a>Determine el alto para cada detalle (seg&#250;n un n&#250;mero de l&#237;neas en el detalle, tama&#241;o de fuente, etc.) e ingrese ese valor en el cuadro de edici&#243;n Alto.</p><a name="1000083876"></a><h5>Espacio entre detalles</h5><p><a name="1000083877"></a>Este cuadro le permite especificar el &#225;rea vac&#237;a (espacio, medianil, etc.) que desea dejar entre detalles. Horizontal = espacio entre detalles a lo ancho de la p&#225;gina; Vertical = espacio entre los detalles a lo largo de la p&#225;gina.</p><p><a name="1000083878"></a>Determine los espacios que desea dejar. Ingrese el espacio horizontal en el cuadro de edici&#243;n Horizontal e ingrese el espacio vertical en el cuadro de edici&#243;n Vertical.</p><a name="1000083879"></a><h5>Direcci&#243;n de impresi&#243;n</h5><p><a name="1000083880"></a>El cuadro Direcci&#243;n de impresi&#243;n le permite especificar la ruta que sigue el programa al imprimir los detalles en una p&#225;gina de informe. Sus opciones son:</p><ul type="disc"><a name="1000083881"></a><li>A lo ancho y luego hacia abajo<strong> </strong>
<p class="indent"><a name="1000371111"></a>Imprime detalles a lo ancho de las columnas, un detalle en la primera columna, otro en la siguiente, otro en la siguiente, etc. Luego, cuando todas las columnas tienen un detalle, el programa avanza en la p&#225;gina e imprime un segundo detalle en la primera columna, luego en la segunda, etc. </p><a name="1000083882"></a><li>Hacia abajo y luego a lo ancho<strong> </strong>
<p class="indent"><a name="1000371112"></a>Imprime detalles hacia abajo en la primera columna, luego hacia abajo en la segunda columna, etc.</p></ul><a name="1000083883"></a><h5>Dar formato a grupos con columnas m&#250;ltiples</h5><p><a name="1000083884"></a>Seleccione esta casilla de verificaci&#243;n si desea que el programa de formato a grupos con columnas m&#250;ltiples usando las opciones Ancho, Espacio entre detalles y Direcci&#243;n de impresi&#243;n especificadas para la secci&#243;n seleccionada.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts64.html";
var next = "experts66.html";

function setTopicID() { 
      var number = "1000734403"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


