<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Vista de la opci&#243;n Avanzada</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="1000498419"></a><h4 class="newpage"> Vista de la opci&#243;n Avanzada</h4><p><a name="1000508232"></a>Use la vista de la opci&#243;n Avanzada cuando tenga valores m&#250;ltiples de mapa, en lugar de uno s&#243;lo, o cuando no tenga ning&#250;n grupo ni res&#250;menes en el informe. Con el dise&#241;o avanzado puede determinar qu&#233; campos se usan para el desglose geogr&#225;fico, el valor A cambio de y el valor de mapa. Tambi&#233;n puede establecer opciones de resumen.</p><p><a name="1000075823"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Debe crear un mapa sobre un campo geogr&#225;fico, como un pa&#237;s, regi&#243;n o ciudad. El programa no puede generar un mapa bas&#225;ndose en un campo no geogr&#225;fico.</p>
<a name="1000527460"></a><h5>Campos disponibles</h5><p><a name="1000527461"></a>La lista Campos disponibles le permite seleccionar qu&#233; campos usar como datos para el mapa.</p><a name="1000527569"></a><h5>Examinar</h5><p><a name="1000527570"></a>Haga clic en el bot&#243;n Examinar para visualizar los datos contenidos en el campo seleccionado en la lista Campos disponibles.</p><a name="1000527591"></a><h5>Agregar</h5><p><a name="1000527592"></a>Haga clic en el bot&#243;n Agregar (&gt;) para copiar campos de la lista Campos disponibles al cuadro de texto Campo geogr&#225;fico, al cuadro de texto A cambio de o a la lista Valores de mapa.</p><a name="1000527593"></a><h5>Quitar</h5><p><a name="1000527594"></a>Haga clic en el bot&#243;n Quitar (&lt;) para eliminar un campo seleccionado de la lista Valores de mapa.</p><a name="1000527595"></a><h5>Quitar todos</h5><p><a name="1000527596"></a>Haga clic en el bot&#243;n Quitar todos (&lt;&lt;) para eliminar todos los campos de la lista Valores de mapa.</p><a name="1000527509"></a><h5>Campo geogr&#225;fico</h5><p><a name="1000527510"></a>Use el cuadro de texto Campo geogr&#225;fico para determinar el desglose geogr&#225;fico del mapa. Por ejemplo, si inserta el campo Pa&#237;s.Cliente en el cuadro de texto Campo geogr&#225;fico, el mapa va a mostrar valores para cada pa&#237;s. Si inserta el campo Regi&#243;n.Cliente, el mapa va a mostrar valores para cada regi&#243;n.</p><a name="1000527511"></a><h5>A cambio de</h5><p><a name="1000527693"></a>Use la lista A cambio de para especificar un campo a usar como condici&#243;n para la visualizaci&#243;n de un campo de resumen. Los valores de resumen se mostrar&#225;n cada vez que cambie el valor en el campo de condici&#243;n.</p><a name="1000527534"></a><h5>Valores de mapa</h5><p><a name="1000527535"></a>Use la lista Valores de mapa para crear una lista de todos los campos que desea que aparezcan como valores en el mapa.</p><a name="1000527552"></a><h5>No resumir valores</h5><p><a name="1000527553"></a>Use la casilla de verificaci&#243;n No resumir valores para determinar si el programa debe resumir autom&#225;ticamente los valores que van a aparecer en el mapa.</p><ul type="disc"><a name="1000527554"></a><li>Si selecciona esta casilla de verificaci&#243;n, el programa no resumir&#225; los valores.
<a name="1000527555"></a><li>Si no selecciona esta casilla de verificaci&#243;n, el programa resumir&#225; los valores del mapa y el bot&#243;n Establecer operaci&#243;n de resumen se activar&#225;. El programa agrega un campo de resumen a la lista Valores de mapa.
</ul><a name="1000527556"></a><h5>Establecer operaci&#243;n de resumen</h5><p><a name="1000527557"></a>Use este bot&#243;n para establecer o cambiar la operaci&#243;n de resumen del campo seleccionado. Cuando hace clic en este bot&#243;n, aparece el cuadro de di&#225;logo Cambiar operaci&#243;n de resumen. Este bot&#243;n s&#243;lo se activa cuando la casilla de verificaci&#243;n No resumir valores no est&#225; marcada y cuando ha seleccionado un campo en la lista Valores de mapa.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts50.html";
var next = "experts52.html";

function setTopicID() { 
      var number = "1000498419"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


