<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Vista de la opci&#243;n En rangos </title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="1000422080"></a><h4 class="newpage"> Vista de la opci&#243;n En rangos </h4><p><a name="1000585235"></a>Un mapa en rangos desglosa los datos en rangos, asigna un color espec&#237;fico a cada rango y luego codifica las &#225;reas geogr&#225;ficas del mapa por color con el fin de mostrar el rango. Puede usar un mapa en rangos para mostrar cifras de ventas en un rango de intervalos iguales. Puede entonces usar tonos de colores para codificar regiones de ventas de acuerdo a dichas cifras. Este tipo de mapa es &#250;til para determinar regiones con las ventas m&#225;s altas simplemente mirando el color que exhiben. </p><a name="1000585237"></a><h5>N&#250;mero de intervalos</h5><p><a name="1000585238"></a>Use este cuadro de texto para ingresar el n&#250;mero de intervalos que desea usar como rango. El mapa y la leyenda cambian de acuerdo a estos valores. Puede ingresar un n&#250;mero entre 1 y 16. El n&#250;mero predeterminado es 5. </p><a name="1000585240"></a><h5>M&#233;todo de distribuci&#243;n</h5><p><a name="1000585241"></a>Use esta lista para asignar intervalos de rango de forma tal que los valores calcen con uno de los criterios disponibles: </p><ul type="disc"><a name="1000585243"></a><li>La cuenta es igual
<p class="indent"><a name="1000585244"></a>Asigna intervalos de forma que el mismo n&#250;mero de regiones (o un n&#250;mero lo m&#225;s cercano posible de regiones) aparezca en cada intervalo. </p><a name="1000585245"></a><li>Los rangos son iguales
<p class="indent"><a name="1000585246"></a>Asigna intervalos de modo que los valores de resumen en cada intervalo sean iguales num&#233;ricamente. </p><a name="1000585247"></a><li>Interrupci&#243;n natural
<p class="indent"><a name="1000585248"></a>Asigna intervalos usando un algoritmo que intenta minimizar la diferencia entre los valores de resumen y el promedio de los valores de resumen para cada intervalo. </p><a name="1000585249"></a><li>Desviaci&#243;n est&#225;ndar
<p class="indent"><a name="1000585250"></a>Asigna intervalos de modo que el intervalo intermedio se interrumpa en la media (o promedio) de los valores de datos y los intervalos superiores o inferiores al rango intermedio sean un est&#225;ndar de desviaci&#243;n superior o inferior a la media. La desviaci&#243;n est&#225;ndar es la ra&#237;z cuadrada de la varianza. Esta opci&#243;n proyecta cu&#225;nto se desv&#237;an diversos valores en un conjunto de valores de la media del conjunto.</p></ul><a name="1000585251"></a><h5>Color del intervalo m&#225;s alto</h5><p><a name="1000585252"></a>Use esta lista para seleccionar el color que desea usar para el intervalo m&#225;s alto (m&#225;s grande) en el rango. Este color se transforma en el extremo superior del rango de color. </p><a name="1000585254"></a><h5>Color del intervalo m&#225;s bajo</h5><p><a name="1000585255"></a>Use esta lista para seleccionar el color que desea usar para el intervalo m&#225;s bajo (m&#225;s peque&#241;o) en el rango. Este color se transforma en el extremo inferior del rango de color. </p><a name="1000585257"></a><h5>Permitir intervalos vac&#237;os</h5><p><a name="1000585258"></a>Seleccione esta casilla de verificaci&#243;n si desea ver intervalos vac&#237;os del mapa en rangos. Esta opci&#243;n se selecciona en forma predeterminada. </p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts55.html";
var next = "experts57.html";

function setTopicID() { 
      var number = "1000422080"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


