<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>

<title>Asistente de v&#237;nculo visual</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="1000120147"></a><h2 class="newpage">Asistente de v&#237;nculo visual</h2><p><a name="1000120149"></a>Puede v&#237;ncular bases de datos de modo que registros de una base de datos coincidan con registros relacionados de otra. Por ejemplo, si activa una base de datos Pel&#237;culas y una base de datos Estudio, puede vincular las bases de datos de modo que cada pel&#237;cula (de la base de datos Pel&#237;culas) pueda coincidir con el estudio que la film&#243; (de la base de datos Ecomando Agregar base de datos al informestudio).</p><p><a name="1000120150"></a>Cuando vincula, se usa un campo que sea com&#250;n a ambas bases de datos. El programa usa el v&#237;nculo para hacer coincidir registros de una base de datos con aquellos de otra. En este ejemplo, el v&#237;nculo garantiza que los datos de cada fila del informe se refieran a la misma pel&#237;cula.</p><p><a name="1000120152"></a>Use V&#237;nculo visual para vincular dos o m&#225;s bases de datos. Cuando elige el comando Agregar base de datos al informe del men&#250; Base de datos y selecciona una base de datos adicional, aparece el Asistente de v&#237;nculo visual y muestra la base de datos adicional.cuadro de di&#225;logo Elegir Tablas para usar en V&#237;nculo Visual</p><a name="1000120155"></a><h5>V&#237;nculo visual</h5><p><a name="1000120156"></a>Este cuadro de desplazamiento muestra todas las tablas actualmente en su informe, junto con todos los v&#237;nculos e &#237;ndices.</p><a name="1000130151"></a><h5>Tablas</h5><p><a name="1000130152"></a>Cuando hace clic en este bot&#243;n, aparece el cuadro de di&#225;logo Elegir Tablas para usar en V&#237;nculo Visual donde puede elegir las tablas que desea vincular en su informe y si se usa un v&#237;nculo inteligente.</p><a name="1000130153"></a><h5>Organizar tablas</h5><p><a name="1000130154"></a>Cuando hace clic en este bot&#243;n, el programa organiza las tablas para que se ajusten de la forma m&#225;s eficiente dentro del cuadro de desplazamiento V&#237;nculo visual.cuadro de di&#225;logo Opciones de v&#237;nculo</p><a name="1000130166"></a><h5>V&#237;nculo</h5><p><a name="1000130167"></a>Haga clic en Por nombre para vincular tablas seg&#250;n sus nombres o Por clave para usar informaci&#243;n de clave externa. Haga clic en V&#237;nculo para vincular autom&#225;ticamente las tablas.</p><a name="1000130188"></a><h5>Borrar v&#237;nculos</h5><p><a name="1000130186"></a>Haga clic en este bot&#243;n para borrar todos los v&#237;nculos de tablas actuales.</p><a name="1000120157"></a><h5>Opciones de v&#237;nculo</h5><p><a name="1000120158"></a>Para activar este bot&#243;n, debe haber seleccionado una l&#237;nea de v&#237;nculo. Una vez que tiene seleccionado un v&#237;nculo, haga clic en este bot&#243;n para abrir el cuadro de di&#225;logo Opciones de v&#237;nculo donde puede elegir el tipo de &#237;ndice, permitir coincidencias parciales de texto, etc. para el v&#237;nculo seleccionado.</p><a name="1000120159"></a><h5>Eliminar v&#237;nculo</h5><p><a name="1000130029"></a>Haga clic en un v&#237;nculo y luego haga clic en este bot&#243;n para eliminarlo.</p><p><a name="1000120788"></a></p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts65.html";
var next = "glossary.html";

function setTopicID() { 
      var number = "1000120147"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


