<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Ficha Com&#250;n</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="1000083824"></a><h3 class="newpage"> Ficha Com&#250;n</h3>
<p><a name="1000083827"></a>Use la ficha Com&#250;n para establecer propiedades tales como: visible, nueva p&#225;gina antes, mantener juntos, etc. para una secci&#243;n deseada.</p><a name="1000083832"></a><h5>Ubicaci&#243;n en modo libre</h5><p><a name="1000083833"></a>Cuando selecciona esta casilla de verificaci&#243;n, el programa le permite ubicar objetos en un entorno de modo libre similar al de un programa de dibujo. Cuando no se selecciona esta opci&#243;n, los objetos se ubican en puntos fijos usando una cuadr&#237;cula subyacente que se puede modificar de acuerdo a sus especificaciones (vea Ficha Dise&#241;o).</p><a name="1000083834"></a><h5>Ocultar (se permite profundizar)</h5><p><a name="1000083835"></a>Seleccione esta casilla de verificaci&#243;n si no desea que la secci&#243;n se imprima, pero desea que el contenido de la secci&#243;n est&#233; disponible para su profundizaci&#243;n.</p><a name="1000083836"></a><h5>Suprimir (no profundizar)</h5><p><a name="1000083837"></a>Seleccione esta casilla de verificaci&#243;n si desea que la secci&#243;n se imprima, pero no desea que el contenido de la secci&#243;n est&#233; disponible para su profundizaci&#243;n.</p><a name="1000083838"></a><h5>Imprimir al final de p&#225;gina</h5><p><a name="1000083839"></a>Esta casilla de verificaci&#243;n hace que cada valor de grupo se imprima s&#243;lo al final de una p&#225;gina. (Los detalles se siguen imprimiendo en sus posiciones normales.) El comando es &#250;til para imprimir facturas y otros informes donde se desea que aparezca un s&#243;lo grupo (es decir, elementos de l&#237;nea agrupados por n&#250;mero de pedido) en una p&#225;gina y que se imprima el valor de ese grupo (subtotal, campo de resumen, etc.) s&#243;lo al final de la p&#225;gina.</p><a name="1000083840"></a><h5>Nueva p&#225;gina antes</h5><p><a name="1000083841"></a>La opci&#243;n Nueva p&#225;gina antes es una propiedad de formato disponible para secciones de grupo (encabezado y pie de p&#225;gina) y de detalles. Cuando selecciona esta opci&#243;n, el programa inserta un salto de p&#225;gina antes de imprimir la secci&#243;n. El salto de p&#225;gina, por lo tanto, va antes:</p><ul type="disc"><a name="1000083842"></a><li>Del grupo (si se usa la opci&#243;n con una secci&#243;n de pie de p&#225;gina de grupo)
<a name="1000083843"></a><li>De cada registro de informe (si se usa la opci&#243;n con una secci&#243;n de detalles)
</ul><p><a name="1000083844"></a>El encabezado y pie de p&#225;gina aparecen en cada p&#225;gina. Si tiene un campo de subtotal o de resumen en una secci&#243;n de pie de p&#225;gina de grupo, puede usar la opci&#243;n Nueva p&#225;gina antes para poner estos valores en las p&#225;ginas que siguen al valor que se est&#225; totalizando.</p><a name="1000083845"></a><h5>Nueva p&#225;gina despu&#233;s</h5><p><a name="1000083846"></a>Cuando se selecciona esta casilla de verificaci&#243;n, el programa inserta un salto de p&#225;gina despu&#233;s de imprimir la secci&#243;n.</p><ul type="disc"><a name="1000083847"></a><li>El encabezado y pie de p&#225;gina aparecen en cada p&#225;gina.
<a name="1000083848"></a><li>Use Nueva p&#225;gina despu&#233;s en la secci&#243;n de nota al pie de grupo para imprimir cada grupo en una p&#225;gina separada.
</ul><a name="1000083849"></a><h5>Reiniciar n&#250;mero de p&#225;gina despu&#233;s</h5><p><a name="1000083850"></a>Restablece el n&#250;mero de p&#225;gina a uno (1) para la p&#225;gina siguiente, despu&#233;s de imprimir un total de grupo. Cuando se usa esta opci&#243;n en conjunto con Imprimir al pie de la p&#225;gina, el programa imprime un s&#243;lo grupo en una p&#225;gina, imprime el valor de grupo al pie de la p&#225;gina y restablece el n&#250;mero de p&#225;gina a 1 para la pr&#243;xima p&#225;gina. Esta opci&#243;n es &#250;til cuando se est&#225;n imprimiendo registros m&#250;ltiples de un s&#243;lo archivo (es decir, facturas) y desea que cada informe se numere comenzando con P&#225;gina 1.</p><a name="1000083854"></a><h5>Mantener juntos</h5><p><a name="1000083855"></a>Cuando se selecciona esta casilla de verificaci&#243;n, el programa mantiene todas las l&#237;neas de la secci&#243;n juntas, ya sea en la p&#225;gina actual (si hay espacio) o en la pr&#243;xima (si no hay). </p><p><a name="1000083856"></a>En una lista de clientes, por ejemplo, los datos sobre un solo cliente (desde un solo registro o registros vinculados) pueden extenderse varias l&#237;neas. Si el salto de p&#225;gina est&#225;ndar cae dentro de los datos de un cliente, los datos se separan, quedando parte en una p&#225;gina, parte en la siguiente. Pero con la opci&#243;n Mantener juntos, el programa inserta el salto de p&#225;gina antes de que comience el registro, de modo que todos los datos se imprimen juntos, en la p&#225;gina siguiente.</p><p><a name="1000083857"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Esta opci&#243;n no funciona con cadenas de l&#237;neas m&#250;ltiples o campos de memor&#225;ndum. Un salto de p&#225;gina puede ocurrir en medio de un campo de l&#237;neas m&#250;ltiples.</p>
<a name="1000083858"></a><h5>Suprimir secci&#243;n en blanco</h5><p><a name="1000083859"></a>Cuando selecciona esta casilla de verificaci&#243;n, el programa oculta la secci&#243;n del informe si est&#225; en blanco y la imprime si no es as&#237;.</p><a name="1000083860"></a><h5>Subyacer la secci&#243;n siguiente</h5><p><a name="1000083861"></a>Seleccione esta casilla de verificaci&#243;n si desea que el objeto seleccionado subyazga las secciones siguientes cuando se impriman.</p><a name="1000083862"></a><h5>Formato de columnas m&#250;ltiples</h5><p><a name="1000083863"></a>Cuando selecciona esta opci&#243;n, aparece la  <a href="experts65.html#1000734403">Ficha Organizaci&#243;n</a>.</p>
<hr><br>

<script  language="JavaScript"><!--

var prev = "experts63.html";
var next = "experts65.html";

function setTopicID() { 
      var number = "1000083824"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


