<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Glosario</title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="114761"></a><h1>Glosario</h1><a name="114762"></a><h4>Acceso
</h4><p><a name="10243"></a>Tener acceso a datos significa recuperar datos.</p><a name="10509"></a><h4>Acrobat Reader
</h4><p><a name="10510"></a>Programa usado para revisar e imprimir manuales en l&#237;nea.</p><a name="11016"></a><h4>Active Server Page (P&#225;gina activa del Servidor)
</h4><p><a name="11276"></a>Active Server Pages son p&#225;ginas de web que operan en el Internet Information Server (IIS) (Servidor de Informaci&#243;n Internet) de Microsoft versi&#243;n 3.0 o una m&#225;s reciente. Active Server Pages combina HTML, VBScript o Jscript y controles ActiveX para crear p&#225;ginas web din&#225;micas que se pueden ver con los exploradores de web m&#225;s populares. Crystal Report Engine Automation Server, el control Crystal Design<nobr>-T</nobr>ime Active X y Crystal Active Data Driver pueden combinarse para generar sitios web activos en Microsoft Visual InterDev que muestra informes de un sitio Internet o intranet.</p><a name="12468"></a><h4>Ajuste de l&#237;nea
</h4><p><a name="12458"></a>Ajuste de l&#237;nea es una propiedad de tipo de procesador de texto que autom&#225;ticamente mueve una palabra a la siguiente l&#237;nea cuando la palabra es demasiado larga para ajustarse al espacio disponible en la l&#237;nea actual.</p><a name="12952"></a><h4>Alias
</h4><p><a name="12953"></a>Un alias es un nombre alternativo asignado a una base de datos. Si una base de datos se llama CLIENTE.DB, por ejemplo, se puede asignar el alias cliente, empresa, DB1, o alg&#250;n otro nombre que se ajuste a sus necesidades. Los alias hacen m&#225;s f&#225;cil usar un informe creado con una base de datos cuyo nombre y/o ubicaci&#243;n ha cambiado desde que se creo el informe.</p><a name="13348"></a><h4>Ancho de campo
</h4><p><a name="13349"></a>El ancho de campo es el tama&#241;o del campo en la base de datos original. Un ancho de campo generalmente es fijo, y los valores en el campo pueden llenar todo o solamente una parte del ancho asignado. El programa incluye funciones Trim (de Ajuste) para quitar el espacio en blanco excesivo de los valores de campo que no llenan sus campos respectivos.</p><a name="13742"></a><h4>Anidar
</h4><p><a name="13743"></a>En Seagate Crystal Reports, anidar significa utilizar una expresi&#243;n "If<nobr>-T</nobr>hen<nobr>-E</nobr>lse" dentro de otra. Por ejemplo, "If" (Si) el grado acad&#233;mico de los empleados no es doctor "Then" (Entonces) (si el sexo del empleado es masculino, utilice el saludo Estimado Sr. "Else" (De lo contrario) utilice el saludo Estimada Sra./Srta). "Else" (De lo contrario) utilice el saludo Estimado Dr. En este ejemplo, la expresi&#243;n anidada "If<nobr>-T</nobr>hen<nobr>-E</nobr>lse" est&#225; entre par&#233;ntesis. El ejemplo dice: revisar el campo de grado acad&#233;mico en el registro de empleado para cerciorarse que el empleado no es doctor. Si esa condici&#243;n es verdadera (el empleado no es doctor) entonces se utiliza un saludo de carta basado en el sexo indicado en el registro del empleado. (Si es masculino, entonces utiliza un saludo para el g&#233;nero masculino. Si no [si es femenino] utiliza un saludo para el g&#233;nero femenino). Si no (esto es, si el empleado es un doctor) utiliza un saludo para Dr. Al utilizar este tipo de construcci&#243;n de f&#243;rmula, usted puede crear un conjunto m&#225;s amplio de condiciones y consecuencias m&#225;s f&#225;cil de lo que podr&#237;a hacerlo sin la funci&#243;n anidar.</p><a name="14087"></a><h4>Archivo
</h4><p><a name="14088"></a>Un archivo es un grupo de datos relacionados almacenados bajo un solo nombre. En Seagate Crystal Reports, cada informe es almacenado como un archivo &#250;nico.</p><a name="82325"></a><h4>Archivo de interfaz de conversi&#243;n
</h4><p><a name="82326"></a>Un archivo de interfaz de conversi&#243;n (con extensi&#243;n .cif) es el archivo donde el programa guarda las instrucciones de formato y resalte de la herramienta de Importaci&#243;n de Documentos. Cuando usted resalta algo en la herramienta de Importaci&#243;n de Documentos y establece las propiedades de los campos de base de datos, estas propiedades son guardadas en el archivo .cif. Use este archivo para r&#225;pidamente dar formato despu&#233;s al mismo informe sin tener que resaltar.</p><a name="14479"></a><h4>Area
</h4><p><a name="14480"></a>Una &#225;rea es un grupo de secciones similares (por ejemplo, Detalles A y Detalles B) que comparten las mismas caracter&#237;sticas pero pueden ser formateados en forma diferente.</p><a name="14513"></a><h4>Area detalles
</h4><p><a name="14514"></a>Grupo de una o m&#225;s secciones Detalles (por ejemplo, Detalles A, Detalles B, etc.).</p><a name="15169"></a><h4>Argumento
</h4><p><a name="15170"></a>Un argumento es un elemento o uno de un grupo de elementos, que recibe la acci&#243;n de una funci&#243;n. Proporciona la informaci&#243;n que la funci&#243;n necesita para operar. La funci&#243;n Truncate (truncar), por ejemplo, no puede operar por s&#237; misma. Necesita un argumento que identifique el elemento a ser truncado. As&#237;, en la f&#243;rmula:</p><a name="15171"></a><p class="indent"><code>Truncate ({pedidos.MONTO DEL PEDIDO})</code></p><p class="indent"><a name="15172"></a>&#171;Donde Truncar es la funci&#243;n y {pedidos.MONTO DEL PEDIDO} es el argumento, el valor del campo{pedidos.MONTO DEL PEDIDO} es el elemento a ser truncado&#187;.</p><a name="15782"></a><h4>Arrastrar
</h4><p><a name="15783"></a>Arrastrar significa diferentes cosas dependiendo del contexto:</p><ul type="disc"><a name="15784"></a><li>Cuando se refiere a mover un campo, arrastrar significa hacer clic en el cuadro del campo y manteniendo el bot&#243;n apretado, mover el campo a una nueva posici&#243;n utilizando el mouse. Suelte el bot&#243;n del mouse cuando el campo este en la posici&#243;n deseada.
<a name="15785"></a><li>Cuando se refiere a cambiar de tama&#241;o un campo, arrastrar significa hacer clic en uno de los controles de cuadro de campo y, manteniendo el bot&#243;n apretado, agrandar o achicar el campo utilizando el mouse. Suelte el bot&#243;n cuando el campo est&#233; del tama&#241;o deseado.
<a name="15786"></a><li>Cuando se refiere a formatear texto, arrastrar significa seleccionar o resaltar el texto de inter&#233;s moviendo el cursor "I" sobre el texto mientras aprieta el bot&#243;n. Suelte el bot&#243;n cuando ha terminado de seleccionar.
</ul><a name="16206"></a><h4>Asistente
</h4><p><a name="16207"></a>Seagate Crystal Reports le ofrece varios Asistentes. Los asistentes son herramientas que lo llevan paso a paso por varios aspectos de la creaci&#243;n de informes. En la mayor&#237;a de los casos los asistentes tienen una serie de fichas numeradas. Simplemente empiece en el paso uno y siga hasta el &#250;ltimo. Cuando haya finalizado el &#250;ltimo paso, el Asistente har&#225; el resto del trabajo por usted. &#161;As&#237; de f&#225;cil!</p><p><a name="102371"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>El t&#233;rmino "asistente" (Expert) en Seagate Crystal Reports es equivalente al t&#233;rmino "asistente"(Wizard) en Microsoft Access.</p>
<a name="79456"></a><h4>Asistente de Mapas
</h4><p><a name="79457"></a>El Asistente de Mapas es una herramienta poderosa que le permite organizar sus datos con la ubicaci&#243;n de mapas geogr&#225;ficos en un informe. Usted puede traspasar en estos mapas para ver los datos subyacentes.</p><a name="79824"></a><h4>Asistente de Resalte
</h4><p><a name="79825"></a>El Asistente de Resalte se usa m&#225;s com&#250;nmente para resaltar valores de campo de n&#250;meros o de monedas que de alguna manera se distinguen de los otros valores en el informe. Este Asistente ofrece un amplio rango de formatos condicionales, los cuales incluyen el color de la fuente, color de fondo y estilo de bordes.</p><p><a name="79826"></a>Usted puede considerar el asistente de Resalte como un editor de f&#243;rmulas avanzado que ejecuta la siguiente ecuaci&#243;n: Si la condici&#243;n se cumple, s&#243;lo entonces aplique estas especificaciones de formato.</p><a name="16526"></a><h4>Atributo
</h4><p><a name="77664"></a>Atributo es una cualidad asignada a un objeto (por ejemplo, tama&#241;o de letra, color, etc.).</p><a name="16528"></a><h4>Auto arreglar
</h4><p><a name="16529"></a>Cuando usted ubica un campo en su informe, el programa reserva un espacio igual al ancho del campo especificado en su base de datos. A menudo el ancho de ese campo es bastante m&#225;s grande que los valores que realmente aparecen en cada uno de los campos. Para tener informes que se luzcan mejor, a menudo es necesario cambiar el tama&#241;o de los campos, de manera que el espacio reservado coincida mejor con el tama&#241;o de los valores de los campos. Una vez hecho esto, a menudo debe reubicar el campo para que el informe se vea bien.</p><p><a name="52085"></a>Auto Arreglar lo har&#225; por usted. Simplemente seleccione el comando Auto Arreglar el Informe del men&#250; Formato.</p><a name="16649"></a><h4>Barra de formato
</h4><p><a name="52703"></a>La barra que muestra los botones para hacer clic y as&#237; realizar frecuentes y variadas tareas de formato.</p><a name="52704"></a><h4>Barra de herramientas
</h4><p><a name="17387"></a>Es una barra localizada en la parte superior de la ventana de Seagate Crystal Reports la cual contiene varios botones sobre los que puede hacer clic para activar los comandos usados con m&#225;s frecuencia.</p><a name="17533"></a><h4>Barras de desplazamiento
</h4><p><a name="17534"></a>Algunas veces una ventana muestra solo parte de un documento. En tal caso, la ventana incluye barras de desplazamiento que se usan para moverse a otras partes del documento dentro de la ventana para revisarlo.</p><p><a name="17535"></a>Las barras de desplazamiento tambi&#233;n aparecen con listas que son m&#225;s largas que la ventana disponible. Las barras de desplazamiento le permiten moverse hacia atr&#225;s y hacia adelante en la lista. El proceso de moverse a trav&#233;s de una lista o documento utilizando barras de desplazamiento se llama desplazamiento. En Seagate Crystal Reports, la pantalla se desplaza autom&#225;ticamente siempre que usted mueve el cursor fuera de la ventana presionando y manteniendo el bot&#243;n.</p><a name="17886"></a><h4>Base de datos
</h4><p><a name="17887"></a>Una base de datos es un banco de datos relacionados. Cada unidad (registro) de la base de datos t&#237;picamente est&#225; organizada en un formato fijo que facilita recuperar sectores espec&#237;ficos de datos cuando se necesiten. Cada registro est&#225; compuesto de uno o m&#225;s campos de datos y cada campo de datos puede contener una unidad de datos (llamada valor).</p><a name="79"></a><h4>Base de datos activa
</h4><p><a name="81"></a>Una base de datos activa es una base de datos que ha sido seleccionada para ser usada en un informe. Las bases de datos se activan por medio del comando Nuevo en el men&#250; Archivo y el comando Agregar base de datos al informe del men&#250; Base de Datos.</p><a name="17639"></a><h4>Bitmap (Mapa de bits)
</h4><p><a name="19782"></a>Un archivo de gr&#225;ficos que puede ser agregado a un informe.</p><a name="19812"></a><h4>Cadena
</h4><p><a name="19813"></a>Una cadena es una serie de caracteres conectados (letras, n&#250;meros, s&#237;mbolos, espacios), almacenados y utilizados como texto. La palabra "hola" es una cadena de texto como lo es la frase "Pedido # 2453" y el n&#250;mero de cliente "B30-124-777". Las cadenas son referidas algunas veces como cadenas de texto o cadenas de caracteres.</p><a name="20329"></a><h4>Cadena de texto
</h4><p><a name="20330"></a>Una cadena de texto es texto introducido directamente al informe mismo en lugar de ser introducido por medio de un campo de datos o f&#243;rmula.</p><a name="19783"></a><h4>Cadena nula
</h4><p><a name="18735"></a>Una cadena nula es una cadena vac&#237;a. No contiene caracteres. Si usted fuera a utilizar la funci&#243;n Count (Contar) para contar la cadena, regresar&#237;a una longitud cero. Se usa "" para designar una cadena nula.</p><a name="18518"></a><h4>Cadena vac&#237;a
</h4><p><a name="18519"></a>Una cadena vac&#237;a (designada como "") es una cadena que no contiene caracteres. Use una cadena vac&#237;a para especificar que nada sea impreso. Por ejemplo, en la f&#243;rmula:</p><a name="18520"></a><p class="indent"><code>If {archivo.CAMPO} = 3.5, Then<br>&nbsp;&nbsp;&nbsp;&nbsp;"Cum Laude"<br>Else <br>&nbsp;&nbsp;&nbsp;&nbsp;" "</code></p><p><a name="18521"></a>Usted especifica que las palabras Cum Laude se impriman (Then) si el promedio de notas es 3.5 o mayor. Est&#225; utilizando la cadena vac&#237;a " " para indicar que nada se imprima (Else) si el promedio de notas es menor que 3.5.</p><a name="21177"></a><h4>Campo
</h4><p><a name="21178"></a>Un campo es el bloque de construcci&#243;n b&#225;sico de un registro. Cada registro est&#225; compuesto de uno o m&#225;s campos, y cada campo puede contener una unidad de datos (conocido como un valor). Un registro de cliente en una t&#237;pica base de datos de direcciones de clientes podr&#237;a contener campos similares a estos: Nombre, Direcci&#243;n, Ciudad, Estado, C&#243;digo postal, Tel&#233;fono, N&#250;mero de Fax. Un campo puede estar vac&#237;o o contener un valor. Los datos del campo son generalmente mostrados o impresos en columnas en la secci&#243;n de Detalles de un informe.</p><a name="20693"></a><h4>Campo BLOB
</h4><p><a name="20694"></a>Un campo BLOB es un campo que contiene datos BLOB. Un BLOB (Binary Large Object (Objeto Binario Grande)) es simplemente un gr&#225;fico de bitmap que ha sido introducido a una base de datos. Ubicando un campo BLOB en su informe le permite tener acceso a estos gr&#225;ficos de la misma manera como lo har&#237;a con otros tipos de datos.</p><a name="21699"></a><h4>Campo de datos
</h4><p><a name="21700"></a>Un campo de datos (o campo) es el bloque de construcci&#243;n b&#225;sico de un registro. Cada registro est&#225; compuesto de uno o m&#225;s campos de datos y cada campo de datos puede contener una unidad de datos (conocido como un valor). Un registro de clientes en una base de datos de direcciones de clientes t&#237;pica podr&#237;a contener campos de datos similares a estos: Nombre, Direcci&#243;n, Ciudad, Estado, C&#243;digo postal, Tel&#233;fono, N&#250;mero de fax. Un campo de datos puede estar vac&#237;o o contener un valor. Los datos del campo de datos por lo general se muestran o son impresos en columnas en la secci&#243;n Detalles de un informe.</p><a name="22190"></a><h4>Campo de datos calculados
</h4><p><a name="22191"></a>Un campo de datos calculados es un campo que contiene un valor que se origina de un c&#225;lculo en lugar de venir directamente de una base de datos. Por ejemplo, si la base de datos que usa no tiene un campo de Ganancia Bruta, pero incluye un campo {archivo.VENTAS} y un campo {archivo.COSTO} a&#250;n puede mostrar la ganancia bruta en el informe por intermedio de un campo de datos calculados. Para crear un campo de datos calculados, usted simplemente crea una f&#243;rmula que reste {archivo.COSTO} de {archivo.VENTAS}. La f&#243;rmula calcula un valor de Ganancia Bruta para cada fila y lo imprime en el lugar donde usted ubica la f&#243;rmula.</p><a name="22386"></a><h4>Campo de ordenamiento
</h4><p><a name="22387"></a>Un campo de ordenamiento es un campo de datos sobre el cual el procedimiento de ordenamiento est&#225; basado. Una lista de correo, podr&#237;a estar ordenada, en orden ascendente en el campo {cliente.C&Oacute;DIGO POSTAL}; esto es, los clientes estar&#237;an ordenados de manera que aqu&#233;llos con los c&#243;digos postales m&#225;s "bajos" (menores) aparecer&#237;an primero y aqu&#233;llos con los c&#243;digos postales m&#225;s "altos" (mayores) aparecer&#237;an al final. El informe tambi&#233;n podr&#237;a ser ordenado en orden alfab&#233;tico ascendente en el campo {cliente.APELLIDO DEL CONTACTO}; esto es, los clientes cuyos apellidos comienzan con A aparecer&#237;an primero y aquellos cuyos apellidos comienzan con Z aparecer&#237;an al final.</p><a name="22587"></a><h4>Campo de par&#225;metro
</h4><p><a name="22588"></a>Una clase de campo especial que pide un valor al usuario. Puede utilizar campos de par&#225;metro para t&#237;tulos de informe, selecci&#243;n de registros, ordenamientos y una variedad de otros usos. Utilizar campos de par&#225;metro le permite crear un informe &#250;nico que se puede modificar r&#225;pidamente y ajustarse a diferentes necesidades.</p><p><a name="102725"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>El t&#233;rmino "campo de par&#225;metro" en Seagate Crystal Reports es el t&#233;rmino "par&#225;metros de consultas" en Microsoft Access.</p>
<a name="22724"></a><h4>Campo resumido
</h4><p><a name="22725"></a>Un campo resumido es un campo que determina la suma de los valores, el valor promedio, el valor m&#225;ximo, el valor m&#237;nimo, o cuenta de valores en un grupo de valores en un campo dado. Al igual que un subtotal, un campo resumido agrupa los datos seg&#250;n sus especificaciones y luego realiza el c&#225;lculo o la determinaci&#243;n requerida.</p><a name="22983"></a><h4>Campos indexados
</h4><p><a name="91934"></a>Campos en la base de datos ordenados en forma espec&#237;fica para acelerar la recuperaci&#243;n de registros espec&#237;ficos. En lugar de buscar en todos los datos de todos los registros, el programa va primero al &#237;ndice y encuentra un puntero que lo dirige al registro espec&#237;fico. Los campos indexados est&#225;n marcados con puntas de flechas en el Asistente de Selecci&#243;n y Asistente de V&#237;nculo Visual.</p><a name="52645"></a><h4>Carta modelo
</h4><p><a name="52646"></a>En Seagate Crystal Reports, una carta modelo es una carta que puede ser reproducida y personalizada a gusto, utilizando las excelentes capacidades de los objetos de texto del programa. Las carta modelo generalmente incluyen tanto texto como valores de campo. Usted crea la carta y el programa la ejecuta insertando, cada vez, valores de diferentes registros en la base de datos.</p><a name="23691"></a><h4>Coincidir May&#250;sculas y min&#250;sculas
</h4><p><a name="23692"></a>Coincidir may&#250;sculas y min&#250;sculas significa que un programa distingue entre MAYUSCULAS y min&#250;sculas cuando eval&#250;a una cadena de texto. Una b&#250;squeda que distingue may&#250;sculas y min&#250;sculas de la palabra "casa" regresar&#225; s&#243;lo el valor "casa," pero una b&#250;squeda que no los distinga regresar&#225; "casa," "Casa," "CASA," "CaSa," y similares respuestas mezcladas. Los operadores de Seagate Crystal Reports (Equal, In string, etc.) distinguen may&#250;sculas y min&#250;sculas.</p><a name="24094"></a><h4>Columna
</h4><p><a name="24095"></a>Una columna es el despliegue de datos de una f&#243;rmula o un campo. Las columnas van de arriba a abajo en la p&#225;gina. Las palabras columna y campo a veces se usan en forma an&#225;loga en la documentaci&#243;n. Contraste con la definici&#243;n de Fila.</p><a name="24096"></a><h4>Comentarios
</h4><p><a name="24097"></a>Los comentarios son bloques de texto que acompa&#241;an a las f&#243;rmulas y describen su funcionalidad. Seagate Crystal Reports ignora los comentarios cuando desarrolla la f&#243;rmula.</p><a name="24200"></a><h4>Comod&#237;n
</h4><p><a name="24201"></a>Un comod&#237;n es un car&#225;cter que representa cualquier car&#225;cter (?) o un grupo de caracteres (*) en la cadena de b&#250;squeda. Por ejemplo, si usted est&#225; buscando Dan*, la cadena de b&#250;squeda regresar&#225; cadenas como Danielito o Daniel.</p><a name="24440"></a><h4>Concatenar
</h4><p><a name="24441"></a>Concatenar significa juntar dos o m&#225;s cadenas de texto para formar una sola cadena continua.</p><a name="24679"></a><h4>Condici&#243;n
</h4><p><a name="24680"></a>En una f&#243;rmula If<nobr>-T</nobr>hen<nobr>-E</nobr>lse, la condici&#243;n es la parte "If" de la f&#243;rmula, el conjunto de circunstancias que deben suceder (ser verdad) para pasar a la parte "Then" (o consecuencia) de la f&#243;rmula. En la f&#243;rmula If x&lt;5 Then x Else 5, la expresi&#243;n x&lt;5 es la condici&#243;n.</p><a name="25251"></a><h4>Consecuencia
</h4><p><a name="25252"></a>En una f&#243;rmula If<nobr>-T</nobr>hen<nobr>-E</nobr>lse, la consecuencia es la parte "Then" de la f&#243;rmula, la acci&#243;n realizada si la condici&#243;n "If" se cumple. En la f&#243;rmula If x&lt;5 Then x Else 5, la expresi&#243;n Then x es la consecuencia.</p><a name="25253"></a><h4>Constante
</h4><p><a name="25254"></a>Una constante es un valor fijo e invariable, contrario a un valor variable que puede tener valores diferentes dependiendo de las circunstancias.</p><p><a name="52189"></a>El valor 5 es una constante; el valor del campo Cantidad (que algunas veces puede ser 5, algunas veces puede ser un n&#250;mero diferente) es un valor variable. Por ejemplo, en la f&#243;rmula para convertir libras a onzas "Onzas = Libras * 16", 16 es una constante mientras que Onzas y Libras son variables. En la f&#243;rmula "Hoy - 1 de Enero de 1900", 1 de Enero, 1900, es una constante, mientras que Hoy es una variable que cambia siempre que la fecha actual cambia. En Seagate Crystal Reports, las constantes pueden ser n&#250;meros, cadenas de texto, fechas, cantidades en d&#243;lares, hora, fecha/hora, o el resultado de una f&#243;rmula que en s&#237; misma no contiene variables (por ejemplo, 14-9).</p><a name="91"></a><h4>Control ActiveX
</h4><p><a name="52723"></a>Control personalizado para Visual Basic que incorpora la tecnolog&#237;a de Vinculamiento e Incrustaci&#243;n de Objetos (OLE). Antes conocido como control OLE (OCX).</p><a name="25854"></a><h4>Criterio de ordenamiento
</h4><p><a name="25855"></a>El criterio de ordenamiento es un indicador de la direcci&#243;n en que se quiere mostrar los datos ordenados. Los datos son impresos, t&#237;picamente, bajo uno de dos criterios de ordenamiento: ascendente (menor a mayor, m&#225;s antiguo a m&#225;s reciente, primero al &#250;ltimo, de A a Z, etc.) o descendente (de mayor a menor, m&#225;s reciente a m&#225;s antiguo, &#250;ltimo al primero, de Z a A, etc.).</p><a name="26244"></a><h4>Cuadr&#237;cula
</h4><p><a name="26245"></a>En Seagate Crystal Reports, la cuadr&#237;cula es una red de "l&#237;neas" subyacentes similares a las l&#237;neas de papel de gr&#225;ficos. Se usan estas l&#237;neas para alinear campos y gr&#225;ficos. Si usted ha activado la opci&#243;n <kbd>Ajustar a Cuadr&#237;cula</kbd> en el cuadro de di&#225;logo Opciones, Seagate Crystal Reports alinear&#225; autom&#225;ticamente cualquier campo que usted inserta o cambia de tama&#241;o a las coordenadas m&#225;s cercanas de la cuadr&#237;cula.</p><a name="26394"></a><h4>Depurar
</h4><p><a name="26395"></a>Eliminar errores que ocurren cuando se ejecuta una f&#243;rmula.</p><a name="26736"></a><h4>Desviaci&#243;n est&#225;ndar
</h4><p><a name="26737"></a>La desviaci&#243;n est&#225;ndar es la ra&#237;z cuadrada de la variancia. Es una prueba estad&#237;stica de c&#243;mo algunos valores en un conjunto de valores se desv&#237;an del valor t&#233;rmino medio o promedio para ese conjunto. Usted puede utilizar la desviaci&#243;n est&#225;ndar, por ejemplo, para evaluar la dificultad relativa de las pruebas tomadas a los estudiantes, para evaluar y proyectar las tendencias de compras de los clientes, o para comparar los resultados entregados por dos o m&#225;s productos bajo evaluaci&#243;n (pruebas de sangre de laboratorio, detectores de humo, detectores de radar, etc.). Los usos son infinitos.</p><p><a name="26738"></a>La desviaci&#243;n est&#225;ndar (a diferencia de la desviaci&#243;n est&#225;ndar de poblaci&#243;n) se usa a menudo para proyectar la desviaci&#243;n est&#225;ndar de toda una poblaci&#243;n (todos los valores) basada s&#243;lo en el an&#225;lisis de una peque&#241;a muestra de la poblaci&#243;n. Por ejemplo, una compa&#241;&#237;a que produce bater&#237;as con un nuevo proceso de fabricaci&#243;n desear&#237;a probar las bater&#237;as para determinar cuanto tiempo duran antes que se agoten. Si la compa&#241;&#237;a probara todas las bater&#237;as, no tendr&#237;a productos para vender. Como una alternativa, la compa&#241;&#237;a podr&#237;a probar treinta bater&#237;as seleccionadas aleatoriamente y proyectar el tiempo de agotamiento promedio y la desviaci&#243;n est&#225;ndar para todas las bater&#237;as basados en los resultados obtenidos en esas treinta bater&#237;as de prueba.</p><p><a name="103063"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Esta comparaci&#243;n sugiere simplemente un uso t&#237;pico. En la pr&#225;ctica, algunos usuarios prefieren un c&#225;lculo basado en valores N (PopulationStdDev) mientras que otros prefieren un c&#225;lculo basado en valores N-1 (StdDev). Ambas formas de desviaci&#243;n est&#225;ndar est&#225;n en el programa.</p>
<a name="26996"></a><h4>Desviaci&#243;n est&#225;ndar de la poblaci&#243;n
</h4><p><a name="26997"></a>La desviaci&#243;n est&#225;ndar de la poblaci&#243;n es una prueba estad&#237;stica de c&#243;mo los valores de toda una poblaci&#243;n (todos los valores) se desv&#237;an de t&#233;rmino medio o promedio para esa poblaci&#243;n. La desviaci&#243;n est&#225;ndar de poblaci&#243;n se usa a menudo cuando se eval&#250;an todos los valores en lugar de una muestra de esos valores solamente (StdDev).</p><p><a name="103100"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Esta comparaci&#243;n simplemente sugiere un uso t&#237;pico. En la pr&#225;ctica, algunos usuarios prefieren un c&#225;lculo basado en valores N (PopulationStdDev) mientras que otros prefieren un c&#225;lculo basado en valores N-1 (StdDev). Ambas formas de desviaci&#243;n est&#225;ndar son parte del programa.</p>
<a name="103111"></a><h4>Diccionario
</h4><p><a name="103112"></a>Una fuente de datos, r&#225;pida y f&#225;cil de usar creada para usuarios finales por los profesionales de la computaci&#243;n en su empresa. El diccionario elimina la necesidad del usuario final, de buscar m&#250;ltiples bases de datos, lidiar con v&#237;nculos, construir f&#243;rmulas y descodificar nombres de campos cr&#237;pticos. El usuario s&#243;lo selecciona los datos que ella o el necesitan del diccionario y, procede a crear el informe.</p><a name="27353"></a><h4>Direcci&#243;n de ordenamiento
</h4><p><a name="27354"></a>La direcci&#243;n de ordenamiento describe la manera en que los registros o grupos son impresos en su informe. Se imprimen ya sea en orden ascendente (A a Z, 0 a 9), u orden descendente (Z a A, 9 a 0).</p><a name="27653"></a><h4>Documento Contenedor
</h4><p><a name="27654"></a>Un archivo que contiene un objeto OLE vinculado o incrustado.</p><a name="27744"></a><h4>Documento servidor
</h4><p><a name="27745"></a>Archivo que almacena el objeto OLE original.</p><a name="28095"></a><h4>Biblioteca de V&#237;nculo Din&#225;mico (DLL)
</h4><p><a name="28096"></a>Una Biblioteca de V&#237;nculo Din&#225;mico (DLL) es un archivo especial que contiene funciones de Windows. Los programadores usan DLL para aumentar las capacidades de los programas de Windows. La biblioteca es activada cuando un programa u otro DLL llama una funci&#243;n de la biblioteca. Las funciones DLL vinculan de inmediato, durante el tiempo de ejecuci&#243;n, cada vez que se invoca una funci&#243;n incluida. Las funciones DLL est&#225;n disponibles de acuerdo se necesiten para cualquier programa que pueda trabajar con DLL; no necesitan ser vinculadas al programa por medio del compilador. Programadores pueden llamar a Crystal Report Engine como un DLL para ser usado con los programas que est&#225;n desarrollando.</p><a name="28529"></a><h4>Editor de F&#243;rmulas
</h4><p><a name="28530"></a>El Editor de F&#243;rmulas es utilizado para crear y editar f&#243;rmulas. Contiene herramientas para insertar campos, funciones y operadores en la f&#243;rmula, para verificar la sintaxis de la f&#243;rmula y para escribir componentes y argumentos de la f&#243;rmula. Las versiones modificadas del Editor de F&#243;rmulas son utilizadas para crear f&#243;rmulas de Selecci&#243;n de Registros y Grupos.</p><a name="28888"></a><h4>Elemento
</h4><p><a name="28889"></a>La palabra elemento se usa a veces para describir componentes individuales del informe tales como campos de base de datos, f&#243;rmulas, campos de grupo. La ficha Dise&#241;o utiliza cuadros rectangulares para representar campos.</p><a name="29153"></a><h4>Encabezado
</h4><p><a name="29154"></a>Un encabezado es texto que aparece en la parte superior de una p&#225;gina de informe, arriba del cuerpo del informe. A&#250;n cuando un encabezado puede contener virtualmente cualquier informaci&#243;n, frecuentemente contiene cosas como el t&#237;tulo del informe, nombre de la compa&#241;&#237;a, fecha, rango de fechas incluidas en el informe, etc. Seagate Crystal Reports le da la opci&#243;n de imprimir el encabezado en todas o s&#243;lo en p&#225;ginas seleccionadas de su informe.</p><a name="29318"></a><h4>Encabezado de grupo
</h4><p><a name="29319"></a>Un Encabezado de grupo es una secci&#243;n creada por el programa cada vez que usted inserta un grupo, un resumen, o un subtotal. La secci&#243;n de Encabezado de grupo es utilizada t&#237;picamente para desplegar el nombre del grupo o alguna otra informaci&#243;n de identificaci&#243;n.</p><a name="29453"></a><h4>Encabezado de informe
</h4><p><a name="29454"></a>La secci&#243;n de Encabezado de informe es la primera secci&#243;n de su informe en la ficha Dise&#241;o. En esta secci&#243;n se puede poner un t&#237;tulo o cualquier dato que desea que s&#243;lo aparezca en la primera p&#225;gina de su informe.</p><a name="29588"></a><h4>Encabezado de p&#225;gina
</h4><p><a name="29589"></a>Una secci&#243;n que se imprime en la parte superior de cada p&#225;gina. T&#237;picamente, los encabezados de p&#225;gina se usan para t&#237;tulos y otra informaci&#243;n de identificaci&#243;n.</p><a name="29735"></a><h4>Encabezado din&#225;mico
</h4><p><a name="29736"></a>Un encabezado din&#225;mico es un encabezado que cambia de acuerdo con el contenido de un campo. Si usted agrupa sus datos por regi&#243;n, por ejemplo, un t&#237;pico encabezado de grupo din&#225;mico imprimir&#237;a el nombre de la regi&#243;n al inicio de cada grupo.</p><a name="29899"></a><h4>Entero
</h4><p><a name="29900"></a>Un entero es un n&#250;mero positivo o negativo o cero. Los enteros no tienen lugares decimales.</p><a name="30545"></a><h4>Explorador
</h4><p><a name="30546"></a>El explorador es una programa para ver documentos en un formato HTML.</p><a name="30730"></a><h4>Exportar
</h4><p><a name="30731"></a>Exportar significa distribuir el informe a un archivo de disco o por correo electr&#243;nico. Seagate Crystal Reports le permite exportar sus informes en muchos formatos populares de hoja de c&#225;lculos, base de datos, procesador de texto, HTML, e intercambio de datos.</p><a name="31239"></a><h4>Expresi&#243;n Booleana
</h4><p><a name="31240"></a>Una expresi&#243;n Booleana define una relaci&#243;n l&#243;gica entre dos o m&#225;s elementos. Una expresi&#243;n Booleana es VERDADERA o FALSA. A&gt;5 and B&lt;10 es una expresi&#243;n Booleana que utiliza el operador Booleano "And". Para que la expresi&#243;n sea VERDADERA, ambas condiciones (unidas por el operador And) deben ser verdaderas. El valor de A debe ser mayor que 5 y el valor de B debe ser menor que 10. Si los valores no caen en esos rangos, entonces la expresi&#243;n es FALSA. Las expresiones Booleanas son &#250;tiles en las f&#243;rmulas If<nobr>-T</nobr>hen<nobr>-E</nobr>lse. Por ejemplo,</p><PRE><a name="31241"></a>If A&gt;5 and B&lt;10 Then<br>
&nbsp;&nbsp;&nbsp;&nbsp;"In Range" <br>
Else <br>
&nbsp;&nbsp;&nbsp;&nbsp;" "
</PRE><p><a name="31242"></a>Esta f&#243;rmula dice, si la expresi&#243;n Booleana A&gt;5 and B&lt;10 es VERDADERA, imprima "in range" ("En el Rango"), de lo contrario (si la expresi&#243;n Booleana es FALSA) imprima nada (como fue designada por la cadena vac&#237;a "").</p><a name="31720"></a><h4>Fecha vac&#237;a
</h4><p><a name="31721"></a>Una fecha vac&#237;a [designada como Date (0,0,0)] es una fecha que no contiene mes, d&#237;a, o a&#241;o, y por lo tanto no se imprime. Use una fecha vac&#237;a en f&#243;rmulas If<nobr>-T</nobr>hen<nobr>-E</nobr>lse que pueden regresar una fecha o no.</p><p><a name="91264"></a>Por ejemplo, la f&#243;rmula:</p><PRE><a name="31722"></a>If PageNumber = 1 Then<br>
&nbsp;&nbsp;&nbsp;&nbsp;PrintDate <br>
Else <br>
&nbsp;&nbsp;&nbsp;&nbsp;Date(0,0,0)
<p class="indent"><a name="31723"></a>&#171;Imprime la fecha de impresi&#243;n en la primera p&#225;gina e imprime nada en las dem&#225;s p&#225;ginas&#187;.</p></PRE><p><a name="31724"></a>Ya que la parte "Then" de la f&#243;rmula es una fecha (PrintDate), la parte "Else" tambi&#233;n debe ser una fecha, pero una fecha que no se imprime. Para crear una fecha que no se imprime (vac&#237;a) utilice la funci&#243;n Date y los argumentos (0, 0, 0).</p><a name="31826"></a><h4>Fichas
</h4><p><a name="31827"></a>Las fichas se usan en muchos cuadros de di&#225;logo y Asistentes en Seagate Crystal Reports. Las fichas se asemejan a las fichas en las carpetas de archivo comunes. Las fichas siempre tienen texto para indicar lo que usted encontrar&#225; en la ficha.</p><a name="31921"></a><h4>Fila
</h4><p><a name="76524"></a>Una fila es el despliegue de datos de un registro &#250;nico. Las filas van a lo ancho de la p&#225;gina. En este manual, las palabras fila y registro son usadas algunas veces en forma an&#225;loga. Contraste con columnas.</p><a name="32706"></a><h4>F&#243;rmula
</h4><p><a name="32707"></a>Una f&#243;rmula es una expresi&#243;n simb&#243;lica de las manipulaciones que se realizan sobre ciertos datos antes de que sean impresos en su informe.</p><p><a name="32708"></a>Por ejemplo, si su informe va a tener un campo {archivo.VENTAS} y un campo {archivo.COSTO}, le convendr&#237;a crear un campo Ganancia Bruta y definir su valor como {archivo.VENTAS} - {archivo.COSTO}. Es una f&#243;rmula sencilla que le dice al programa que reste el valor del campo {archivo.COSTO} del valor del campo {archivo.VENTAS} y luego imprima el resultado.</p><p><a name="32709"></a>Usted puede utilizar las f&#243;rmulas para calcular valores num&#233;ricos, comparar un valor con otro y seleccionar diferentes acciones basado en la comparaci&#243;n, unir m&#250;ltiples cadenas de texto en una cadena sencilla, y para otros prop&#243;sitos. Crear una f&#243;rmula en Seagate Crystal Reports es como crear una f&#243;rmula en su hoja de c&#225;lculo favorita.</p><p><a name="103355"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>El t&#233;rmino "f&#243;rmula" en Seagate Crystal Reports es equivalente al t&#233;rmino "expresi&#243;n" en Microsoft Access.</p>
<a name="32826"></a><h4>F&#243;rmula de selecci&#243;n
</h4><p><a name="96541"></a>Una f&#243;rmula de selecci&#243;n es una f&#243;rmula que especifica los registros o grupos de registros que desea incluir en su informe.</p><a name="96545"></a><h4>F&#243;rmulas Booleanas
</h4><p><a name="33137"></a>Las f&#243;rmulas Booleanas son f&#243;rmulas que devuelven un valor S&#237;/No (VERDADERO/FALSO). Por ejemplo, la f&#243;rmula Booleana {detalle de pedidos.CANTIDAD} &gt; 6 compara el valor en el campo {detalle de pedidos.CANTIDAD} con 6. Si el valor es mayor que 6 devuelve un S&#237;; si es 6 o menor, devuelve un No. Contraste esto con una f&#243;rmula no<nobr>-B</nobr>ooleana como {detalle de pedidos.CANTIDAD} * 6. En este caso el programa devuelve un n&#250;mero, el valor de {detalle de pedidos.CANTIDAD} multiplicado por 6. Todas las f&#243;rmulas de selecci&#243;n de registros y grupos deben ser Booleanas.</p><a name="33223"></a><h4>F&#243;rmulas de formato condicional
</h4><p><a name="33224"></a>Las f&#243;rmulas de formato condicional son expresiones que asignan atributos espec&#237;ficos a objetos o secciones s&#243;lo bajo ciertos criterios.</p><a name="33274"></a><h4>Formato absoluto
</h4><p><a name="33275"></a>Es el formato que siempre se asigna a un objeto. Vea tambi&#233;n <kbd>Formato condicional</kbd>.</p><a name="33324"></a><h4>Formato condicional
</h4><p><a name="33325"></a>Es la habilidad de poder asignar formato a objetos y secciones s&#243;lo en ciertas situaciones. Por ejemplo, se puede dar formato condicional a campos num&#233;ricos de base de datos para que se muestren en rojo cuando son negativos.</p><a name="33369"></a><h4>Fuente de datos
</h4><p><a name="33370"></a>Una fuente de datos es una base de datos, tabla, consulta, diccionario o conjunto de resultados de procedimientos almacenados que provee los datos para el informe.</p><a name="33649"></a><h4>Funci&#243;n
</h4><p><a name="33650"></a>Una funci&#243;n es un procedimiento o subrutina integrado, usados para evaluar, hacer c&#225;lculos, o transformar datos. Cuando usted especifica una funci&#243;n, Seagate Crystal Reports realiza el conjunto de operaciones construidas en la funci&#243;n sin que usted tenga que especificar cada operaci&#243;n por separado. De esta forma, una funci&#243;n es una especie de taquigraf&#237;a que hace m&#225;s f&#225;cil y r&#225;pida la creaci&#243;n de informes.</p><p><a name="33651"></a>Seagate Crystal Reports viene con un amplio rango de funciones, y tambi&#233;n incluye herramientas que le permiten construir y guardar funciones adicionales para su propio uso.</p><a name="33757"></a><h4>Funci&#243;n/f&#243;rmula de dos pasadas
</h4><p><a name="33758"></a>Una f&#243;rmula de dos pasadas es aquella que "pasa" dos veces por los datos. El primer paso realiza alg&#250;n c&#225;lculo o selecci&#243;n y el segundo paso realiza un c&#225;lculo o selecci&#243;n en la que utiliza el resultado generado en el primer paso.</p><p><a name="33759"></a>Un ejemplo de una f&#243;rmula de dos pasadas es aquella que calcula las ventas de cada agente como un porcentaje total de las ventas de la empresa. El primer paso suma las ventas de cada agente para llegar al total de las ventas de la empresa. El segundo paso divide las ventas por agente por la venta total de la empresa y as&#237; poder calcular el porcentaje de ventas totales.</p><a name="97"></a><h4>Funciones de agrupamiento
</h4><p><a name="99"></a>Una operaci&#243;n que resume datos (suma, calcula un promedio, identifica un valor m&#225;ximo, etc.). El t&#233;rmino "funciones de agrupamiento" es frecuentemente asociado con las fuentes de datos SQL.</p><a name="33943"></a><h4>Galer&#237;a de Informes
</h4><p><a name="33944"></a>La Galer&#237;a de Informes es un cuadro de di&#225;logo especial que aparece cuando hace clic en el bot&#243;n Nuevo en la barra de herramientas est&#225;ndar o elige el comando Nuevo del men&#250; Archivo. La Galer&#237;a de Informes sirve como un puerta de acceso a todos los asistentes de creaci&#243;n de informes de Seagate Crystal Reports y a la interfaz gr&#225;fica para seleccionar el informe y tipo de datos para la creaci&#243;n de informes personalizados.</p><a name="34165"></a><h4>Grupo
</h4><p><a name="34166"></a>Un grupo es un conjunto de registros que de alguna manera est&#225;n relacionados uno con otro. Por ejemplo, en una lista de clientes, un grupo consistir&#237;a de todos aquellos clientes que viven en la misma Zona postal, o en la misma Regi&#243;n. En un informe de ventas, un grupo podr&#237;a consistir de todos los pedidos del mismo cliente, o todos los pedidos generados por un agente de ventas espec&#237;fico. Seagate Crystal Reports le ofrece una flexibilidad enorme para agrupar los datos en el informe.</p><a name="34739"></a><h4>HTML
</h4><p><a name="34740"></a>El lenguaje utilizado por la Web para publicar p&#225;ginas web en el Internet que contengan v&#237;nculos a otras p&#225;ginas.</p><a name="34933"></a><h4>Incrustar, Objeto incrustado
</h4><p><a name="34934"></a>Un objeto incrustado contiene una presentaci&#243;n del objeto, todos los datos relativos al objeto e informaci&#243;n acerca del programa usado para crearlo. Cuando se modifica el objeto original en el documento del servidor, nada sucede con el objeto incrustado a menos que usted actualice espec&#237;ficamente ese objeto.</p><a name="35119"></a><h4>Indicador
</h4><p><a name="80066"></a>Un indicador es un car&#225;cter o grupo de caracteres utilizados para resaltar o identificar elementos de inter&#233;s y llamar la atenci&#243;n de los lectores. Por ejemplo, en un informe de cuentas por cobrar, la palabra "vencida" podr&#237;a ser impresa como un indicador al lado de cada cuenta vencida.</p><a name="80068"></a><h4>Indice
</h4><p><a name="35438"></a>Un &#237;ndice es un archivo peque&#241;o que identifica la ubicaci&#243;n de cada registro en una base de datos. Ya que un peque&#241;o archivo de &#237;ndice puede ser buscado u ordenado mucho m&#225;s r&#225;pido que una base de datos grande, Seagate Crystal Reports utiliza archivos de &#237;ndice para acelerar el proceso de elaboraci&#243;n de informes. Por ejemplo, en una b&#250;squeda, Seagate Crystal Reports busca en el &#237;ndice la ubicaci&#243;n correcta del campo. Una vez hallado, el programa va directamente al campo de base de datos. Semejante b&#250;squeda soluciona la necesidad de buscar cada campo de cada registro en una base de datos. Una base de datos puede tener varios &#237;ndices, cada uno basado en un campo (o campos) espec&#237;fico(s).</p><a name="36282"></a><h4>Informe
</h4><p><a name="36283"></a>Un informe es simplemente una presentaci&#243;n organizada de datos. Como una herramienta de administraci&#243;n, el informe proporciona a la gerencia de la empresa la perspectiva necesaria para dirigir efectivamente la organizaci&#243;n. Seagate Crystal Reports le permite crear f&#225;cil y r&#225;pidamente informes administrativos comprensibles, personalizados y atractivos. Pero, informes en Seagate Crystal Reports tambi&#233;n se refiere a facturas, cartas modelo, etiquetas de correo, y otros elementos relacionados que requieren la organizaci&#243;n y producci&#243;n de datos.</p><a name="37293"></a><h4>L&#237;neas gu&#237;a
</h4><p><a name="37294"></a>Las l&#237;neas gu&#237;a son l&#237;neas que no se imprimen y que son usadas para mover, alinear y cambiar de tama&#241;o, con precisi&#243;n, objetos. Las l&#237;neas gu&#237;a le permiten trabajar en un ambiente de modo libre (sin cuadr&#237;cula) y a&#250;n tener control absoluto sobre la colocaci&#243;n de objetos en su informe.</p><a name="37413"></a><h4>Marco de objeto
</h4><p><a name="37414"></a>Un marco de objeto es un cursor rectangular que aparece como una ayuda para ubicar campos y f&#243;rmulas en el informe. Una vez que ha seleccionado un campo o creado una f&#243;rmula, aparece el marco del objeto. Cuando mueve el marco a la posici&#243;n en donde quiere la f&#243;rmula o campo y hace clic, el programa inserta el elemento en el punto especificado.</p><a name="129"></a><h4>Matriz
</h4><p><a name="131"></a>Una matriz es un grupo de valores, separados por comas. Las matrices se usan con una variedad de funci&#243;n de Seagate Crystal Reports: Promedio ([matriz]), M&#225;ximo ([matriz]), etc. En estas funciones, la matriz es el argumento para la funci&#243;n. La funci&#243;n trabaja sobre los elementos en la matriz. Los elementos en una matriz pueden ser constantes, campos de datos o resultados de f&#243;rmulas.</p><a name="37486"></a><h4>Men&#250; contextual
</h4><p><a name="37487"></a>Men&#250; din&#225;mico disponible en las fichas Dise&#241;o y Vista Previa. Puede tener acceso al men&#250; contextual seleccionando un objeto y haciendo clic con el bot&#243;n derecho.</p><a name="103896"></a><h4>Microsoft Foundation Class (MFC)
</h4><p><a name="103897"></a>Una interfaz de programaci&#243;n orientada hacia el objeto, que encapsula muchas llamadas de funciones relacionadas en un objeto.</p><a name="70087"></a><h4>Modo libre
</h4><p><a name="70080"></a>Modo libre implica que la ubicaci&#243;n de objetos no est&#225; limitada a cuadr&#237;culas (verticales u horizontales).</p><a name="37677"></a><h4>Muestra
</h4><p><a name="106879"></a>Una muestra, como se usa en estad&#237;stica, es un subconjunto de una poblaci&#243;n utilizado para representar toda la poblaci&#243;n. A menudo, los investigadores no tienen la opci&#243;n de analizar toda una poblaci&#243;n antes de formular conclusiones basadas en sus pruebas. En tales casos, se usa una muestra para representar el todo.</p><p><a name="77483"></a>Por ejemplo, a menudo, las encuestas pol&#237;ticas preelectorales est&#225;n basadas en las preguntas a cuatrocientas o quinientas personas. De las respuestas de esta muestra, se puede hacer predicciones sobre c&#243;mo votar&#225; toda la naci&#243;n.</p><a name="79852"></a><h4>Nivel m&#237;nimo de confianza
</h4><p><a name="79853"></a>Es el porcentaje (<kbd>C</kbd>) que se usa cuando la herramienta de Importaci&#243;n de Documentos de Seagate convierte un informe. Si menos del porcentaje C de los campos est&#225;n localizados correctamente, la conversi&#243;n fallar&#225;.</p><a name="37914"></a><h4>Nulo
</h4><p><a name="37915"></a>Nulo significa que no hay un valor dentro de un campo de base de datos para un registro dado. No significa cero porque cero es un valor.</p><a name="38151"></a><h4>N&#250;mero vac&#237;o
</h4><p><a name="38152"></a>Un n&#250;mero vac&#237;o [designado como cero (0)] es un valor de campo impreso por lo general cuando un valor no cumple con una condici&#243;n espec&#237;fica en una f&#243;rmula If<nobr>-T</nobr>hen<nobr>-E</nobr>lse num&#233;rica. Utilice un n&#250;mero vac&#237;o para especificar que se imprima 0. Por ejemplo, en la f&#243;rmula:</p><PRE><a name="38153"></a>If {archivo.CAMPO} = 3.5 Then<br>
&nbsp;&nbsp;&nbsp;&nbsp;{archivo.CAMPO}<br>
Else <br>
&nbsp;&nbsp;&nbsp;&nbsp;0
</PRE><p><a name="38154"></a>Usted est&#225; especificando que el promedio de notas num&#233;rico sea impreso (Then) si el promedio de notas es 3.5 o mayor. Usted est&#225; usando el n&#250;mero vac&#237;o 0 para indicar que 0 sea impreso (Else) si el promedio de notas es menor que 3.5. Frecuentemente un usuario da formato el campo que contenga esta f&#243;rmula para ser suprimido si es 0. En otras palabras, nada se imprime en el caso de un valor cero.</p><a name="38391"></a><h4>Num&#233;ricos
</h4><p><a name="38392"></a>Datos num&#233;ricos son datos en los que se puede efectuar operaciones aritm&#233;ticas. La designaci&#243;n num&#233;rica se refiere a la manera en que los datos son manejados por Seagate Crystal Reports y programas de base de datos, no la manera como usted ve los datos.</p><p><a name="38393"></a>Por ejemplo, un n&#250;mero de serie 12345 se ve num&#233;rico, esto es, cada car&#225;cter es un n&#250;mero. Pero un n&#250;mero de serie no es la clase de datos sobre los cuales usted puede efectuar operaciones aritm&#233;ticas as&#237; que probablemente almacenar&#237;a un n&#250;mero de serie como texto en lugar de como datos num&#233;ricos.</p><p><a name="38394"></a>Num&#233;rico es uno de varios tipos de datos. Los programas de base de datos requieren que designe un tipo de datos cuando crea un campo para utilizarlo en una base de datos. El tipo de datos que usted selecciona determina las reglas que sigue el programa cuando trabaja con los valores almacenados en ese campo.</p><a name="38562"></a><h4>ODBC
</h4><p><a name="38563"></a>ODBC significa Open Database Connectivity (Conectividad Abierta de Base de Datos). Esta es una interfaz que permite a los programas recuperar datos en los sistemas de administraci&#243;n de datos utilizando SQL para tener acceso a tales datos. La interfaz permite a un programador desarrollar, compilar, y enviar programas sin especificar sistemas espec&#237;ficos de administraci&#243;n de base de datos. Tambi&#233;n se la llama interoperabilidad.</p><a name="103992"></a><h4>Objeto
</h4><p><a name="103993"></a>Un objeto es uno de varias clases de elementos de informe que generalmente contiene datos y tiene propiedades espec&#237;ficas que definen su comportamiento o presentaci&#243;n. Seagate Crystal Reports utiliza las siguientes clases de objetos:</p><ul type="disc"><a name="103994"></a><li>objetos de campo
<a name="103995"></a><li>objetos de texto
<a name="103996"></a><li>objetos de tablas cruzadas 
<a name="103997"></a><li>objetos gr&#225;ficos
<a name="103998"></a><li>objetos de subinforme
<a name="103999"></a><li>objetos de imagen
<a name="104000"></a><li>objetos OLE.
</ul><p><a name="104001"></a>Cada uno de estos objetos pueden ser formateados individualmente, movidos, cambiados de tama&#241;o, duplicados, etc.</p><a name="39113"></a><h4>Objeto de texto
</h4><p><a name="39114"></a>Un objeto de texto es un objeto especializado  que puede contener texto, campos de base de datos y campos de f&#243;rmula. Contiene su propio mini procesador de palabras que puede ser utilizado en cualquier funci&#243;n, desde agregar una etiqueta hasta crear un documento completo.</p><a name="39169"></a><h4>Objeto OLE est&#225;tico
</h4><p><a name="39170"></a>Un objeto OLE est&#225;tico es la imagen de un objeto que queda almacenada en un documento cuando se guarda. La imagen puede ser mostrada o impresa por un usuario que no tenga el programa en la cual fue creado el objeto original. Sin embargo, el objeto no puede ser editado in situ, sin convertirlo primero a un tipo de objeto editable. Los objetos OLE est&#225;ticos ofrecen un mejor rendimiento e impresi&#243;n en l&#237;nea que otros bitmaps est&#225;ndar.</p><a name="39326"></a><h4>Objeto vinculado
</h4><p><a name="39327"></a>Un objeto vinculado contiene una presentaci&#243;n del objeto y un puntero dirigido a una parte definida del documento en el servidor. Cuando usted modifica el objeto original en el documento servidor, el v&#237;nculo asegura que el objeto en su informe es autom&#225;ticamente modificado tambi&#233;n. Asimismo, si modifica el objeto en el documento contenedor el archivo original del objeto tambi&#233;n es modificado.</p><a name="39445"></a><h4>OLE
</h4><p><a name="39446"></a>OLE es un acr&#243;nimo para Object Linking &amp; Embedding, (Vinculamiento e Incrustaci&#243;n de Objetos). Se refiere a la capacidad de crear informes compuestos, esto es, informes que contienen elementos de otros programas y que pueden ser editados utilizando el programa original.</p><a name="39657"></a><h4>Operadores
</h4><p><a name="39658"></a>Operadores son s&#237;mbolos especiales que describen una operaci&#243;n o una acci&#243;n que ocurre entre dos o m&#225;s valores.</p><p><a name="39659"></a>Por ejemplo, el s&#237;mbolo "/" es un operador que significa dividir. A / B significa divida A entre B. Seagate Crystal Reports lee los operadores en una f&#243;rmula y realiza las acciones especificadas. Seagate Crystal Reports contiene operadores aritm&#233;ticos, de cadena, de comparaci&#243;n, Booleanos, de conversi&#243;n, de fecha, y de rango entre otros.</p><a name="39660"></a><h4>Orden de precedencia
</h4><p><a name="39661"></a>El orden de precedencia es un conjunto de reglas que determina el orden en el cual se efect&#250;an las operaciones aritm&#233;ticas en una f&#243;rmula que involucra m&#250;ltiples operaciones aritm&#233;ticas. La multiplicaci&#243;n (*) y divisi&#243;n (/) se hacen primero (operaciones de primer orden), seguidas por la suma (+) y resta (-) (operaciones de segundo orden). Cuando hay m&#250;ltiples operaciones incluyendo el mismo orden, el orden de precedencia dicta que las operaciones sean realizadas de izquierda a derecha. Si necesita alterar el orden normal, puede utilizar un par&#233;ntesis.</p><a name="39746"></a><h4>Ordenar
</h4><p><a name="39747"></a>Ordenar es un m&#233;todo para organizar la ubicaci&#243;n en el cual aparecen los datos en su informe. Seagate Crystal Reports tiene herramientas excepcionales para ordenar los datos de su informe.</p><a name="39864"></a><h4>Ordenar y agrupar por campo
</h4><p><a name="39865"></a>Ordenar y agrupar por campo es un campo que provoca la impresi&#243;n de un subtotal (o un valor de campo de grupo) cada vez que su propio valor cambia.</p><p><a name="39866"></a>Por ejemplo, usted puede tener un informe de clientes que contiene los campos {cliente.ID DEL CLIENTE} y {pedidos.MONTO DEL PEDIDO}. Si desea subtotalizar por cliente (totalizar los pedidos por cada cliente), haga clic en el campo {pedidos.MONTO DEL PEDIDO} como el campo para subtotalizar y haga clic en el campo {cliente.ID DEL CLIENTE} como ordenar y agrupar por campo. Seagate Crystal Reports ordena los datos por cliente, de manera que todos los pedidos del mismo cliente est&#233;n agrupados juntos. Entonces, cada vez que cambia el valor en el campo {cliente.ID DEL CLIENTE} (cuando cambia de un cliente a otro diferente), Seagate Crystal Reports imprime un subtotal de los valores en el campo {pedidos.MONTO DEL PEDIDO} (un total de pedidos para el cliente individual). Tambi&#233;n puede ordenar y agrupar por campos para producir res&#250;menes. </p><a name="40147"></a><h4>Pasar a trav&#233;s SQL
</h4><p><a name="40148"></a>La capacidad de hacer que el Servidor SQL procese el criterio de recuperaci&#243;n de datos y as&#237; devolver el conjunto de resultados m&#225;s peque&#241;o posible a Seagate Crystal Reports para su procesamiento final. Cuando el procesamiento puede ser pasado al servidor, la elaboraci&#243;n de informes se hace m&#225;s eficiente y a la vez se minimiza el tr&#225;fico de red.</p><a name="40224"></a><h4>Pegar
</h4><p><a name="40225"></a>Pegar significa recuperar y ubicar datos desde el Portapapeles, dentro de un informe o f&#243;rmula. Los datos pueden haberse obtenido del mismo informe o f&#243;rmula o desde uno diferente.</p><a name="40298"></a><h4>Pie de grupo
</h4><p><a name="40299"></a>Un Pie de grupo es una secci&#243;n creada por el programa cada vez que usted inserta un grupo, un resumen, o un subtotal. La secci&#243;n Pie de grupo es utilizada t&#237;picamente para mostrar el resumen o subtotal.</p><a name="40368"></a><h4>Pie de informe
</h4><p><a name="52826"></a>La secci&#243;n Pie de informe es la &#250;ltima secci&#243;n de su informe en la ficha Dise&#241;o. Usted puede poner un resumen en esta secci&#243;n, para que s&#243;lo aparezca en la &#250;ltima p&#225;gina de su informe.</p><a name="40462"></a><h4>Pie de p&#225;gina
</h4><p><a name="40463"></a>Un pie de p&#225;gina es texto que aparece al final de una p&#225;gina del informe. El texto del pie de p&#225;gina a menudo incluye los n&#250;meros de p&#225;gina y algunas veces otra informaci&#243;n que describe o identifica el informe. Seagate Crystal Reports le da la opci&#243;n de imprimir el pie de p&#225;gina en todas las p&#225;ginas o s&#243;lo en p&#225;ginas seleccionadas de su informe.</p><a name="40604"></a><h4>Plantilla
</h4><p><a name="40605"></a>Una plantilla es una copia de un informe usado como el punto de inicio para la creaci&#243;n de un nuevo informe. Cuando se utiliza una plantilla, no se altera el informe original.</p><a name="40749"></a><h4>Poblaci&#243;n
</h4><p><a name="40750"></a>Una poblaci&#243;n es el conjunto total de valores que pudieran ser analizados estad&#237;sticamente, en contraste a una muestra que es un subconjunto de la poblaci&#243;n. Una poblaci&#243;n no necesariamente se refiere a un grupo de gente; se puede referir al n&#250;mero de autom&#243;viles producidos en una l&#237;nea de montaje o al n&#250;mero de empresas constructoras licitando un proyecto.</p><p><a name="40751"></a>Por ejemplo, un agente de inmobiliaria podr&#237;a vender 20 casas en un a&#241;o. La poblaci&#243;n de casas vendidas por esa persona en ese a&#241;o es 20.</p><a name="40871"></a><h4>Predeterminado
</h4><p><a name="40872"></a>Predeterminado es una respuesta de datos cargada con anterioridad para una solicitud del software. Es la respuesta que la computadora acepta autom&#225;ticamente si usted no ingresa datos diferentes.</p><a name="82295"></a><h4>Procesamiento del lado del servidor
</h4><p><a name="82296"></a>El Procesamiento del lado del servidor es una caracter&#237;stica con la cual usted puede configurar informes que ejecutan la mayor parte de su procesamiento en el servidor. Estos informes solamente mandan los datos pertinentes a su computadora, ahorr&#225;ndole as&#237; tiempo y memoria.</p><a name="41081"></a><h4>Programa contenedor OLE
</h4><p><a name="41082"></a>Un programa contenedor OLE es un programa que puede contener y procesar objetos OLE creados en cualquier programa (como Paint o Paintbrush, etc.). Seagate Crystal Reports es un programa contenedor.</p><a name="41083"></a><h4>Programa servidor OLE
</h4><p><a name="41084"></a>Un programa servidor OLE es un programa que crea y ubica objetos OLE en documentos creados por programas contenedor. Seagate Crystal Reports es un programa contenedor; por lo que Microsoft Word y Excel son ejemplos de programas servidor.</p><a name="41153"></a><h4>Propiedad de ajustar
</h4><p><a name="41154"></a>Ajustar es una propiedad "magn&#233;tica" que atrae objetos cercanos. Seagate Crystal Reports usa dos recursos que tienen la propiedad de ajustar: L&#237;neas gu&#237;a y Cuadr&#237;cula. Siempre que un objeto es movido cerca de una l&#237;nea gu&#237;a o una coordenada de cuadr&#237;cula, el programa lo ajusta a la posici&#243;n para ubicaci&#243;n y alineaci&#243;n precisas.</p><a name="41354"></a><h4>Propiedades condicionales
</h4><p><a name="41355"></a>Realizadas en un objeto s&#243;lo si la expresi&#243;n de comparaci&#243;n regresa Verdadera.</p><p><a name="41356"></a>El valor 5 es una constante; el valor del campo Cantidad (que algunas veces puede ser 5, algunas veces puede ser un n&#250;mero diferente) es un valor variable. Por ejemplo, en la f&#243;rmula para convertir libras a onzas "Onzas = Libras * 16", 16 es una constante mientras que Onzas y Libras son variables. En la f&#243;rmula "Hoy - 1 de Enero de 1900", 1 de Enero, 1900, es una constante, mientras que Hoy es una variable que cambia siempre que la fecha actual cambia. En Seagate Crystal Reports, las constantes pueden ser n&#250;meros, cadenas de texto, fechas, cantidades en d&#243;lares, hora, fecha/hora, o el resultado de una f&#243;rmula que en s&#237; misma no contiene variables (por ejemplo, 14-9).</p><a name="41422"></a><h4>Propiedades fijas
</h4><p><a name="41423"></a>Propiedades que siempre ser&#225;n realizadas en el objeto.</p><a name="41494"></a><h4>Propiedades
</h4><p><a name="41495"></a>Propiedades son cualidades que definen la apariencia o acci&#243;n de un objeto o una secci&#243;n. Hay dos clases de propiedades en Seagate Crystal Reports:</p><p><a name="41496"></a>1.&nbsp;&nbsp;&nbsp;&nbsp; <strong>Activar/Desactivar<br></strong>Una propiedad que solo puede ser activada o desactivada.</p>
<p><a name="41497"></a>2.&nbsp;&nbsp;&nbsp;&nbsp; <strong>Atributo<br></strong>Una propiedad para la que usted tiene que suplir un valor.</p>
<a name="41724"></a><h4>Protecci&#243;n para divisi&#243;n por cero
</h4><p><a name="41725"></a> Las computadoras personales no permiten dividir un n&#250;mero por cero. Si lo intenta, obtendr&#225; un mensaje de error del sistema. Para protejerlo de un error del sistema, el programa rehusa imprimir un informe que contenga una f&#243;rmula que divida un valor por cero.</p><a name="40660"></a><h4>Punta de flecha
</h4><p><a name="79168"></a>S&#237;mbolo para mostrar que un campo est&#225; indexado.</p><a name="79170"></a><h4>Punto de inserci&#243;n
</h4><p><a name="41897"></a>El punto de inserci&#243;n es una l&#237;nea vertical que indica el punto en el cual Seagate Crystal Reports insertar&#225; cualquier texto que usted escriba. Establece el punto de inserci&#243;n al mover el cursor "I" a la posici&#243;n deseada para insertar texto y hacer clic. Cuando escribe por primera vez en una secci&#243;n de la ficha Dise&#241;o, el programa fija el punto de inserci&#243;n a la izquierda de la secci&#243;n del texto, sin importar donde haya hecho clic con el cursor "I".</p><a name="42152"></a><h4>Rango
</h4><p><a name="42153"></a>Un rango es un conjunto de valores que caen dentro de un cierto l&#237;mite e incluyen un l&#237;mite superior e inferior definidos. Por ejemplo, el rango 10 a 20 incluye 10, 20, y todos los n&#250;meros que caen entre medio. Tambi&#233;n, el rango 1ro. de Enero de 1991 al 30 de Enero de 1991, incluye el 1ro. de Enero, el 30 de Enero, y todas las fechas que caen entre &#233;stos. En Seagate Crystal Reports, un rango puede consistir de n&#250;meros, cantidades en d&#243;lares, o fechas.</p><a name="42156"></a><h4>Registro
</h4><p><a name="42157"></a>En una base de datos, un registro es una unidad completa de informaci&#243;n relacionada, una carpeta de archivo electr&#243;nico que contiene todos los datos sobre una entidad dada. Cada registro contiene uno o m&#225;s campos que contienen los datos espec&#237;ficos de inter&#233;s. En una base de datos de clientes, por ejemplo, un registro almacenar&#237;a todos los datos sobre un solo cliente. En una base de datos de inventario, un registro almacenar&#237;a todos los datos sobre un solo art&#237;culo de inventario. Los datos de un registro individual son mostrados o impresos como una fila de datos en un informe de columnas.</p><a name="42279"></a><h4>Regla
</h4><p><a name="42280"></a>La regla proporciona una referencia visual para ubicar y cambiar de tama&#241;o campos, gr&#225;ficos, l&#237;neas, cuadros, y bitmaps. Los incrementos en la regla est&#225;n basados en su configuraci&#243;n de medici&#243;n en la secci&#243;n Internacional del panel de control de Windows. La regla tambi&#233;n permite cambiar los m&#225;rgenes de p&#225;gina mientras que al mismo tiempo, ve el resultado de los cambios introducidos al informe mismo.</p><p><a name="42281"></a>La regla es visible tanto en la ficha Dise&#241;o como en la Ficha Vista Previa cuando sus respectivos cuadros de verificaci&#243;n est&#225;n activados en el cuadro de di&#225;logo Opciones.</p><a name="42490"></a><h4>Regresar
</h4><p><a name="42491"></a>La palabra "regresar" o "retornar" se refiere al resultado de una funci&#243;n, una operaci&#243;n, o una f&#243;rmula. Por ejemplo:</p><ul type="disc"><a name="42492"></a><li>Cuando usa una funci&#243;n, &#233;sta realiza un c&#225;lculo o manipulaci&#243;n que resulta en un cambio de datos de alg&#250;n tipo. Los datos que resultan son los que la funci&#243;n regresa. Por ejemplo, Average(1, 2, 3, 4, 5) regresa el promedio del arreglo de la matriz 1, 2, 3, 4, 5. Truncate (1.2345) regresa la parte entera (n&#250;mero completo) del n&#250;mero 1.2345.
<a name="42493"></a><li>Cuando utiliza un operador, el resultado de la operaci&#243;n usando ese operador es lo que regresa la operaci&#243;n. Por ejemplo, 5*6 es igual a 30. Se puede decir que la operaci&#243;n 5*6, regresa 30. Tambi&#233;n, la operaci&#243;n 100&lt;200 compara los dos valores y regresa Verdadero; 200&lt;100 compara los dos valores y regresa Falso.
<a name="42494"></a><li>Cuando se utiliza una f&#243;rmula que contiene funciones u operadores, cada funci&#243;n u operaci&#243;n dentro de la f&#243;rmula regresa un resultado, pero la f&#243;rmula total tambi&#233;n regresa un resultado. Cuando se habla de una f&#243;rmula, es el resultado de la f&#243;rmula lo que interesa, no el resultado de las funciones u operaciones individuales. Por ejemplo, en la f&#243;rmula siguiente:
</ul><PRE><a name="42495"></a>&nbsp;&nbsp;&nbsp;&nbsp;If {archivo.CANTIDAD} &lt; {archivo.MONTO DE<br>
&nbsp;&nbsp;&nbsp;&nbsp;REORDEN} Then<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;"Reordenar "<br>
&nbsp;&nbsp;&nbsp;&nbsp;Else <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;" "
<p class="indent"><a name="42496"></a>Una operaci&#243;n interna compara el valor del campo {archivo.CANTIDAD} con el valor del campo {archivo.MONTO DE REORDEN}. Si {archivo.CANTIDAD} es menor que {archivo.MONTO DE REORDEN}, esa operaci&#243;n individual regresa el valor Verdadero, pero eso no es lo que la f&#243;rmula en su totalidad regresa. La f&#243;rmula regresa el indicador "Reordenar" cuando la operaci&#243;n regresa internamente el valor Verdadero.</p></PRE><a name="42584"></a><h4>Resumen
</h4><p><a name="42585"></a>Un resumen es el valor generado como resultado de una evaluaci&#243;n, una cuenta, o un c&#225;lculo realizado sobre los datos de un solo grupo.</p><p><a name="42587"></a>En un promedio de grupo, Seagate Crystal Reports promedia los valores en un grupo de registros; en una cuenta de grupo, cuenta los valores en un grupo de registros, y as&#237; sucesivamente. Los valores de resumen son importantes herramientas para la creaci&#243;n de informes excepcionales.</p><a name="42667"></a><h4>Secci&#243;n
</h4><p><a name="42668"></a>Una secci&#243;n es una parte del entorno de dise&#241;o del informe. El programa divide el entorno de dise&#241;o en varias secciones, cada una de las cuales tiene diferentes caracter&#237;sticas de impresi&#243;n. Usted pone objetos en las diversas secciones para construir su informe.</p><a name="42767"></a><h4>Secci&#243;n Detalles
</h4><p><a name="106978"></a>La secci&#243;n Detalles de un informe es la parte principal del informe. Usted estructura el informe en esta secci&#243;n insertando campos de datos, f&#243;rmulas y otros elementos del informe.</p><a name="106979"></a><h4>Seleccionar
</h4><ul type="disc"><a name="42983"></a><li>Con respecto a un elemento del informe (campo de datos, f&#243;rmula, etc.), seleccionar significa apuntar al elemento y hacer clic para elegirlo como el objeto de la pr&#243;xima selecci&#243;n de men&#250;.
<a name="42984"></a><li>Con respecto a texto, seleccionar significa resaltar el texto arrastrando el cursor "I" sobre &#233;ste.
<a name="42985"></a><li>Con respecto a registros, seleccionar significa identificar y elegir aquellos registros de inter&#233;s mientras se descartan otros.
<a name="42986"></a><li>Con respecto a grupos, seleccionar significa identificar y elegir aquellos grupos de inter&#233;s mientras se descartan otros.
</ul><a name="43094"></a><h4>Sintaxis
</h4><p><a name="43095"></a>Sintaxis, en Seagate Crystal Reports, es un conjunto de reglas que especifican la manera adecuada para usar las funciones y operadores en las f&#243;rmulas.</p><a name="43125"></a><h4>Sintaxis de F&#243;rmula
</h4><p><a name="43126"></a>La sintaxis de f&#243;rmula es el conjunto de reglas gramaticales que necesita seguir cuando crea f&#243;rmulas utilizando el lenguaje de f&#243;rmulas.</p><a name="43374"></a><h4>Smart Processing Cache
</h4><p><a name="104544"></a>El Servidor de Crystal Web Report almacena los informes solicitados en el directorio Smart Processing Cache (Cach&#233; de procesamiento inteligente). Cuando un usuario solicita un informe con un explorador web, el informe se genera y almacena en la memoria cach&#233;. Si otro usuario solicita el mismo informe, el Servidor de Crystal Web Report recupera el informe del cach&#233; en lugar de generarlo nuevamente.</p><p><a name="104545"></a>El Servidor de Crystal Web Report invalida informes "cach&#233;" que no se han usado por largo tiempo. Limpiezas peri&#243;dicas de la memoria cach&#233; para eliminar archivos deja espacio disponible para informes m&#225;s recientes o de uso m&#225;s frecuente. El proceso de almacenar informes de uso frecuente en la memoria cach&#233; y eliminar los que no se usan, posibilita el uso eficiente del servidor web y los recursos de la red, reduciendo el tr&#225;fico en la red y la generaci&#243;n repetida de informes.</p><a name="43442"></a><h4>Solicitud
</h4><p><a name="43443"></a>Una solicitud es un conjunto de criterios que especifican el subconjunto de datos que desea usar en su informe. Por ejemplo, si desea que su informe s&#243;lo contenga datos de California, se puede crear una solicitud de selecci&#243;n de registros que s&#243;lo recupere registros de California para su informe. Usted crea solicitudes de selecci&#243;n de registros y grupos utilizando el Asistente de Selecci&#243;n.</p><a name="43480"></a><h4>SQL
</h4><p><a name="43481"></a>SQL es un acr&#243;nimo para Structured Query Language (Lenguaje Estructurado de Consultas); un sistema para administrar, organizar y recuperar datos almacenados en una base de datos de computadora. El Lenguaje Estructurado de Consultas es un lenguaje de computadora que permite interactuar con un tipo espec&#237;fico de base de datos llamada base de datos relacional.</p><a name="43509"></a><h4>Subcadena
</h4><p><a name="43510"></a>Una subcadena es simplemente una parte de una cadena m&#225;s grande. "Columbia" es una subcadena de la cadena "British Columbia," "1040" es una subcadena del n&#250;mero de cliente "B-1040-0032456," y "B" es una subcadena de la cadena "Presidente Bill Clinton". </p><a name="43553"></a><h4>Subinformes
</h4><p><a name="109133"></a>Un subinforme es un informe dentro de un informe. Tiene todas las caracter&#237;sticas de un informe con una excepci&#243;n: no puede incluir un subinforme. Los subinformes pueden ser de categor&#237;a libre o pueden estar vinculados a los datos en el informe principal. Seagate Crystal Reports le permite insertar tantos informes como desee.</p><a name="109137"></a><h4>Subtotal
</h4><p><a name="109138"></a>Un subtotal es un total parcial, un total de un grupo de datos limitado y espec&#237;fico en un campo. Por ejemplo, dado los siguientes datos:</p><PRE><a name="43590"></a>1, 2, 3, 4, 5, 6, 7
</PRE><p><a name="43591"></a>un subtotal despu&#233;s del 3 produce el valor 6 (1 + 2 + 3). Un segundo subtotal despu&#233;s del 6 produce el valor 15 (4 + 5 + 6).</p><p><a name="79355"></a>Un subtotal es la suma de todos los valores de un campo, de todos los registros en un grupo. En un informe de ventas, por ejemplo, si subtotaliza la cantidad ordenada por representante de ventas, Seagate Crystal Reports junta todos los registros que pertenecen a un determinado representante de ventas y totaliza las cantidades ordenadas de todos los registros. </p><a name="43623"></a><h4>Subyacer
</h4><p><a name="43624"></a>Es la posibilidad de imprimir un objeto (un bitmap, un gr&#225;fico, etc.) "por debajo" de secciones posteriores a la secci&#243;n en que fue ubicado. Por ejemplo, puede poner un bitmap en una secci&#243;n, formatear la secci&#243;n para que aparezca en las siguientes secciones y entonces agrandar el bitmap para que aparezca como fondo en toda la p&#225;gina de su informe.</p><a name="283"></a><h4>Tablas cruzadas
</h4><p><a name="285"></a>Tablas cruzadas son informes que resumen datos y luego presentan los res&#250;menes en un formato compacto de filas y columnas que facilita el hacer comparaciones e identificar tendencias.</p><a name="43796"></a><h4>Tiempo de evaluaci&#243;n
</h4><p><a name="43797"></a>El tiempo de evaluaci&#243;n se refiere al tiempo en el proceso de elaboraci&#243;n de informes en que se eval&#250;a una f&#243;rmula. Tres funciones de tiempos de evaluaci&#243;n son:</p><p><a name="43798"></a>1.&nbsp;&nbsp;&nbsp;&nbsp; BeforeReadingRecords</p>
<p><a name="43799"></a>2.&nbsp;&nbsp;&nbsp;&nbsp; WhileReadingRecords</p>
<p><a name="43800"></a>3.&nbsp;&nbsp;&nbsp;&nbsp; WhilePrintingRecords.</p>
<a name="307"></a><h4>Tipos de datos
</h4><p><a name="309"></a>Un tipo de datos es una clasificaci&#243;n de los datos que aparecen en un campo o f&#243;rmula. Cada parte de dato utilizado en un informe o f&#243;rmula viene de uno de los siguientes tipos de datos: texto, moneda, n&#250;mero, fecha, fecha/hora, hora o Booleano (VERDADERO/FALSO). Es importante entender los tipos de datos porque cada funci&#243;n y operador trabaja s&#243;lo con un n&#250;mero limitado de tipos de datos (a menudo uno solo). Para algunos operadores (+ y - por ejemplo), el programa utiliza un conjunto diferente de reglas de c&#225;lculo para un tipo de datos de los que utiliza para otro.</p><a name="43846"></a><h4>Total
</h4><p><a name="43847"></a>Un total es una suma de valores. Los Subtotales y Totales generales son diferentes variantes de totales.</p><a name="43880"></a><h4>Total general
</h4><p><a name="43881"></a>Un total general es el resumen de todos los valores en una columna para el informe completo.</p><a name="43914"></a><h4>Totales acumulados
</h4><p><a name="43915"></a>Los totales acumulados por lo general son totales mostrados de registro en registro. Totalizan todos los registros (en el informe, en el grupo, y dem&#225;s) hasta e incluyendo el &#250;ltimo registro. Por ejemplo, si sus primeros tres registros tienen los valores de 2, 4, y 6, los totales acumulados para cada uno de los tres registros ser&#237;an 2, 6 y 12, respectivamente.</p><a name="43964"></a><h4>Truncar
</h4><p><a name="43965"></a>Truncar significa cortar o eliminar todos los datos que vienen despu&#233;s de un punto decimal. Por lo tanto si trunca 1.2345 obtiene el valor 1. Si trunca el valor 1.9999 tambi&#233;n se obtiene el valor 1. Truncar no significa redondear valores sino simplemente eliminar datos no deseados.</p><a name="43991"></a><h4>Uno a varios
</h4><p><a name="43992"></a>Uno a varios se refiere a una situaci&#243;n que ocurre en bases de datos vinculadas en las cuales un registro en una base de datos puede ser cotejada con muchos registros en otra base de datos. Un ejemplo de un v&#237;nculo Uno a varios ocurrir&#237;a al vincular una tabla de clientes a una tabla de pedidos. En tal caso, para cada cliente en la base de datos principal, habr&#237;a t&#237;picamente muchos pedidos en la segunda base de datos (de b&#250;squeda).</p><a name="44012"></a><h4>Valor
</h4><p><a name="44013"></a>Un valor es un dato que se encuentra en un campo. En un campo llamado {cliente.NOMBRE DE CONTACTO}, por ejemplo, Juan o Mar&#237;a podr&#237;an ser el valor. En un campo llamado {pedidos.MONTO DEL PEDIDO }, 1234.55 o $200 podr&#237;an ser el valor.</p><a name="107013"></a><h4>Valor de Campo
</h4><p><a name="107014"></a>Vea definici&#243;n de <EM>Valor</EM>.</p><a name="107015"></a><h4>Variancia
</h4><p><a name="44033"></a>Variancia es el cuadrado de la desviaci&#243;n est&#225;ndar. Es una medida de la cantidad por la cual todos los valores dentro de un grupo var&#237;an del valor del t&#233;rmino medio (promedio) dentro de un grupo. Es una prueba estad&#237;stica que puede ser utilizada para evaluar la variabilidad dentro de un grupo de valores (por ejemplo, la cantidad presupuestada por cada uno de los postores en un proyecto de construcci&#243;n).</p><p><a name="44034"></a>La variancia (en oposici&#243;n a Variancia de poblaci&#243;n) se usa para proyectar la variancia de toda una poblaci&#243;n (todos los valores) bas&#225;ndose en peque&#241;as muestras de esa poblaci&#243;n. Por ejemplo, dentro de un peque&#241;o n&#250;mero de postores en un proyecto de construcci&#243;n, Quiz&#225;s usted quiera proyectar la variancia para todos los postores bas&#225;ndose en la muestra ya tomada. O bas&#225;ndose en los montos de ventas de los tres primeros meses del a&#241;o, quiz&#225;s usted quiera proyectar la variancia de los pedidos para todo el a&#241;o (incluyendo los nueve meses que faltan).</p><p><a name="104748"></a>Estas comparaciones son simplemente un uso t&#237;pico. En la pr&#225;ctica, algunos usuarios prefieren c&#225;lculos basados en valores N (PopulationVariance) mientras que otros prefieren un c&#225;lculo basado en valores N-1 (Variance). Ambas formas de variancia est&#225;n en el programa. Para una mejor explicaci&#243;n sobre como usar la variancia, consulte cualquier texto adecuado de estad&#237;stica.</p><a name="44072"></a><h4>Variancia de poblaci&#243;n
</h4><p><a name="44073"></a>La variancia de poblaci&#243;n es el cuadrado de la desviaci&#243;n est&#225;ndar de la poblaci&#243;n. Es una medida de la cantidad en que los valores en toda una poblaci&#243;n var&#237;an del valor promedio para esa poblaci&#243;n. </p><p><a name="44074"></a>La variancia de poblaci&#243;n se usa t&#237;picamente cuando todos los valores est&#225;n siendo evaluados en lugar de una muestra de esos valores solamente (Variancia).</p><p><a name="104801"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>Esta comparaci&#243;n simplemente sugiere un uso t&#237;pico. En la pr&#225;ctica, algunos usuarios prefieren un c&#225;lculo basado en valores N (PopulationVariance) mientras otros prefieren un c&#225;lculo basado en valores N-1 (Variance). Ambas formas de variancia est&#225;n en el programa.</p>
<a name="44094"></a><h4>Verificar
</h4><p><a name="44095"></a>En t&#233;rminos de Seagate Crystal Reports verificar no significa reparar y compactar la base de datos (archivo MDB) como en Access. Significa permitir que el informe entienda los cambios hechos a la estructura de la base de datos (campos y tablas, NO registros).</p><a name="657"></a><h4>V&#237;nculo
</h4><p><a name="8114"></a>Un v&#237;nculo es un campo en com&#250;n para dos o m&#225;s bases de datos y que sirve como punto de conexi&#243;n entre esas bases de datos. Seagate Crystal Reports usa el v&#237;nculo para hacer coincidir los registros de una base de datos con aquellos de otra(s). Por ejemplo, si cada una de las bases de datos contiene un campo de n&#250;mero de cliente (aunque los campos pudieran tener nombres diferentes), Seagate Crystal Reports puede utilizar esos campos para conectar electr&#243;nicamente todos los registros en una base de datos con los correspondientes registros en la(s) otra(s). Cuando usted crea un solo informe basado en m&#250;ltiples bases de datos, el v&#237;nculo asegura que todos los datos en cada fila de ese informe se refieran al mismo cliente (transacci&#243;n, factura, etc.).</p><p><a name="104926"></a><font color="darkblue"><b>Nota:   &nbsp;&nbsp;&nbsp;</b></font>El t&#233;rmino "v&#237;nculo" en Seagate Crystal Reports es equivalente al t&#233;rmino "relaci&#243;n" en Microsoft Access.</p>

<hr><br>

<script  language="JavaScript"><!--

var prev = "experts66.html";
var next = "crw_spIX.hhk";

function setTopicID() { 
      var number = "114761"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "crw_spTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Pgina anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "crw_spIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Pgina siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el ndice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Enve sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


