<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">

<html>
<head>
<title>Par&#225;metros </title>

<link REL=STYLESHEET TYPE="text/css" HREF="seagate.css">

<!--
                 ***********************************
                 * Seagate Software copyright 1999 *
                 ***********************************

                      Template version: 5.1
-->


</head>

<body bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#0000FF" alink="#800080">


 
<a name="153826"></a><h4 class="newpage"> Par&#225;metros </h4><p><a name="153827"></a>El visor de informes para ActiveX incluye varios par&#225;metros opcionales que permiten personalizar el aspecto del visor y controlar su funcionalidad. Asigne valores a estos par&#225;metros utilizando la etiqueta est&#225;ndar PARAM de su c&#243;digo HTML.</p><a name="153828"></a><h5>DisplayGroupTree</h5><p><a name="153829"></a>Determina si se muestra el &#225;rbol de grupos cuando el visor aparece por primera vez. Si el par&#225;metro Has Group Tree est&#225; establecido en falso, este par&#225;metro no se tiene en cuenta. Si el &#225;rbol de grupos est&#225; oculto, el usuario puede visualizarlo haciendo clic en el bot&#243;n Mostrar/ocultar el &#225;rbol de grupos del visor.</p><ul type="disc"><a name="153830"></a><li>El valor 1 (TRUE) muestra el &#225;rbol de grupos.
<a name="153831"></a><li>El valor 0 (FALSE) oculta el &#225;rbol de grupos.
</ul><a name="153832"></a><h5>EnableAnimationControl</h5><p><a name="153833"></a>Determina si el visor muestra el control de animaci&#243;n. El control de animaci&#243;n se ejecuta mientras un informe est&#225; siendo generado y descargado. Una vez que el informe llega completamente al explorador web de cliente, la animaci&#243;n se detiene.</p><ul type="disc"><a name="153834"></a><li>El valor 1 (TRUE) muestra el control de animaci&#243;n.
<a name="153835"></a><li>El valor 0 (FALSE) impide que el control de animaci&#243;n aparezca.
</ul><a name="153836"></a><h5>EnableDrillDown</h5><p><a name="153837"></a>Determina si un usuario puede profundizar en valores de resumen en un informe de profundizaci&#243;n. En un informe de profundizaci&#243;n que aparece en el visor de informes para ActiveX, el puntero del mouse se transforma en una lupa al situarse sobre cualquier grupo o valor en el que se puede profundizar. Haga doble clic en el grupo o valor para visualizar una ficha Profundizar separada en el visor.</p><ul type="disc"><a name="153838"></a><li>El valor 1 (TRUE) indica que el usuario puede profundizar en los informes.
<a name="153839"></a><li>El valor 0 (FALSE) indica que el usuario no est&#225; autorizado a profundizar en los informes.
</ul><a name="153840"></a><h5>EnableExportButton</h5><p><a name="153841"></a>Determina si el bot&#243;n de exportaci&#243;n aparece o no en el visor de informes. Si el bot&#243;n de exportaci&#243;n aparece, el usuario puede exportar el informe visualizado a formato Microsoft Word, Microsoft Excel, HTML 3.2 o Seagate Crystal Reports.</p><ul type="disc"><a name="153842"></a><li>El valor 1 (TRUE) muestra el bot&#243;n de exportaci&#243;n.
<a name="153843"></a><li>El valor 0 (FALSE) impide que el bot&#243;n de exportaci&#243;n aparezca.
</ul><a name="153844"></a><h5>EnableGroupTree</h5><p><a name="153845"></a>Determina si el visor genera un &#225;rbol de grupos para el informe. No determina si el &#225;rbol de grupos se muestra o no. Si HasGroupTree est&#225; establecido en 0, ShowGroupTree se establece autom&#225;ticamente en 0.</p><ul type="disc"><a name="153846"></a><li>El valor 1 (TRUE) genera un &#225;rbol de grupos.
<a name="153847"></a><li>El valor 0 (FALSE) impide que se genere un &#225;rbol de grupos.
</ul><a name="153848"></a><h5>EnablePrintButton</h5><p><a name="153849"></a>Determina si el usuario puede o no imprimir el informe en una impresora. Cuando el usuario hace clic en el bot&#243;n de impresi&#243;n, el informe se env&#237;a a una impresora de acuerdo con los ajustes seleccionados en el cuadro de di&#225;logo de impresi&#243;n est&#225;ndar. Si el par&#225;metro Has Print Button est&#225; establecido en 0, no es posible imprimir. Para m&#225;s informaci&#243;n, vea <a href="Report_Viewers5.html#149387">Impresi&#243;n desde visores de informes</a>.</p><ul type="disc"><a name="153853"></a><li>El valor 1 (TRUE) muestra el bot&#243;n de impresi&#243;n. 
<a name="153854"></a><li>El valor 0 (FALSE) impide que el bot&#243;n de impresi&#243;n aparezca.
</ul><a name="153855"></a><h5>EnableRefreshButton</h5><p><a name="153856"></a>Determina si hay un bot&#243;n de actualizaci&#243;n disponible en el visor para permitir al usuario actualizar los datos del informe.</p><ul type="disc"><a name="153857"></a><li>El valor 1 (TRUE) permite a los usuarios actualizar los datos del informe.
<a name="153858"></a><li>El valor 0 (FALSE) impide a los usuarios actualizar los datos del informe.
</ul><a name="153859"></a><h5>EnableSearchControl</h5><p><a name="153860"></a>El control y el bot&#243;n de b&#250;squeda que aparecen en el visor de informes para ActiveX permiten a un usuario buscar y desplazarse f&#225;cilmente a instancias de un valor o campo espec&#237;fico del informe. El usuario introduce el valor en la lista desplegable y luego hace clic en el bot&#243;n de b&#250;squeda para buscar la primera instancia de dicho valor. Haciendo clic repetidamente en el bot&#243;n, el usuario puede buscar instancias sucesivas del valor en el informe.</p><ul type="disc"><a name="153861"></a><li>El valor 1 (TRUE) muestra los controles de b&#250;squeda. 
<a name="153862"></a><li>El valor 0 (FALSE) impide que los controles de b&#250;squeda aparezcan.
</ul><a name="153863"></a><h5>EnableZoomControl</h5><p><a name="153864"></a>Utilice el control de zoom para cambiar entre distintos niveles de ampliaci&#243;n en el visor de informes para ActiveX. Con el control de zoom, puede ampliar el informe hasta un 400% de su tama&#241;o original, o bien reducirlo hasta un 25% para ver un &#225;rea mayor del informe de una vez.</p><ul type="disc"><a name="153865"></a><li>El valor 1 (TRUE) muestra el control de zoom. 
<a name="153866"></a><li>El valor 0 (FALSE) impide que el control de zoom aparezca.
</ul>
<hr><br>

<script  language="JavaScript"><!--

var prev = "Report_Viewers10.html";
var next = "Report_Viewers12.html";

function setTopicID() { 
      var number = "153826"; 
      return number; 
}

// --></script>




<SCRIPT>

if (!window.parent.toc && navigator.appName == "Netscape") {

   document.writeln ('<TABLE ALIGN="left" border="0" cellspacing="0" cellpadding="10">');
   document.writeln ('<TR>');
   document.write ('<TD ALIGN="left">');

   if (prev != "wcmadminTOC.hhc") {
      document.writeln ('<A HREF="' + prev + '">');
      document.writeln ('<IMG SRC="prevpage.gif" HEIGHT=17 BORDER=0 ALT="Página anterior"></A>');
   } else {
//   window.alert ('no previous page');
   }

   if (next != "wcmadminIX.hhk") {
      document.writeln ('<A HREF="' + next + '">');
      document.writeln ('<IMG SRC="nextpage.gif" HEIGHT=17 BORDER=0 ALT="Página siguiente"></A>');
   } else {
//   window.alert ('no next page');
   }
   document.writeln ('</TD><TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?TOC">');
   document.writeln ('<IMG SRC="showtoc.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el contenido"></A></TD>');
   document.writeln ('<TD ALIGN="left">');
   document.writeln ('<A HREF="frameset.htm?IDX">');
   document.writeln ('<IMG SRC="showix.gif" HEIGHT=17 BORDER=0 ALT="Haga clic para ver el índice"></A></TD>');
   document.writeln ('</TD>');
   document.writeln ('</TR>');
   document.writeln ('</TABLE>');

}

</SCRIPT>
<table align="right" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td align="right"><font size="1">Seagate Software, Inc.<br>
    <a href="http://www.seagatesoftware.com">http://www.seagatesoftware.com</a><br>
    Envíe sus comentarios a:<br>
    <a href="mailto:techpubs@seagatesoftware.com">techpubs@seagatesoftware.com</a><br>
    </font></td>
  </tr>
</table>
</body>
</html>


